[
{"search": "Data Analyst", "job_title": "Commercial Analyst", "company": "Tas Gas Networks Pty Ltd", "location_1": "Launceston & North East", "location_2": "Accounting", "sector_1": "Accounting", "sector_2": "Analysis & Reporting", "work_type": "Full Time", "salary": null, "desc": ["About us", "At Tas Gas, we grow and evolve with the lives of our 14,000 plus customers in Tasmania and Victoria, shaping a cleaner energy future for all. We are dedicated to serving our energy customers, anticipating their needs and exceeding their expectations.", "What's on offer?", "Based at our office in Launceston, this is an exciting opportunity for a person seeking variety and looking to use and develop their problem solving and decision-making skills in a dynamic working environment. ", "In this role you will be required to:", "Provide regular financial analysis, modelling, forecasting, and reporting with regards to energy demand and customer consumption", "Coordinate the development and monitoring of retail annual budgets including the preparation of monthly accruals", "Assist in the management of retail customer contracts including the development of pricing strategies, managing contract price escalations through to the billing system and responding to customer enquiries", "Assist in the update of customer pricing information in the retail billing system and assist in checking data integrity and accuracy", "Engage in planning to assist TG Retail’s customer growth", "Evaluate options and make recommendations underpinned by sound research, scenario testing and an understanding of the business strategy", "Analyse external drivers for the business including market trends, competitor positioning and market opportunities   ", "Use customer and/or business data to identify risks and opportunities ", "Understand Tas Gas’ vision and its application to day-to-day operations and provide informed input into strategy discussions  ", "Interpret data and analysis to provide customer insight and strategy to improve performance", "Provide support in the management of gas nominations and wholesale contract management", "To be successful in this role you will have:", "Proven track record in financial analysis and execution, including the presentation of recommendations ", "Min 3 years’ experience in business planning and/or customer analytics and digital analytics", "Strong analytical & presentation skills ", "Strong business acumen with an ability to plan, prioritise and deliver ", "Attention to detail and curiosity to question information ", "Strong relationship management and organisational skills ", "Ability to respond positively to changing priorities", "A customer first, service-delivery mind-set", "Benefits", "Tas Gas is a rewarding, challenging and impactful place to work where we take a collaborative approach to getting things done. Here you can have a career with purpose, flexible work options as well as unique opportunities for professional development and personal growth.", "How to Apply", "Send your resume and cover letter via the APPLY button. To make the process seamless, applicants must provide a cover letter as well as a resume addressing the skill requirements.", "For a copy of the position description, please go to https://www.tasgas.com.au/about/careers/vacancies. For queries, please email ", "recruitment@tasgas.com.au", " ", "Applications will close once a suitable candidate has been found.", "Shortlisted applicants only will be contacted."], "url": "https://www.seek.com.au/job/52491307?type=promoted#searchRequestToken=3f7e7080-d1dd-4fb1-a8b1-87b858beb551"},
{"search": "Data Analyst", "job_title": "Specialist Database Developer (Acurity)", "company": "MTAA Superannuation Fund (Secretariat Co.) Pty Limited", "location_1": "Hobart", "location_2": "Information & Communication Technology", "sector_1": "Information & Communication Technology", "sector_2": "Developers/Programmers", "work_type": "Full Time", "salary": null, "desc": ["MTAA Super and Tasplan merged on 1 April 2021 to become Spirit Super. ", "Spirit Super is a national organisation currently managing approximately $24.6 billion in funds under management, with offices in Canberra, Hobart, Melbourne, Sydney, Brisbane, Adelaide, Perth as well as providing member services throughout regional Australia. It’s envisioned that our merge will create Australia’s most dynamic superannuation fund, bringing customised super solutions to all Australians, across all locations and life stages. Service and advice excellence, digital innovation, top-quartile fees, and returns will drive outstanding retirement outcomes for members.", "We’re seeking to recruit an experienced database developer. This role will specialise in the support and ongoing development of the database platform that delivers our mission critical fund administration systems.  This role will provide direction and support for the data and database related components that underpin these systems including interfaces, API’s, scripting and configuration. Our key fund administration platforms include Iress Acurity, TechOne Financials, Iress Xplan, Microsoft Dynamics CRM and Microsoft SSRS. This role will work closely with the Manager - Application Development and the Manager - Administration Systems to deliver on organisational outcomes.", "Ideally, we are looking for:", "Extensive experience in database design and integration with SQL Server databases", "Proven experience in a database development role", "Proven knowledge and skills in the following areas: ", "Analysis of complex data structures", "Provision of ad-hoc, custom data extracts based on informal business requirements", "Performing data updates to address systems issues and maintain data hygiene", "Relational databases and Microsoft SQL Server", "ETL and reconciliation using Microsoft SSIS", "Data warehousing and solution design", "Agile development methodologies and best practices", "Report development using Microsoft SSRS", "We’d love to hear from you if you possess exceptional verbal and written communication skills and interpersonal skills, combined with commitment to, and enthusiasm for, client service and delivery. The person we’re hoping will join our team will be experienced with adapting to change, accepting new ideas, adapting interpersonal style, showing sensitivity to different cultures or backgrounds, and dealing with ambiguity at work.", "For further information about the role and a copy of the position description, email hr@spiritsuper.com.au [link removed]. ", "To apply, please include a cover letter addressed to Alex Mehl, Head of Technology, along with your resume and apply via the Seek website. Applications will close on ", "Friday 11 June 2021.", " "], "url": "https://www.seek.com.au/job/52449428?type=standout#searchRequestToken=3f7e7080-d1dd-4fb1-a8b1-87b858beb551"},
{"search": "Data Analyst", "job_title": "Data Engineer", "company": "Servian Pty Ltd", "location_1": "Hobart", "location_2": "Information & Communication Technology", "sector_1": "Information & Communication Technology", "sector_2": "Engineering - Software", "work_type": "Contract/Temp", "salary": null, "desc": ["Servian is an award winning, regional and global tech consultancy with a rich heritage in Data, DevOps, Digital app dev, Machine Learning and cloud. ", " ", "Servian Sydney are currently looking for multiple ", "Data Engineers ", "for a 6 month engagement with with one of our clients in the energy sector.", " ", "You will be joining a team of talented data consultants to work on a data platform implementation using the latest technologies. The role will be a mix of remote and on-site working. There is a strong possibility that the contract will extend after the initial 6 month period, opening up an opportunity to become a permanent Servian consultant.", " ", "About you:", " ", " ", "A strong analytical thinker and problem solver", " ", "Strong Data Warehouse experience", " ", "Experienced building end to end data pipelines using on-premise or cloud based data platforms", " ", "ETL/ELT experience", " ", "Experience in Snowflake and/or Matillion is highly desirable", " ", "If this role sounds of interest to you, then APPLY NOW!", " ", " "], "url": "https://www.seek.com.au/job/52352835?type=standout#searchRequestToken=3f7e7080-d1dd-4fb1-a8b1-87b858beb551"},
{"search": "Data Analyst", "job_title": "Wholesale Pricing Analyst", "company": "Opus Recruitment Solutions", "location_1": "Hobart", "location_2": "Mining, Resources & Energy", "sector_1": "Mining, Resources & Energy", "sector_2": "Analysis & Reporting", "work_type": "Full Time", "salary": "$110000 - $130000 per annum, + Super", "desc": ["JD Ross Energy and Opus Talent Solutions are excited to be partnering with Hydro Tasmania, in the search for an Energy Trader to join their trading team in Hobart.", " ", " Hydro Tasmania have been at the forefront of the energy transition, pioneering some of the biggest legacy projects in the country, such as the Marinus Link and Battery of the Nation. Recently striking a game changing, first-ever deal for the trade of stored energy.", " ", " This is a great opportunity for an Wholesale Pricing Lead to join a progressive utility that holds real family values, while working with dispatchable renewables, and in a role where you can make an impact.", " ", " At Hydro Tasmania, we’re leaders in renewable energy, powering Australia with clean hydropower.  We really care about making a difference for better, but it’s a big job and we can’t do it alone. Which is right where you come in. ", " ", " ", " ", "ABOUT THE ROLE ", " The primary focus of this role is to help the Commercial team maximise revenue for Hydro Tasmania by providing wholesale pricing for Tasmanian customers and Momentum Energy retail accurately and within a timely manner.", " The Wholesale Pricing Lead will evaluate new options for non-standard wholesale product or retail offerings by assisting with quantitative and qualitative marketing analysis, helping to improve Hydro Tasmania’s competitive position in the market. ", " ", " ", " ", "ABOUT YOU", " You hold a degree in Finance, Economics, Engineering or Mathematics and have strong mathematical modelling skills.  You’ve developed a deep knowledge of the National Electricity Market and understanding of wholesale trading and risk management.", " You’re an expert with Excel and other programs (Matlab, SQL, Python, R, Plexos). You’ll have a flair for presenting data in a convincing and easy to understand format.", " Agile and resilient, you are able to quickly adapt to shifting priorities. You’ll work collaboratively with a broad range of stakeholders across our operations, finance, commercial and IT teams. ", " A more comprehensive overview of the skills and competencies required for success in this role can be viewed on this position description:  ", " ", " ", " ", "WHAT YOU WILL GET BACK", " This is an opportunity to grow your career and redefine your role in tomorrow’s industry landscape.  We offer truly flexible work that suits you, a competitive remuneration package, and the rare opportunity to play a role in Australia’s renewable energy transformation while enjoying the Hobart lifestyle.", "  ", "  ", "  ", " "], "url": "https://www.seek.com.au/job/52402432?type=standard#searchRequestToken=3f7e7080-d1dd-4fb1-a8b1-87b858beb551"},
{"search": "Data Analyst", "job_title": "Business and Finance Analyst (424923)", "company": "Department of State Growth", "location_1": "Hobart", "location_2": "Government & Defence", "sector_1": "Government & Defence", "sector_2": "Government - State", "work_type": "Full Time", "salary": "$87,543.00 to $91,877.00 per annum", "desc": ["We are a diverse and inclusive workplace that understands the importance of flexibility. Talk to us about what flexibility may look like for you.", "\n", "Duties", "\n", "\n", "Scope and manage allocated business improvement initiatives, including the development of project plans, identification / management of risks and reporting on progress on projects to review and amend processes and policies regarding budget management and reporting by funding recipients.", "\n", "Support the development of department’s financial activities including coordinating community consultation submissions and divisional budget submissions, and drafting budget paper contributions.", "\n", "Analyse and monitor whole of department budgets and prepare advice on issues and potential areas of risk, including the keeping of a risk register and the suite of reports.", "\n", "Coordinate and manage budget-related requests, forecasts and variations into the department’s internal financial management system and Treasury’s budget and cash management systems.", "\n", "Develop robust revenue forecast models in consultation with relevant stakeholders.", "\n", "Assist in the development and implementation of strategies, policies, guidelines, risk management and improvements relevant to the effective and efficient management of the Department’s budget. This includes ongoing education and training of division staff.", "\n", "Assist the business unit in providing research, analysis, and support related to grants administration management activities, budgets and performance across the Division.  This will include the identification, review and implementation of business improvement initiatives;", "\n", "Analyse, monitor and report on divisional grants administration and program activity and assist in developing grant and divisional reporting KPI’s for use in Annual Reports, briefings and media releases.", "\n", "\n", "Desirable Requirements", "\n", " Relevant tertiary qualifications in accounting and/or Business Management are highly regarded ", "\n", "Download the Statement of Duties and Associated Documents", "\n", " ", "Statement of Duties - Business and Finance Analyst.docx", "\n", " ", "Statement of Duties - Business and Finance Analyst.pdf", "\n", " ", "Advice to applicants.DOCX", "\n", " ", "Advice to applicants.pdf", "\n", " ", "\n", "For more information Name: Nick Andrew  Position:  Manager Operations Email:  ", "nick.andrew@stategrowth.tas.gov.au", "  Phone:  ", "(03) 6165 5129", " How to apply", "\n", "To apply, please provide a one - two page document outlining your experience skills, and knowledge as they relate to the statement of duties and a copy of your current resume.", "\n", "Online applications are preferred, please click the blue Apply Now button.", "\n", "-or-", "\n", "Complete the following application form and email your application to us at ", "recruitment@stategrowth.tas.gov.au", "\n", " ", "Application for Employment (Form 201).DOCX", "\n", " ", "Application for Employment (Form 201).pdf", "\n", " "], "url": "https://www.seek.com.au/job/52549387?type=standard#searchRequestToken=3f7e7080-d1dd-4fb1-a8b1-87b858beb551"},
{"search": "Data Analyst", "job_title": "Business and Finance Analyst (424923)", "company": "Department of State Growth", "location_1": "Hobart", "location_2": "Accounting", "sector_1": "Accounting", "sector_2": "Management", "work_type": "Full Time", "salary": "$87,543.00 to $91,877.00 per annum", "desc": ["We are a diverse and inclusive workplace that understands the importance of flexibility. Talk to us about what flexibility may look like for you.", "\n", "Duties", "\n", "\n", "Scope and manage allocated business improvement initiatives, including the development of project plans, identification / management of risks and reporting on progress on projects to review and amend processes and policies regarding budget management and reporting by funding recipients.", "\n", "Support the development of department’s financial activities including coordinating community consultation submissions and divisional budget submissions, and drafting budget paper contributions.", "\n", "Analyse and monitor whole of department budgets and prepare advice on issues and potential areas of risk, including the keeping of a risk register and the suite of reports.", "\n", "Coordinate and manage budget-related requests, forecasts and variations into the department’s internal financial management system and Treasury’s budget and cash management systems.", "\n", "Develop robust revenue forecast models in consultation with relevant stakeholders.", "\n", "Assist in the development and implementation of strategies, policies, guidelines, risk management and improvements relevant to the effective and efficient management of the Department’s budget. This includes ongoing education and training of division staff.", "\n", "Assist the business unit in providing research, analysis, and support related to grants administration management activities, budgets and performance across the Division.  This will include the identification, review and implementation of business improvement initiatives;", "\n", "Analyse, monitor and report on divisional grants administration and program activity and assist in developing grant and divisional reporting KPI’s for use in Annual Reports, briefings and media releases.", "\n", "\n", "Desirable Requirements", "\n", " Relevant tertiary qualifications in accounting and/or Business Management are highly regarded ", "\n", "Download the Statement of Duties and Associated Documents", "\n", " ", "Statement of Duties - Business and Finance Analyst.docx", "\n", " ", "Statement of Duties - Business and Finance Analyst.pdf", "\n", " ", "Advice to applicants.DOCX", "\n", " ", "Advice to applicants.pdf", "\n", " ", "\n", "For more information Name: Nick Andrew  Position:  Manager Operations Email:  ", "nick.andrew@stategrowth.tas.gov.au", "  Phone:  ", "(03) 6165 5129", " How to apply", "\n", "To apply, please provide a one - two page document outlining your experience skills, and knowledge as they relate to the statement of duties and a copy of your current resume.", "\n", "Online applications are preferred, please click the blue Apply Now button.", "\n", "-or-", "\n", "Complete the following application form and email your application to us at ", "recruitment@stategrowth.tas.gov.au", "\n", " ", "Application for Employment (Form 201).DOCX", "\n", " ", "Application for Employment (Form 201).pdf", "\n", " "], "url": "https://www.seek.com.au/job/52549386?type=standard#searchRequestToken=3f7e7080-d1dd-4fb1-a8b1-87b858beb551"},
{"search": "Data Analyst", "job_title": "Principal Financial Analyst (722139)", "company": "Department of Treasury and Finance", "location_1": "Hobart", "location_2": "Government & Defence", "sector_1": "Government & Defence", "sector_2": "Government - State", "work_type": "Full Time", "salary": null, "desc": ["Department of Treasury and Finance", "\n", "\n", "Apply your expertise to a wide range of budgeting, accounting and financial management issues;", "\n", "Be part of a small, dynamic and highly skilled team in a central Hobart location; and", "\n", "Enjoy flexible work arrangements which support your lifestyle.", "\n", "\n", "The Department requires a motivated and experienced person who has strong budgeting and financial system skills, the ability to communicate well, and the ability to understand complex issues and identify possible solutions, ideally in a financial management setting.", "\n", "Does this sound like you?", "\n", "If it is, you will have the opportunity to work within an iconic central agency, providing budgeting, financial management, accounting and reporting services and advice.", "\n", "Responsibilities include:", "\n", "\n", "working both individually and as a member of a small team to develop and monitor Agency budgets and maintain the systems for the Branch’s budgeting functions;", "\n", "preparing briefings, correspondence and reports on complex matters and liaising with a broad range of internal and external stakeholders;", "\n", "representing the Department on committees and forums; and", "\n", "assisting with the supervision of employees.", "\n", "\n", "To be successful in this role, you will need to be able to effectively manage work outputs for areas of responsibility, demonstrate the ability to undertake high level research, analysis and modelling for budgeting and financial management purposes, and possess the aptitude to maintain high quality relationships with a broad range of stakeholders.", "\n", "The Salary range for this role is $96 100 to $108 822 pro rata per annum, plus superannuation.", "\n", "We welcome applications from a diverse range of applicants and provide opportunities for flexible working arrangements.", "\n", "Period of Appointment", "\n", "Permanent", "\n", "Hours per fortnight", "\n", "Up to 73.5 - hours flexible - talk to us about how this could work for you. We are open to considering a range of flexible work options including part-time hours.", "\n", "Highly Desirable Requirements", "\n", "Completion or partial completion of relevant tertiary or industry qualifications and/or professional affiliations.", "\n", "Download the Statement of Duties and any Associated Documents", "\n", "Please download the Statement of Duties, Advice to Applicants and Frequently Asked Questions below ", "\n", " ", "722139 - Statement of Duties - Principal Financial Analyst.DOCX", "\n", " ", "722139 - Statement of Duties - Principal Financial Analyst.pdf", "\n", " ", "Advice to Applicants.DOCX", "\n", " ", "Advice to Applicants.pdf", "\n", " ", "Frequently Asked Questions for Applicants.DOCX", "\n", " ", "Frequently Asked Questions for Applicants.pdf", "\n", "How to apply", "\n", "Before applying, we encourage you to make contact with the person listed below to ensure you have a good understanding of the role and how it fits within Treasury.", "\n", "To apply, please click the ‘", "Apply for this Job’", " button and provide a copy of your current Resume and Short Form Application (maximum 2 pages) outlining your experience, skills and knowledge as they relate to the Statement of Duties.  Please also provide contact details for two referees in your application.", "\n", "Refer to the ", "'Advice to Applicants'", " and ", "'Frequently Asked Questions'", " documents for further information.", "\n", "Please note that we do not require a separate statement addressing the selection criteria.", "\n", "If you are unable to submit your application online, please contact Recruitment on ", "(03) 6166 4450", " or via email ", "recruitment@treasury.tas.gov.au", " before the closing date.", "\n", "For more information", "\n", "Susan Peterson", "Assistant Director", "susan.peterson@treasury.tas.gov.au", "(03) 6166 4176", "\n", "Closing Date:", "  28 June 2021 at 11.55pm", "\n", "Vacancy No", ":  722139", "\n", " ", "\n", " "], "url": "https://www.seek.com.au/job/52579287?type=standard#searchRequestToken=3f7e7080-d1dd-4fb1-a8b1-87b858beb551"},
{"search": "Data Analyst", "job_title": "Manager Data and Analysis (372351)", "company": "Department of State Growth", "location_1": "Hobart", "location_2": "Government & Defence", "sector_1": "Government & Defence", "sector_2": "Government - State", "work_type": "Full Time", "salary": "$114,077 - $120,116 pro rata", "desc": ["We are a diverse and inclusive workplace that understands the importance of flexibility. Talk to us about what flexibility may look like for you.", "\n", "Duties", "\n", "\n", "Provide leadership and support to a team of professional and technical staff including the day to day supervision and allocation of duties.", "\n", "Manage the development and effective implementation of data collection, management and analysis, including analytical and reporting tools, according to the Government’s strategic directions and priorities.", "\n", "Oversee the provision of specialist high level research, analysis and reporting of key road infrastructure data and develop proposals, including analysis and recommendations to address complex transport issues and meet government priorities.", "\n", "Provide specialist high level advice and leadership on technical and qualitative asset information and collection, including representing the agency at national and state forums as required and conducting innovative investigations as required.", "\n", "Provide high level co-ordination and continuous improvement of asset data collection and systems including developing and implementing asset data collection plans, liaison with ICT services, implementing data standards, contributing to national road management reforms and managing complex contracts.", "\n", "Undertake a range of multifaceted and complex projects and manage the assigned financial and other resources to achieve high level outcomes based on contemporary project management methodologies.", "\n", "Work with external stakeholders and end users, other Government agencies, other areas of the agency, and contractors in relation to asset data governance, collection and analysis as required to ensure effective implementation of key transport initiatives.", "\n", "Prepare high level correspondence, publications, reports, and briefing material as required and review key documents.", "\n", "\n", "Desirable Requirements", "\n", "Tertiary qualification in a relevant discipline.", "\n", "Download the Statement of Duties and Associated Documents", "\n", " ", "Statement of Duties.DOCX", "\n", " ", "Statement of Duties.pdf", "\n", " ", "Advice to applicants.DOCX", "\n", " ", "Advice to applicants.pdf", "\n", "For more information Name: Fiona McLeod  Position: A/Director Asset Management  Email: ", "Fiona.McLeod@stategrowth.tas.gov.au", " Phone: ", "(03) 6166 3150", "  How to apply", "\n", "To apply, please provide a one - two page document outlining your experience skills, and knowledge as they relate to the statement of duties and a copy of your current resume.", "\n", "Online applications are preferred, please click the blue Apply Now button.", "\n", "-or-", "\n", "Complete the following application form and email your application to us at ", "recruitment@stategrowth.tas.gov.au", "\n", " ", "Application for Employment (Form 201).DOCX", "\n", " ", "Application for Employment (Form 201).pdf", "\n", " "], "url": "https://www.seek.com.au/job/52476832?type=standard#searchRequestToken=3f7e7080-d1dd-4fb1-a8b1-87b858beb551"},
{"search": "Data Analyst", "job_title": "Industry Analyst (706656)", "company": "Department of Primary Industries, Parks, Water and Environment (DPIPWE)", "location_1": "Launceston & North East", "location_2": "Government & Defence", "sector_1": "Government & Defence", "sector_2": "Government - State", "work_type": "Full Time", "salary": "Minimum $96,100.00 to Maximum $108,822.00", "desc": ["DPIPWE is committed to investing in its people to ensure a sustainable and successful organisation through a positive workplace culture and highly capable employees. We are a diverse and inclusive workplace and understand the importance of flexible working arrangements.  Talk to us about what flexibility could look like for you.", "\n", "Hours per fortnight", "\n", "73.50 (minimum 58.80 hours, by negotiation)", "\n", "Duties", "\n", "Provide industry information and policy advice to, and on behalf of, the Department of Primary Industries, Parks, Water and Environment (DPIPWE) to support the development of Tasmania’s food and agriculture sectors and achievement of AgriVision 2050.", "\n", "Desirable Requirements", "\n", "\n", "A Degree in a relevant discipline, as provided by either a university, a vocational education organisation or a registered and accredited training provider.", "\n", "Relevant industry experience.", "\n", "A current motor vehicle driver’s licence.", "\n", "\n", "Download the Statement of Duties and any Associated Documents", "\n", " ", "706656 - Industry Analyst.docx", "\n", " ", "706656 - Industry Analyst.pdf", "\n", " ", "Advice to Applicants.docx", "\n", " ", "Advice to Applicants.pdf", "\n", "How to apply", "\n", "To apply, please provide a Short Form Application which is a 1-2 page covering letter outlining your experience, skills and knowledge as they relate to the Statement of Duties, and a copy of your current Resumé/CV.", "\n", "Please note that we do not require a separate statement addressing the selection criteria.", "\n", "Please apply online by clicking the blue \"Apply Now\" button.", "\n", "Refer to the 'Advice to Applicants' document for further information.", "\n", "If you are unable to submit your application online, please contact Recruitment on ", "(03) 6165 3209", ".", "\n", "For more information on the position please contact:", "\n", "Mary Bennett ", "Manager (Agricultural Development and Policy)", "mary.bennett@dpipwe.tas.gov.au", "(03) 6165 3163"], "url": "https://www.seek.com.au/job/52564154?type=standard#searchRequestToken=3f7e7080-d1dd-4fb1-a8b1-87b858beb551"},
{"search": "Data Analyst", "job_title": "Manager Data and Analysis (372351)", "company": "Department of State Growth", "location_1": "Hobart", "location_2": "Government & Defence", "sector_1": "Government & Defence", "sector_2": "Government - State", "work_type": "Full Time", "salary": "$114,077 - $120,116 pro rata", "desc": ["We are a diverse and inclusive workplace that understands the importance of flexibility. Talk to us about what flexibility may look like for you.", "\n", "Duties", "\n", "\n", "Provide leadership and support to a team of professional and technical staff including the day to day supervision and allocation of duties.", "\n", "Manage the development and effective implementation of data collection, management and analysis, including analytical and reporting tools, according to the Government’s strategic directions and priorities.", "\n", "Oversee the provision of specialist high level research, analysis and reporting of key road infrastructure data and develop proposals, including analysis and recommendations to address complex transport issues and meet government priorities.", "\n", "Provide specialist high level advice and leadership on technical and qualitative asset information and collection, including representing the agency at national and state forums as required and conducting innovative investigations as required.", "\n", "Provide high level co-ordination and continuous improvement of asset data collection and systems including developing and implementing asset data collection plans, liaison with ICT services, implementing data standards, contributing to national road management reforms and managing complex contracts.", "\n", "Undertake a range of multifaceted and complex projects and manage the assigned financial and other resources to achieve high level outcomes based on contemporary project management methodologies.", "\n", "Work with external stakeholders and end users, other Government agencies, other areas of the agency, and contractors in relation to asset data governance, collection and analysis as required to ensure effective implementation of key transport initiatives.", "\n", "Prepare high level correspondence, publications, reports, and briefing material as required and review key documents.", "\n", "\n", "Desirable Requirements", "\n", "Tertiary qualification in a relevant discipline.", "\n", "Download the Statement of Duties and Associated Documents", "\n", " ", "Statement of Duties.DOCX", "\n", " ", "Statement of Duties.pdf", "\n", " ", "Advice to applicants.DOCX", "\n", " ", "Advice to applicants.pdf", "\n", "For more information Name: Fiona McLeod  Position: A/Director Asset Management  Email: ", "Fiona.McLeod@stategrowth.tas.gov.au", " Phone: ", "(03) 6166 3150", "  How to apply", "\n", "To apply, please provide a one - two page document outlining your experience skills, and knowledge as they relate to the statement of duties and a copy of your current resume.", "\n", "Online applications are preferred, please click the blue Apply Now button.", "\n", "-or-", "\n", "Complete the following application form and email your application to us at ", "recruitment@stategrowth.tas.gov.au", "\n", " ", "Application for Employment (Form 201).DOCX", "\n", " ", "Application for Employment (Form 201).pdf", "\n", " "], "url": "https://www.seek.com.au/job/52476831?type=standard#searchRequestToken=3f7e7080-d1dd-4fb1-a8b1-87b858beb551"},
{"search": "Data Analyst", "job_title": "Trading Analyst", "company": "Opus Recruitment Solutions", "location_1": "Hobart", "location_2": "Mining, Resources & Energy", "sector_1": "Mining, Resources & Energy", "sector_2": "Analysis & Reporting", "work_type": "Full Time", "salary": "$100000 - $130000 per annum, + Super", "desc": ["JD Ross Energy and Opus Talent Solutions are excited to be partnering with Hydro Tasmania, in the search for an Energy Trader to join their trading team in Hobart.", " Hydro Tasmania have been at the forefront of the energy transition, pioneering some of the biggest legacy projects in the country, such as the Marinus Link and Battery of the Nation. Recently striking a game changing, first-ever deal for the trade of stored energy.", " ", " This is a great opportunity for a Trading Analyst to join a progressive utility that holds real family values, while working with dispatchable renewables, and in a role where you can make an impact.", " ", " ", "ABOUT THE ROLE", " The primary focus of this role is to help the Commercial team maximise revenue for Hydro Tasmania by providing wholesale pricing for Tasmanian customers and Momentum Energy retail accurately and within a timely manner.", " The Wholesale Pricing Lead will evaluate new options for non-standard wholesale product or retail offerings by assisting with quantitative and qualitative marketing analysis, helping to improve Hydro Tasmania’s competitive position in the market.", " ", "ABOUT YOU", " You hold a degree in Finance, Economics, Engineering or Mathematics and have strong mathematical modelling skills. You’ve developed a deep knowledge of the National Electricity Market and understanding of wholesale trading and risk management.", " You’re an expert with Excel and other programs (Matlab, SQL, Python, R, Plexos). You’ll have a flair for presenting data in a convincing and easy to understand format.", " Agile and resilient, you are able to quickly adapt to shifting priorities. You’ll work collaboratively with a broad range of stakeholders across our operations, finance, commercial and IT teams.", " A more comprehensive overview of the skills and competencies required for success in this role can be viewed on this position description:", " ", " ", "WHAT YOU WILL GET BACK", " This is an opportunity to grow your career and redefine your role in tomorrow’s industry landscape. We offer truly flexible work that suits you, a competitive remuneration package, and the rare opportunity to play a role in Australia’s renewable energy transformation while enjoying the Hobart lifestyle."], "url": "https://www.seek.com.au/job/52377828?type=standard#searchRequestToken=3f7e7080-d1dd-4fb1-a8b1-87b858beb551"},
{"search": "Data Analyst", "job_title": "Manager Data and Analysis (372351)", "company": "Department of State Growth", "location_1": "Hobart", "location_2": "CEO & General Management", "sector_1": "CEO & General Management", "sector_2": "General/Business Unit Manager", "work_type": "Full Time", "salary": "$114,077 - $120,116 pro rata", "desc": ["We are a diverse and inclusive workplace that understands the importance of flexibility. Talk to us about what flexibility may look like for you.", "\n", "Duties", "\n", "\n", "Provide leadership and support to a team of professional and technical staff including the day to day supervision and allocation of duties.", "\n", "Manage the development and effective implementation of data collection, management and analysis, including analytical and reporting tools, according to the Government’s strategic directions and priorities.", "\n", "Oversee the provision of specialist high level research, analysis and reporting of key road infrastructure data and develop proposals, including analysis and recommendations to address complex transport issues and meet government priorities.", "\n", "Provide specialist high level advice and leadership on technical and qualitative asset information and collection, including representing the agency at national and state forums as required and conducting innovative investigations as required.", "\n", "Provide high level co-ordination and continuous improvement of asset data collection and systems including developing and implementing asset data collection plans, liaison with ICT services, implementing data standards, contributing to national road management reforms and managing complex contracts.", "\n", "Undertake a range of multifaceted and complex projects and manage the assigned financial and other resources to achieve high level outcomes based on contemporary project management methodologies.", "\n", "Work with external stakeholders and end users, other Government agencies, other areas of the agency, and contractors in relation to asset data governance, collection and analysis as required to ensure effective implementation of key transport initiatives.", "\n", "Prepare high level correspondence, publications, reports, and briefing material as required and review key documents.", "\n", "\n", "Desirable Requirements", "\n", "Tertiary qualification in a relevant discipline.", "\n", "Download the Statement of Duties and Associated Documents", "\n", " ", "Statement of Duties.DOCX", "\n", " ", "Statement of Duties.pdf", "\n", " ", "Advice to applicants.DOCX", "\n", " ", "Advice to applicants.pdf", "\n", "For more information Name: Fiona McLeod  Position: A/Director Asset Management  Email: ", "Fiona.McLeod@stategrowth.tas.gov.au", " Phone: ", "(03) 6166 3150", "  How to apply", "\n", "To apply, please provide a one - two page document outlining your experience skills, and knowledge as they relate to the statement of duties and a copy of your current resume.", "\n", "Online applications are preferred, please click the blue Apply Now button.", "\n", "-or-", "\n", "Complete the following application form and email your application to us at ", "recruitment@stategrowth.tas.gov.au", "\n", " ", "Application for Employment (Form 201).DOCX", "\n", " ", "Application for Employment (Form 201).pdf", "\n", " "], "url": "https://www.seek.com.au/job/52476829?type=standard#searchRequestToken=3f7e7080-d1dd-4fb1-a8b1-87b858beb551"},
{"search": "Data Analyst", "job_title": "Manager Data and Analysis (372351)", "company": "Department of State Growth", "location_1": "Hobart", "location_2": "Manufacturing, Transport & Logistics", "sector_1": "Manufacturing, Transport & Logistics", "sector_2": "Analysis & Reporting", "work_type": "Full Time", "salary": "$114,077 - $120,116 pro rata", "desc": ["We are a diverse and inclusive workplace that understands the importance of flexibility. Talk to us about what flexibility may look like for you.", "\n", "Duties", "\n", "\n", "Provide leadership and support to a team of professional and technical staff including the day to day supervision and allocation of duties.", "\n", "Manage the development and effective implementation of data collection, management and analysis, including analytical and reporting tools, according to the Government’s strategic directions and priorities.", "\n", "Oversee the provision of specialist high level research, analysis and reporting of key road infrastructure data and develop proposals, including analysis and recommendations to address complex transport issues and meet government priorities.", "\n", "Provide specialist high level advice and leadership on technical and qualitative asset information and collection, including representing the agency at national and state forums as required and conducting innovative investigations as required.", "\n", "Provide high level co-ordination and continuous improvement of asset data collection and systems including developing and implementing asset data collection plans, liaison with ICT services, implementing data standards, contributing to national road management reforms and managing complex contracts.", "\n", "Undertake a range of multifaceted and complex projects and manage the assigned financial and other resources to achieve high level outcomes based on contemporary project management methodologies.", "\n", "Work with external stakeholders and end users, other Government agencies, other areas of the agency, and contractors in relation to asset data governance, collection and analysis as required to ensure effective implementation of key transport initiatives.", "\n", "Prepare high level correspondence, publications, reports, and briefing material as required and review key documents.", "\n", "\n", "Desirable Requirements", "\n", "Tertiary qualification in a relevant discipline.", "\n", "Download the Statement of Duties and Associated Documents", "\n", " ", "Statement of Duties.DOCX", "\n", " ", "Statement of Duties.pdf", "\n", " ", "Advice to applicants.DOCX", "\n", " ", "Advice to applicants.pdf", "\n", "For more information Name: Fiona McLeod  Position: A/Director Asset Management  Email: ", "Fiona.McLeod@stategrowth.tas.gov.au", " Phone: ", "(03) 6166 3150", "  How to apply", "\n", "To apply, please provide a one - two page document outlining your experience skills, and knowledge as they relate to the statement of duties and a copy of your current resume.", "\n", "Online applications are preferred, please click the blue Apply Now button.", "\n", "-or-", "\n", "Complete the following application form and email your application to us at ", "recruitment@stategrowth.tas.gov.au", "\n", " ", "Application for Employment (Form 201).DOCX", "\n", " ", "Application for Employment (Form 201).pdf", "\n", " "], "url": "https://www.seek.com.au/job/52476830?type=standard#searchRequestToken=3f7e7080-d1dd-4fb1-a8b1-87b858beb551"},
{"search": "Data Analyst", "job_title": "Assurance Analyst", "company": "Hydro Tasmania", "location_1": "Hobart", "location_2": "Government & Defence", "sector_1": "Government & Defence", "sector_2": "Other", "work_type": "Full Time", "salary": null, "desc": ["At Hydro Tasmania, we’re leaders in renewable energy, powering Australia with clean hydropower.  We really care about making a difference for better, but it’s a big job and we can’t do it alone. Which is right where you come in.", "\n", "About the role:", "\n", "You will support the business in the development of effective compliance plans and the management of controls and continue to regularly review to ensure obligations are met. When breaches or incidents do occur you will assist in the investigation and engage with the business to implement improvements to reduce the incidence happening again. You will conduct audits across the organisation and provide data via reports and presentations, outlining findings and making recommendations for improvements.", "\n", "Your strong relationship skills assist you with cross collaboration within your team and across the organisation educating them on legislative, regulatory obligations and best practice models for compliance management.", "\n", "About You:", "\n", "Having worked in a similar role previously, you are passionate about compliance management and assurance! This experience has given you strong knowledge of compliance management and conformance with ISO 19600 and knowledge of compliance obligations.  It would be advantageous if you also have experience working in the energy industry.", "\n", "You consider yourself a subject matter expert, therefore are able to work autonomously. You enjoy analysing complex problems and use your analytical approach to conjure clever solutions. Ensuring compliance across the organisation requires input from all individuals, you are confident in advising and training employees to meet their compliance obligations as well as interact with all levels of stakeholders.", "\n", "Further information can be found on the attached Position Description:  ", "PD - PE - Assurance Analyst - May 2021.pdf", "\n", "What you’ll get back", "\n", "This is an opportunity to grow your career and redefine your role in tomorrow’s industry landscape.  We offer truly flexible work that suits you, a competitive remuneration package, and the rare opportunity to play a role in Australia’s renewable energy transformation while enjoying the – lifestyle Tasmania has to offer", "\n", "If you want to make a difference for better", "\n", "We are passionate about diversity and inclusion and welcome applications from qualified candidates of all ages, cultural backgrounds, abilities and genders. There’s a place for you amongst us to belong, and we welcome you to speak to us about any special requirements you may have to give you the best opportunity for success.", "\n", "Please attach your resume and a cover letter outlining what skills and experience you will bring before 9am Wednesday 23 June"], "url": "https://www.seek.com.au/job/52504875?type=standout#searchRequestToken=3f7e7080-d1dd-4fb1-a8b1-87b858beb551"},
{"search": "Data Analyst", "job_title": "FINANCIAL ANALYST (9740)", "company": "Hobart City Council", "location_1": "Hobart", "location_2": "Government & Defence", "sector_1": "Government & Defence", "sector_2": "Government - Local", "work_type": "Full Time", "salary": "$97,357 - $105,468", "desc": ["Responsible for leading the financial system administration function for the systems operating in Council, to meet the business’ requirements, including identifying improvement opportunities and managing projects to develop and implement improvement initiatives. The role supports the Chief Financial Officer by undertaking financial analysis and providing advice to Council in support of its strategic objectives and administers Council’s chart of accounts including managing changes across financial configuration in order to deliver accurate reporting.", "If you are: ", " ", " ", "Customer first in everything you do", " ", "A strong team player", " ", "Supportive of your teammates", " ", "Goal focussed", " ", "Have strong financial system skills and stronger financial analytical skills", " ", "A good understanding of accounting standards", " ", " ", "then this job may suit you."], "url": "https://www.seek.com.au/job/52562592?type=standout#searchRequestToken=3f7e7080-d1dd-4fb1-a8b1-87b858beb551"},
{"search": "Data Analyst", "job_title": "Business Improvement Analyst", "company": "RACT", "location_1": "Hobart", "location_2": "Consulting & Strategy", "sector_1": "Consulting & Strategy", "sector_2": "Analysts", "work_type": "Full Time", "salary": null, "desc": ["We’ve been a part of the Tasmanian community for over 95 years. Since forming in 1923, we’ve always had the same goal - to have a valued relationship with all Tasmanians. With our local knowledge and as the state’s number one brand we’re here to support the lives of our more than 200,000 members by helping them enjoy life, giving them a helping hand and making their money go further.", "The Business Improvement Analyst is responsible for delivering a broad range of process improvements, business requirements and standardising of our operating procedures across our service delivery network to deliver on project and strategic outcomes. ", "You will work collaboratively across the MX function and broader business to ensure that the design of processes, procedures and requirements fits operational needs, meets project targets and id delivered in a way that brings others on the journey.", "This role will:", "Support key business personnel to develop, write and communicate business requirements and functional specifications for the design and implementation of initiatives, changes and projects.", "Undertake key discovery interviews and workshops to capture business requirements.", "Conduct stakeholder analysis to initiate change and gain support for projects or key initiatives.", "Document and standardise key business processes across the RACT Group.", "Track and report on key work outputs to ensure that key project objectives are met.", "Participate in key strategic projects including new product development, system implementation and change processes.", "Run requirements sessions and participate in journey mapping for process improvements, to help inform decision making and the overall design.", "Apply analytical thinking to develop new and innovative solutions to our current ways of working.", "We’re offering:", "Aside from the opportunity to work with an iconic Tasmanian brand and play a key part in achieving our goal, we also offer flexibility on work arrangements and offer some great discounts on our insurance and roadside products.", "Think you’d be a great fit in our team? We’d love to hear from you. To express your interest in this opportunity, please submit your cover letter and resume via SEEK. ", "Applications close 9am 18 June 2021."], "url": "https://www.seek.com.au/job/52515110?type=standout#searchRequestToken=3f7e7080-d1dd-4fb1-a8b1-87b858beb551"},
{"search": "Data Analyst", "job_title": "Senior Research Consultant", "company": "Wallis Social Research", "location_1": "Hobart", "location_2": "Marketing & Communications", "sector_1": "Marketing & Communications", "sector_2": "Market Research & Analysis", "work_type": "Full Time", "salary": null, "desc": ["About the business", "  ", " ", "  ", "Wallis Social Research is a Melbourne-based social research agency. We work with some of the largest and most well-known government organisations in Australia.", "  ", "Wallis has built its reputation on dedication to our clients. We ensure they receive the reliable information they need to make important policy decisions. Our clients expect, and we deliver, quality research with integrity.", "  ", " ", "  ", "About the role", "  ", " ", "  ", "Wallis is looking for a Senior Research Consultant to operate out of Hobart. This role will work with the team in Melbourne to help with existing work as well as being ready to take on local pieces as they arise. ", "  ", "To be successful in this role you will be an experienced, self-motivated social researcher who is keen to show us what you can do. This role will be hitting the ground running with active projects needing an experienced hand to guide them through to completion.", "  ", "You will be working across all levels of government and portfolios including employment, education, and transport. ", "  ", "You will bring an eye for detail, and a well-rounded and practical understanding of the research process across both qualitative and quantitative research. Playing with numbers, displaying them in an easy to digest way and have a well-honed curiosity about what they mean will be second nature to you.", "  ", "Your day will consist of managing projects, working with clients, conducting data analysis, writing up reports and responding to client queries and briefs.", "  ", "The team you will be joining is experienced and well resourced, consisting of data analysts, graphic designers, account directors, as well as a dedicated field unit. You will be supported and mentored throughout your time with Wallis.", "  ", " ", "  ", "Skills and experience", "  ", " ", "  ", "To do this role you will need to bring a few things with you.", "  ", "You will need -", " ", " ", "+3 years Market and/or Social Research experience", " ", "A tertiary qualification in a relevant field such as  marketing, psychology, statistics", " ", "Experience using Q or SPSS for analysis", " ", "Consulting experience with government clients", " ", "Excellent verbal, written and presentation communication skills", " ", "Research project management experience", " ", " ", "  ", "Any of the following would be considered a bonus -", " ", " ", "Experience project managing large tracking studies", " ", "Experience working on multi-mode field studies", " ", "Experience growing a client base", " ", "Demonstrated ability to work independently", " ", " ", "  ", "If you would like to know more about Wallis Social Research you can visit www.wallis.social", "  ", "Please send any questions about the role through to ", "work@wallisgroup.com.au", "  ", "Recruiters need not apply.", "  ", " "], "url": "https://www.seek.com.au/job/52335433?type=standard#searchRequestToken=6a033b33-d59e-4d80-95e3-ac921f08a1b6"},
{"search": "Data Analyst", "job_title": "Risk Analyst", "company": "Hydro Tasmania", "location_1": "Hobart", "location_2": "Consulting & Strategy", "sector_1": "Consulting & Strategy", "sector_2": "Other", "work_type": "Full Time", "salary": null, "desc": ["At Hydro Tasmania, we’re leaders in renewable energy, powering Australia with clean hydropower.  We really care about making a difference for better, but it’s a big job and we can’t do it alone. Which is right where you come in.", "\n", "About the role:", "\n", "You will work closely with your team to manage the risk needs of the organisation. This includes:", "\n", "\n", "Providing business unit teams with expert advice on risk management to ensure integration with Hydro’s strategic and operational plans.", "\n", "Provide advice and support on the requirements of the operational risk management system.", "\n", "Provide risk management advice to support and enable the achievement of effective risk-based decision making and the delivery of defined business outcomes.", "\n", "Prepare reports to meet internal and external reporting requirements.", "\n", "Provide advice and support to the development of the business insurance portfolio.", "\n", "\n", "You will do this by undertaking continuous improvement of risk and emergency preparedness with relevant subject matter experts and providing advice to stakeholders to ensure they understand best practice risk and emergency management.", "\n", "About You:", "\n", "You have working experience in a similar role, ideally in the energy industry. You have a solid understanding of risk management and conformance with ISO 31000. You’re a subject matter expert in emergency management and business continuity requirements.", "\n", "The ability to analyse problems logically and to think laterally in the development of solutions as well as the talent to distil complex information will assist you to educate employees on risk, emergency management, business continuity, and key compliance obligations.", "\n", "Further information can be found on the attached Position Description:  ", "PD-FS-Risk Analyst HT4-May 2021.pdf", "\n", "What you’ll get back", "\n", "This is an opportunity to grow your career and redefine your role in tomorrow’s industry landscape.  We offer truly flexible work that suits you, a competitive remuneration package, and the rare opportunity to play a role in Australia’s renewable energy transformation while enjoying the – lifestyle Tasmania has to offer", "\n", "If you want to make a difference for better", "\n", "We are passionate about diversity and inclusion and welcome applications from qualified candidates of all ages, cultural backgrounds, abilities and genders. There’s a place for you amongst us to belong, and we welcome you to speak to us about any special requirements you may have to give you the best opportunity for success.", "\n", "Please attach your resume and a cover letter outlining what skills and experience you will bring before 9am Friday 25 June 2021."], "url": "https://www.seek.com.au/job/52536030?type=standout#searchRequestToken=3f7e7080-d1dd-4fb1-a8b1-87b858beb551"},
{"search": "Data Analyst", "job_title": "Specialist Business Analyst (724611)", "company": "Department of Treasury and Finance", "location_1": "Hobart", "location_2": "Accounting", "sector_1": "Accounting", "sector_2": "Systems Accounting & IT Audit", "work_type": "Full Time", "salary": null, "desc": ["Department of Treasury and Finance", "\n", "\n", "Apply your accounting and finance experience and risk management expertise to delivering finance system improvement initiatives;", "\n", "Be part of, and supported by, a dynamic and highly skilled team in a central Hobart location; and", "\n", "Enjoy flexible work arrangements which support your lifestyle.", "\n", "\n", "The Department requires a motivated and experienced accountant who is passionate about process reengineering and has a demonstrated ability to manage risk to assist in the delivery of a set of Finance function reengineering projects. The Specialist Business Analyst will ensure finance system projects are delivered with integrity and financial control front of mind. They will have demonstrated ability to work with a wide range of stakeholders, to consult in a range of forums, to research and identify options and risks, communicate impacts and document decision making and project progress.", "\n", "Does this sound like you?", "\n", "If it is, you will have the opportunity to work within an iconic central agency, researching and analysing economic and financial issues to support the provision of policy advice to the Government on matters relating to financial relations between all levels of government.", "\n", "Responsibilities include:", "\n", "\n", "Providing specialised advice and analysis in relation to the identification, definition, documentation and improvement of business processes and practices;", "\n", "Undertaking business requirements, policy and legislative analysis to ensure the development of compliant and robust financial operations business improvement activities;", "\n", "Working collaboratively with stakeholders to validate the business model and achieve consensus;", "\n", "Identifying, advising on and coordinating the resolution of policy and procedural implications of business process re-engineering options;", "\n", "Preparing high level correspondence, including memos, meeting papers, business cases, reports, analyses, briefs and minutes related to process and business improvement activities;", "\n", "Working with the project teams, external service providers and business owners to identify order of priorities, workable solutions and detailed requirements; and", "\n", "Supporting organisational change through proactive consultation, communication and documentation.", "\n", "\n", "To be successful in this diverse role, you will need to be able to effectively manage work outputs for the area of responsibility, demonstrate the ability to undertake complex research and investigation and use appropriate decision making strategies to identify possible solutions to non-routine problems, and possess the aptitude to maintain high quality relationships with both internal and external stakeholders.", "\n", "The Salary range for this role is $114 077 to $120 116 pro rata per annum, plus superannuation.", "\n", "We welcome applications from a diverse range of applicants and provide opportunities for flexible working arrangements.", "\n", "Period of Appointment", "\n", "Fixed term for a period of up to 12 months.", "\n", "Hours per fortnight", "\n", "Up to 73.5 - hours flexible - talk to us about how this could work for you. We are open to considering a range of flexible work options including part-time hours.", "\n", "Highly Desirable Requirements", "\n", "Completion or partial completion of relevant tertiary or industry qualifications and/or professional affiliations.", "\n", "Download the Statement of Duties and any Associated Documents", "\n", "Please download the Statement of Duties, Advice to Applicants and Frequently Asked Questions below:", "\n", " ", "724611 - Statement of Duties - Specialist Business Analyst .DOCX", "\n", " ", "724611 - Statement of Duties - Specialist Business Analyst .pdf", "\n", " ", "Advice to Applicants.DOCX", "\n", " ", "Advice to Applicants.pdf", "\n", " ", "Frequently Asked Questions for Applicants.DOCX", "\n", " ", "Frequently Asked Questions for Applicants.pdf", "\n", "How to apply", "\n", "Before applying, we encourage you to make contact with the person listed below to ensure you have a good understanding of the role and how it fits within Treasury.", "\n", "To apply, please click the ‘", "Apply for this Job’", " button and provide a copy of your current Resume and Short Form Application (maximum 2 pages) outlining your experience, skills and knowledge as they relate to the Statement of Duties.  Please also provide contact details for two referees in your application.", "\n", "Refer to the ", "'Advice to Applicants'", " and ", "'Frequently Asked Questions'", " documents for further information.", "\n", "Please note that we do not require a separate statement addressing the selection criteria.", "\n", "If you are unable to submit your application online, please contact Recruitment on ", "(03) 6166 4450", " or via email ", "recruitment@treasury.tas.gov.au", " before the closing date.", "\n", "For more information", "\n", "Kate George", "Director", "kate.george@treasury.tas.gov.au", "(03) 6166 4081", "\n", "Closing Date:", "  27 June 2021 at 11.55pm", "\n", "Vacancy No", ":  724611"], "url": "https://www.seek.com.au/job/52551561?type=standard#searchRequestToken=3f7e7080-d1dd-4fb1-a8b1-87b858beb551"},
{"search": "Data Analyst", "job_title": "Commercial Analyst", "company": "Tas Gas Networks Pty Ltd", "location_1": "Launceston & North East", "location_2": "Accounting", "sector_1": "Accounting", "sector_2": "Analysis & Reporting", "work_type": "Full Time", "salary": null, "desc": ["About us", "At Tas Gas, we grow and evolve with the lives of our 14,000 plus customers in Tasmania and Victoria, shaping a cleaner energy future for all. We are dedicated to serving our energy customers, anticipating their needs and exceeding their expectations.", "What's on offer?", "Based at our office in Launceston, this is an exciting opportunity for a person seeking variety and looking to use and develop their problem solving and decision-making skills in a dynamic working environment. ", "In this role you will be required to:", "Provide regular financial analysis, modelling, forecasting, and reporting with regards to energy demand and customer consumption", "Coordinate the development and monitoring of retail annual budgets including the preparation of monthly accruals", "Assist in the management of retail customer contracts including the development of pricing strategies, managing contract price escalations through to the billing system and responding to customer enquiries", "Assist in the update of customer pricing information in the retail billing system and assist in checking data integrity and accuracy", "Engage in planning to assist TG Retail’s customer growth", "Evaluate options and make recommendations underpinned by sound research, scenario testing and an understanding of the business strategy", "Analyse external drivers for the business including market trends, competitor positioning and market opportunities   ", "Use customer and/or business data to identify risks and opportunities ", "Understand Tas Gas’ vision and its application to day-to-day operations and provide informed input into strategy discussions  ", "Interpret data and analysis to provide customer insight and strategy to improve performance", "Provide support in the management of gas nominations and wholesale contract management", "To be successful in this role you will have:", "Proven track record in financial analysis and execution, including the presentation of recommendations ", "Min 3 years’ experience in business planning and/or customer analytics and digital analytics", "Strong analytical & presentation skills ", "Strong business acumen with an ability to plan, prioritise and deliver ", "Attention to detail and curiosity to question information ", "Strong relationship management and organisational skills ", "Ability to respond positively to changing priorities", "A customer first, service-delivery mind-set", "Benefits", "Tas Gas is a rewarding, challenging and impactful place to work where we take a collaborative approach to getting things done. Here you can have a career with purpose, flexible work options as well as unique opportunities for professional development and personal growth.", "How to Apply", "Send your resume and cover letter via the APPLY button. To make the process seamless, applicants must provide a cover letter as well as a resume addressing the skill requirements.", "For a copy of the position description, please go to https://www.tasgas.com.au/about/careers/vacancies. For queries, please email ", "recruitment@tasgas.com.au", " ", "Applications will close once a suitable candidate has been found.", "Shortlisted applicants only will be contacted."], "url": "https://www.seek.com.au/job/52491307?type=standout#searchRequestToken=3f7e7080-d1dd-4fb1-a8b1-87b858beb551"},
{"search": "Data Analyst", "job_title": "Scientific Data Analyst", "company": "Evolve Scientific Recruitment", "location_1": "Hobart", "location_2": "Science & Technology", "sector_1": "Science & Technology", "sector_2": "Mathematics, Statistics & Information Sciences", "work_type": "Contract/Temp", "salary": null, "desc": ["About CSIRO", "Evolve Scientific Recruitment are proud to partner with Australia's CSIRO in recruitment of this role.", "At CSIRO you can contribute to solving large scale, complex problems that make a real difference to our future. We work together to achieve more than we could individually in a supportive, rewarding, inclusive and flexible environment. ", "About the Role", "We are recruiting an 18-month contract position on behalf of our client - CSIRO, Oceans and Atmosphere, in Hobart. The position is in the Pelagic Population Dynamics and Management Strategy Evaluation Team who undertake innovative research and provide scientific advice for the sustainable management of Australia's domestic and regionally important international fisheries.", "The role will involve assisting the team in their research and project delivery through data analysis, data queries and management, collation of results, writing code / programming and report writing. The focus is on the tropical tuna and billfish fisheries in the SW Pacific and Indian Oceans, and the southern bluefin tuna fishery.", "Role Responsibilities Include:", "Make significant contributions to the interpretation, analysis and communication of fisheries data and model results and support project management. Collaborate on writing reports for clients and scientific technical meetings;", "Under general direction participate in planning projects and accept responsibility for the scheduling and completion of major parts of projects, including allocating and directing tasks where appropriate;", "Use initiative to adapt or develop original methods and concepts in support of existing and future research to promptly address needs of the team;", "Communicate openly, effectively and respectfully with all staff, clients and suppliers in the interests of good business practice, collaboration and enhancement of CSIRO's reputation;", "Work collaboratively as part of a multi-disciplinary, often regionally dispersed research team, and business unit to carry out tasks in support of CSIRO's scientific objectives;", "Adhere to the spirit and practice of CSIRO's Code of Conduct, Health, Safety and Environment procedures and policy, Diversity initiatives and Making Safety Personal goals;", "Other duties as directed.", "Selection Criteria", "To be eligible for these opportunities you must provide an application including a resume and a cover letter which includes evidence-based responses to each of the following criteria:", "Essential", "Under CSIRO policy only those who meet all essential criteria can be appointed.", "Relevant bachelor's degree, or PhD, and relevant work experience in Ecology, Science, population dynamics modelling or natural resource management", "Experience in data analysis, data management, graphical software and statistical packages (R, SQL, or similar)", "Capability and experience in scientific programming (R, C++ or similar languages)", "Demonstrated ability to collate and summarise model results and produce scientific reports", "Demonstrated excellent communication, collaboration and teamwork skills", "Demonstrated ability to complete tasks with a high level of accuracy and thoroughness", " ", "Desirable:", "Experience in modelling natural resource population dynamics", "Capability in stock assessments and an understanding of management strategy evaluation", "Ability to undertake fieldwork and travel", "How to Apply:", "For upcoming positions please click on the \"Apply Now\" button. By applying to any of our roles you will also be registered for future positions unless you request not to be.", "Why Evolve Scientific Recruitment? ", "Evolve is an award winning agency specialising in scientific/technical recruitment in: Pharmaceutical, Food, Biotechnology, Chemical, Petrochemical, Environmental, Health Services, Life Sciences, Mining and more.", "How to Register with Evolve:", "Click on the \"Apply Now\" button with a cover letter addressing the selection criteria above AND a detailed resume in WORD format (PDFs can be corrupted / not processed). Note: Applications only accepted from Australian / NZ residents with valid Australian work rights.", " "], "url": "https://www.seek.com.au/job/52433155?type=standard#searchRequestToken=3f7e7080-d1dd-4fb1-a8b1-87b858beb551"},
{"search": "Data Analyst", "job_title": "Specialist Business Analyst (724611)", "company": "Department of Treasury and Finance", "location_1": "Hobart", "location_2": "Government & Defence", "sector_1": "Government & Defence", "sector_2": "Government - State", "work_type": "Full Time", "salary": null, "desc": ["Department of Treasury and Finance", "\n", "\n", "Apply your accounting and finance experience and risk management expertise to delivering finance system improvement initiatives;", "\n", "Be part of, and supported by, a dynamic and highly skilled team in a central Hobart location; and", "\n", "Enjoy flexible work arrangements which support your lifestyle.", "\n", "\n", "The Department requires a motivated and experienced accountant who is passionate about process reengineering and has a demonstrated ability to manage risk to assist in the delivery of a set of Finance function reengineering projects. The Specialist Business Analyst will ensure finance system projects are delivered with integrity and financial control front of mind. They will have demonstrated ability to work with a wide range of stakeholders, to consult in a range of forums, to research and identify options and risks, communicate impacts and document decision making and project progress.", "\n", "Does this sound like you?", "\n", "If it is, you will have the opportunity to work within an iconic central agency, researching and analysing economic and financial issues to support the provision of policy advice to the Government on matters relating to financial relations between all levels of government.", "\n", "Responsibilities include:", "\n", "\n", "Providing specialised advice and analysis in relation to the identification, definition, documentation and improvement of business processes and practices;", "\n", "Undertaking business requirements, policy and legislative analysis to ensure the development of compliant and robust financial operations business improvement activities;", "\n", "Working collaboratively with stakeholders to validate the business model and achieve consensus;", "\n", "Identifying, advising on and coordinating the resolution of policy and procedural implications of business process re-engineering options;", "\n", "Preparing high level correspondence, including memos, meeting papers, business cases, reports, analyses, briefs and minutes related to process and business improvement activities;", "\n", "Working with the project teams, external service providers and business owners to identify order of priorities, workable solutions and detailed requirements; and", "\n", "Supporting organisational change through proactive consultation, communication and documentation.", "\n", "\n", "To be successful in this diverse role, you will need to be able to effectively manage work outputs for the area of responsibility, demonstrate the ability to undertake complex research and investigation and use appropriate decision making strategies to identify possible solutions to non-routine problems, and possess the aptitude to maintain high quality relationships with both internal and external stakeholders.", "\n", "The Salary range for this role is $114 077 to $120 116 pro rata per annum, plus superannuation.", "\n", "We welcome applications from a diverse range of applicants and provide opportunities for flexible working arrangements.", "\n", "Period of Appointment", "\n", "Fixed term for a period of up to 12 months.", "\n", "Hours per fortnight", "\n", "Up to 73.5 - hours flexible - talk to us about how this could work for you. We are open to considering a range of flexible work options including part-time hours.", "\n", "Highly Desirable Requirements", "\n", "Completion or partial completion of relevant tertiary or industry qualifications and/or professional affiliations.", "\n", "Download the Statement of Duties and any Associated Documents", "\n", "Please download the Statement of Duties, Advice to Applicants and Frequently Asked Questions below:", "\n", " ", "724611 - Statement of Duties - Specialist Business Analyst .DOCX", "\n", " ", "724611 - Statement of Duties - Specialist Business Analyst .pdf", "\n", " ", "Advice to Applicants.DOCX", "\n", " ", "Advice to Applicants.pdf", "\n", " ", "Frequently Asked Questions for Applicants.DOCX", "\n", " ", "Frequently Asked Questions for Applicants.pdf", "\n", "How to apply", "\n", "Before applying, we encourage you to make contact with the person listed below to ensure you have a good understanding of the role and how it fits within Treasury.", "\n", "To apply, please click the ‘", "Apply for this Job’", " button and provide a copy of your current Resume and Short Form Application (maximum 2 pages) outlining your experience, skills and knowledge as they relate to the Statement of Duties.  Please also provide contact details for two referees in your application.", "\n", "Refer to the ", "'Advice to Applicants'", " and ", "'Frequently Asked Questions'", " documents for further information.", "\n", "Please note that we do not require a separate statement addressing the selection criteria.", "\n", "If you are unable to submit your application online, please contact Recruitment on ", "(03) 6166 4450", " or via email ", "recruitment@treasury.tas.gov.au", " before the closing date.", "\n", "For more information", "\n", "Kate George", "Director", "kate.george@treasury.tas.gov.au", "(03) 6166 4081", "\n", "Closing Date:", "  27 June 2021 at 11.55pm", "\n", "Vacancy No", ":  724611"], "url": "https://www.seek.com.au/job/52551562?type=standard#searchRequestToken=3f7e7080-d1dd-4fb1-a8b1-87b858beb551"},
{"search": "Data Analyst", "job_title": "Search Engine Marketing Specialist", "company": "MyTyreSite", "location_1": "Hobart", "location_2": "Marketing & Communications", "sector_1": "Marketing & Communications", "sector_2": "Digital & Search Marketing", "work_type": "Full Time", "salary": null, "desc": ["About us:", "MyTyreSite is an exciting Hobart (Cambridge) based digital agency that's going places in the automotive industry. Established close to four years ago, we roll with a startup atmosphere and agility, while setting down some best practices to allow for serious growth.", "We're a service based agency, which means we not only build products and websites, but we maintain them for the clients rather than handing over the keys and sending them on their way.", "We offer a challenging and varied work environment that is open to new ideas and workflows.", "Each project presents new and exciting challenges, which particularly suits those that love working out solutions and solving problems for a wide range of clients.", " ", "Your Job:", "As our Search Engine Marketing Specialist at MyTyreSite you love numbers, going through data and making recommendations based on the information at hand.", "You know how to extrapolate information from multiple sources and combine this into an actionable strategy for our clients. You’ll be running PPC campaigns for clients across the world, so quality communication skills & customer care are essential, as well as the ability to pitch SEM to current and new clients as a support to the sales team. As part of a larger team you can think on your feet and provide feedback on the spot. Critical thinking & a data analytical mind are essential for this role.", " ", "Ongoing you will be tasked with:", "Execute tests٫ collect and analyze data٫ identify trends and generating insights", "Achieve maximum ROI in paid search campaigns using analysis of data from multiple sources.", "Track٫ report٫ and analyse website analytics for multiple entities", "Track٫ report٫ and analyse PPC initiatives and campaigns", "Hold online reporting and planning catch ups with key larger clients.", "Effectively manage campaign expenses by staying on budget٫ appropriately estimating monthly costs٫ and reconciling any discrepancies that may arise.", "Optimize copy and landing pages for paid search engine marketing campaigns", "Continually expand and optimise paid keyword discovery", "Research and analyze competitor advertising links", "Supporting the sales team to sell SEM to current and prospective clients.", " ", "Ideally you have:", "At least 2 - 3 years experience with PPC campaigns such as Google Adwords (Search and Display are essential, Youtube and Shopping would be beneficial) & Bing Ads (beneficial).", "Google Analytics & Google Tag Manager knowledge", "Google Partner Status (beneficial)", "Google Search Console understanding & knowledge", "Analytical skills in the form of Google Analytics (Certification beneficial) ", "Experience with reporting & customer relationship management", "Copywriting skills", "Familiarity with A/B and multivariate experiments (Variable Tags)", "An interest in educating others about SEM and its benefits", " ", "Nice to have:", "Working knowledge of HTML٫ CSS٫ and JavaScript development and constraints (supporting Developers)", "Previous experience with SEMrush, AHrefs or other relevant industry tools", "An interest in the automotive industry is handy, but in no way essential", " ", "We offer:", "A casual and friendly workplace", "A young and enthusiastic team of developers", "Flexible working options", "Weekly pay", "The opportunity to up skill", "Free parking", "Competitive remuneration", "Coffee", "An office dog", "We're keen to add a new member to our team, who will engage with the team and our clients, and help the business succeed both in Australia and overseas.", "Please note that the job will be located in our Cambridge, Tasmania office. There is no scope for an off-site employee. Some travel may be required from time to time."], "url": "https://www.seek.com.au/job/52493102?type=standard#searchRequestToken=6a033b33-d59e-4d80-95e3-ac921f08a1b6"},
{"search": "Data Analyst", "job_title": "Energy Trader", "company": "Opus Recruitment Solutions", "location_1": "Hobart", "location_2": "Mining, Resources & Energy", "sector_1": "Mining, Resources & Energy", "sector_2": "Other", "work_type": "Full Time", "salary": "$130000 - $170000 per annum", "desc": ["At Hydro Tasmania, we’re leaders in renewable energy, powering Australia with clean hydropower.  We really care about making a difference for the better, but it’s a big job and we can’t do it alone. Which is right where you come in.  As an Energy Trader, you’ll maximise value from the National Electricity Market in line with strategy whilst ensuring compliance to all relevant regulatory obligations.  ", "WHAT YOU WILL DO", "The Energy Trader develops and implements trading strategies to manage energy and environmental product market risks and maximise earnings within relevant limits. You will optimise Hydro Tasmania’s position for our diverse portfolio incorporating generation and retail activities across the National Electricity Market. ", "As part of a team, you will: ", "Develop strategies and tactics to optimise gross margin for wholesale and retail activities through participation in financial markets.", "Conduct day to day contract trading activities ethically in line with all relevant legislation, regulation and market rules.", "Maintain relationships with wholesale market counterparties to achieve trading objectives.", "Monitor performance against trading plans and reflect on individual and team learnings for continuous improvement.", "Carry out analysis and pricing of non-standard products.", "Incorporate market and portfolio analysis to inform trading strategies and decisions.", "WHAT YOU WILL BRING", "To be successful in this role you will have: ", "A passion for your craft, drive to succeed and collaborative nature that enjoys working as part of a dynamic team", "Demonstrated experience in futures and/or OTC trading within energy or other financial markets, or an ability to quickly develop your skills in energy trading based on experience in a related role with transferrable skills", "Strong understanding of markets and risk management strategies", "Tertiary qualifications in Finance, Economics, Mathematics or another relevant discipline with a strong quantitative focus", "Strong analytical, mathematical and problem solving skills", "Effective negotiation, influencing and stakeholder management skills.", "WHAT YOU WILL GET BACK", "An opportunity to grow your career and redefine your role in Australia’s renewable energy transition", "A competitive remuneration package", "Flexible work that suits you", "A diverse and inclusive workplace.", "WHAT HYDRO TASMANIA GROUP IS ALL ABOUT", " For over 100 years we’ve led the charge in clean, sustainable energy – powering the nation from our idyllic, beautiful home base in Tasmania. We’re keeping our eyes on tomorrow, and our minds open to the possibilities that make better happen. We’re all here to make an impact that matters – and what matters most is the work we do together to find a way forward and prepare us for what’s next. You won’t find the opportunities we offer at other energy companies. Because whether you start at Hydro, Entura or Momentum – a career with us could take you beyond your expectations. We are passionate about diversity and inclusion and welcome applications from qualified candidates of all ages, races, abilities and genders. There’s a place for you amongst us to belong. ", "IF YOU WANT TO MAKE A DIFFERENCE FOR BETTER", "Please submit your resume and a cover letter outlining why you believe you will succeed in this role", "Alternatively you can send your CV to ", "alex.brown@jdrossenergy.com", " "], "url": "https://www.seek.com.au/job/52404548?type=standout#searchRequestToken=6a033b33-d59e-4d80-95e3-ac921f08a1b6"},
{"search": "Data Analyst", "job_title": "Implementation Specialist ", "company": "Hays Information Technology", "location_1": "Hobart", "location_2": "Information & Communication Technology", "sector_1": "Information & Communication Technology", "sector_2": "Networks & Systems Administration", "work_type": "Contract/Temp", "salary": null, "desc": ["Implement and integrate a new roster system onto the existing Payroll & HR System", " ", " ", "Your new company", "This Not For Profit organisation is a leading Aged Care Provider, supporting the elderly through a wide range of services in Tasmania. They are currently looking for an Implementation Specialist to join them on fixed term contract.  ", " ", "Your new role", "Based in Hobart, reporting to the payroll manager, you will be working on the implementation and integration of a new Attendance and Rostering system to the existing HR/Payroll System. You will use your payroll and award interpretation skills to build templates and models in the new roster system. Your role will see you using spreadsheet for mapping for pay-codes and other data, you will be loading of payroll information, test units of award rules. You will also be analysing and comparing results from parallel pays. You will be working alongside the project team and liaising with vendors as required. ", " ", " ", "What you'll need to succeed", " You have/are", "Hands on relevant experience implanting or integrating HR, Payroll or Attendance & Rostering applications and systems.  ", "Strong understanding of contemporary Payroll practices & Award interpretation skills  ", "Advanced Excel skills ", "Strong organisational skills  ", "Ability to obtain a Police check & Working With Vulnerable People Check  ", "Based in Tasmania and are available to work from the organisation's Hobart office  ", " ", "What you'll get in return", "6 months fixed term contract  ", "Access to Salary Packaging  ", "Free parking onsite  ", "Note that this role is in Hobart, the applicant has to be available locally. ", "What you need to do now", " If you're interested in this role, click 'apply now' to forward an up-to-date copy of your CV to Carole Jans-Cooremans, or call us now.", " If this job isn't quite right for you but you are looking for a new position, please contact us for a confidential discussion on your career.", " ", " ", "SA Licence number :", " LHS 297508"], "url": "https://www.seek.com.au/job/52406865?type=standard#searchRequestToken=6a033b33-d59e-4d80-95e3-ac921f08a1b6"},
{"search": "Data Analyst", "job_title": "Postdoctoral Researcher in the Measurement of Social and Economic Change", "company": "University of Tasmania", "location_1": "Hobart", "location_2": "Education & Training", "sector_1": "Education & Training", "sector_2": "Other", "work_type": "Contract/Temp", "salary": null, "desc": ["                              Postdoctoral Researcher in the Measurement of Social and Economic Change", "\n", " ", "\n", "\n", "Fixed Term, full time, 3-year appointment", "\n", "Based in Hobart", "\n", "Undertake high-quality research of national and increasingly of international standing.", "\n", "\n", "The Institute for Social Change draws on the expertise of researchers in the College of Arts, Law and Education and from across the University of Tasmania to understand social change. We provide analysis and commentary aimed at stimulating discussion around key issues affecting Tasmania and the wider community.", "\n", "The Opportunity ", "\n", "The Postdoctoral Researcher in the Measurement of Social and Economic Change will analyse existing tools and develop new methods for measuring and describing impact as it relates to social and economic change and to the University’s mission. The successful applicant will work with researchers across the University and with partners in government, business, and the community sectors. The position is a collaboration between the College of Arts, Law and Education, and the College of Business and Economics.", "\n", "Key Accountabilities:", "\n", "\n", "Contribute to the development of an innovative place-based approach to assessing the impact of change on wellbeing that combines available social, economic, cultural and environmental data with local opinions and narratives to support community, business and government decision-making", "\n", "Address debates and solutions that respond to strengths and limitations of current impact measures in quality journal publications and government, industry and community accessible reports and events", "\n", "Contribute to the writing of applications for and the delivery of external grants that are relevant to the Institute and University objectives", "\n", "Contribute to the successful supervision of research higher degree students", "\n", "Provide up to 0.2 FTE specialist teaching as required.", "\n", "\n", "Your Application", "\n", "To be successful in the role, your application will need to demonstrate;", "\n", "\n", " A PhD or equivalent in a relevant field (e.g. PhD near submission and relevant experience).", "\n", "A good record of, and continuing commitment to, research that has achieved national recognition and made worthwhile contributions within the social and/or economics sciences.  ", "\n", "A record of quality publications, presentations at conferences and preferably success in securing external competitive and other funding.", "\n", "A record of contributing to building and maintaining effective and productive links locally and nationally with the discipline, profession, and wider community.", "\n", "\n", "Remuneration", "\n", "Appointment to this role will be at Academic Level B and will have a total remuneration package of up to $133,842 comprising base salary within the range of $98,537 to $114,395 plus 17% superannuation.", "\n", "How to Apply:", "\n", "\n", "To apply online, please provide your resume, cover letter outlining your suitability and motivation for the role, and your responses to the position/selection criteria.", "\n", "For further information about this position, please contact Libby Lester, Director, CALE Institute, ", "Elizabeth.Lester@utas.edu.au", " or ", "0419 527 237", ".", "\n", "Please visit http://www.utas.edu.au/jobs/applying2 for our guide to applying and details on the recruitment process.", "\n", "\n", "Applications close Tuesday, 29 June 2021, 11.55pm", "\n", " ", "Position Description - Postdoctoral Researcher in the Measurement of Social and Economic Change.pdf", "\n", "To be eligible for this position, you are required to have Australian citizenship, permanent residence or a current valid visa that allows you to fulfill the requirements of this role."], "url": "https://www.seek.com.au/job/52541971?type=standout#searchRequestToken=6a033b33-d59e-4d80-95e3-ac921f08a1b6"},
{"search": "Data Analyst", "job_title": "Postdoctoral Researcher in the Measurement of Social and Economic Change", "company": "University of Tasmania", "location_1": "Hobart", "location_2": "Education & Training", "sector_1": "Education & Training", "sector_2": "Research & Fellowships", "work_type": "Contract/Temp", "salary": null, "desc": ["                              Postdoctoral Researcher in the Measurement of Social and Economic Change", "\n", " ", "\n", "\n", "Fixed Term, full time, 3-year appointment", "\n", "Based in Hobart", "\n", "Undertake high-quality research of national and increasingly of international standing.", "\n", "\n", "The Institute for Social Change draws on the expertise of researchers in the College of Arts, Law and Education and from across the University of Tasmania to understand social change. We provide analysis and commentary aimed at stimulating discussion around key issues affecting Tasmania and the wider community.", "\n", "The Opportunity ", "\n", "The Postdoctoral Researcher in the Measurement of Social and Economic Change will analyse existing tools and develop new methods for measuring and describing impact as it relates to social and economic change and to the University’s mission. The successful applicant will work with researchers across the University and with partners in government, business, and the community sectors. The position is a collaboration between the College of Arts, Law and Education, and the College of Business and Economics.", "\n", "Key Accountabilities:", "\n", "\n", "Contribute to the development of an innovative place-based approach to assessing the impact of change on wellbeing that combines available social, economic, cultural and environmental data with local opinions and narratives to support community, business and government decision-making", "\n", "Address debates and solutions that respond to strengths and limitations of current impact measures in quality journal publications and government, industry and community accessible reports and events", "\n", "Contribute to the writing of applications for and the delivery of external grants that are relevant to the Institute and University objectives", "\n", "Contribute to the successful supervision of research higher degree students", "\n", "Provide up to 0.2 FTE specialist teaching as required.", "\n", "\n", "Your Application", "\n", "To be successful in the role, your application will need to demonstrate;", "\n", "\n", " A PhD or equivalent in a relevant field (e.g. PhD near submission and relevant experience).", "\n", "A good record of, and continuing commitment to, research that has achieved national recognition and made worthwhile contributions within the social and/or economics sciences.  ", "\n", "A record of quality publications, presentations at conferences and preferably success in securing external competitive and other funding.", "\n", "A record of contributing to building and maintaining effective and productive links locally and nationally with the discipline, profession, and wider community.", "\n", "\n", "Remuneration", "\n", "Appointment to this role will be at Academic Level B and will have a total remuneration package of up to $133,842 comprising base salary within the range of $98,537 to $114,395 plus 17% superannuation.", "\n", "How to Apply:", "\n", "\n", "To apply online, please provide your resume, cover letter outlining your suitability and motivation for the role, and your responses to the position/selection criteria.", "\n", "For further information about this position, please contact Libby Lester, Director, CALE Institute, ", "Elizabeth.Lester@utas.edu.au", " or ", "0419 527 237", ".", "\n", "Please visit http://www.utas.edu.au/jobs/applying2 for our guide to applying and details on the recruitment process.", "\n", "\n", "Applications close Tuesday, 29 June 2021, 11.55pm", "\n", " ", "Position Description - Postdoctoral Researcher in the Measurement of Social and Economic Change.pdf", "\n", "To be eligible for this position, you are required to have Australian citizenship, permanent residence or a current valid visa that allows you to fulfill the requirements of this role."], "url": "https://www.seek.com.au/job/52541970?type=standout#searchRequestToken=6a033b33-d59e-4d80-95e3-ac921f08a1b6"},
{"search": "Data Analyst", "job_title": "Principal Research Scientist (Applied Breeder)", "company": "CSIRO", "location_1": "Hobart", "location_2": "Science & Technology", "sector_1": "Science & Technology", "sector_2": "Biotechnology & Genetics", "work_type": "Full Time", "salary": "AU$139,166 to AU$153,975 pa + up to 15.4% super", "desc": ["The Opportunity", " ", " ", "Innovate & advance commercial aquaculture breeding programs", " ", "Develop & apply advanced quantitative genetics & genomic selection methods to accelerate genetic gain", " ", "Excellent flexibility and work life balance", " ", "CSIRO’s Agriculture Business Unit is currently recruiting a Principal Research Scientist to join the Aquaculture Applied Breeding team which operates a portfolio of commercial breeding programs and associated research projects. Our focus is across multiple species of finfish, molluscs and crustaceans with clients and collaborators located both in Australia and internationally. The team works at the interface of quantitative genetics, genomics, data systems and applied breeding to support the development of a strong and thriving aquaculture sector.", "  ", "The successful applicant will identify, develop and incorporate advanced and new technologies or methodologies into commercial breeding operations, and will engage clients, lead research activities, and operate within an applied breeding team consisting of quantitative geneticists, aquaculture biologists, and database and software developers.", "  ", "Your duties will include:", " ", " ", "In collaboration with colleagues, use research and/or industry experience to formulate, develop and implement applied breeding programs and research.", " ", "Thrive in a working environment characterised by commercial delivery and impact through applied science.", " ", "Anticipate and identify research-based solutions to address industry needs through client liaison.", " ", "As a hands-on practitioner in quantitative genetics, analyse large genotype, phenotype, and pedigree datasets to inform applied breeding decisions.", " ", "Lead and supervise staff to ensure the delivery of applied breeding program outcomes in accordance with agreed timeframes and budget, while providing broader scientific leadership in applied breeding.", " ", "Participate in CSIRO leadership pathways with the opportunity to assume future leadership roles.", " ", "Location:", " Hobart, TAS", "  ", "Salary:", " AU$139k – AU$153k plus up to 15.4% superannuation", "  ", "Tenure: ", "Indefinite", "  ", "Reference:", " 71069 ", "  ", "To be considered you will need:", " ", " ", "Relevant tertiary qualifications in quantitative or statistical genetics, or equivalent experience.", " ", "Demonstrated experience with deploying advanced genetic technologies and the implementation of genomic selection within applied breeding programs.", " ", "An internationally recognised track record in the field of applied breeding with the ability to engage industry and prospective clients interested in the design, implementation, and continual improvement of selective breeding programs.", " ", "A proven track record delivering to, or working within, commercial breeding activities.", " ", "Experience or familiarity with aquaculture breeding, and scientific leadership in genomic selection and a proven record in leading research activities is desirable.", " ", "Experience working with software developers to design or enhance data management systems and their application to deliver applied breeding programs is also desirable.", " ", "For full details about this role please view the ", "Position Description", "  ", "Eligibility", "  ", "The successful applicant will be required to obtain and provide a National Police Check or equivalent.", "  ", "Flexible Working Arrangements", "  ", "We work flexibly at CSIRO, offering a range of options for how, when and where you work. Talk to us about how this role could be flexible for you. ", "Balance", "  ", "Diversity and Inclusion", "  ", "We are working hard to recruit diverse people and ensure that all our people feel supported to do their best work and feel empowered to let their ideas flourish. ", "Diversity and Inclusion Strategy", "  ", "We are committed to the safety and wellbeing of all children and young people.", "  ", "About CSIRO", "  ", "At ", "CSIRO", ", Australia's national science agency, we solve the greatest challenges through innovative science and technology.", "  ", "Join us and start creating tomorrow today!", "  ", "How to Apply", "  ", "Please apply on-line and provide a cover letter and CV that best demonstrate your motivation and ability to meet the requirements of this role.", "  ", "Applications Close", "  ", "4 July 2021, 11:00pm AEST"], "url": "https://www.seek.com.au/job/52325396?type=standout#searchRequestToken=6a033b33-d59e-4d80-95e3-ac921f08a1b6"},
{"search": "Data Analyst", "job_title": "Principal Research Scientist (Applied Breeder)", "company": "CSIRO", "location_1": "Hobart", "location_2": "Government & Defence", "sector_1": "Government & Defence", "sector_2": "Government - Federal", "work_type": "Full Time", "salary": "AU$139,166 to AU$153,975 pa + up to 15.4% super", "desc": ["The Opportunity", " ", " ", "Innovate & advance commercial aquaculture breeding programs", " ", "Develop & apply advanced quantitative genetics & genomic selection methods to accelerate genetic gain", " ", "Excellent flexibility and work life balance", " ", "CSIRO’s Agriculture Business Unit is currently recruiting a Principal Research Scientist to join the Aquaculture Applied Breeding team which operates a portfolio of commercial breeding programs and associated research projects. Our focus is across multiple species of finfish, molluscs and crustaceans with clients and collaborators located both in Australia and internationally. The team works at the interface of quantitative genetics, genomics, data systems and applied breeding to support the development of a strong and thriving aquaculture sector.", "  ", "The successful applicant will identify, develop and incorporate advanced and new technologies or methodologies into commercial breeding operations, and will engage clients, lead research activities, and operate within an applied breeding team consisting of quantitative geneticists, aquaculture biologists, and database and software developers.", "  ", "Your duties will include:", " ", " ", "In collaboration with colleagues, use research and/or industry experience to formulate, develop and implement applied breeding programs and research.", " ", "Thrive in a working environment characterised by commercial delivery and impact through applied science.", " ", "Anticipate and identify research-based solutions to address industry needs through client liaison.", " ", "As a hands-on practitioner in quantitative genetics, analyse large genotype, phenotype, and pedigree datasets to inform applied breeding decisions.", " ", "Lead and supervise staff to ensure the delivery of applied breeding program outcomes in accordance with agreed timeframes and budget, while providing broader scientific leadership in applied breeding.", " ", "Participate in CSIRO leadership pathways with the opportunity to assume future leadership roles.", " ", "Location:", " Hobart, TAS", "  ", "Salary:", " AU$139k – AU$153k plus up to 15.4% superannuation", "  ", "Tenure: ", "Indefinite", "  ", "Reference:", " 71069 ", "  ", "To be considered you will need:", " ", " ", "Relevant tertiary qualifications in quantitative or statistical genetics, or equivalent experience.", " ", "Demonstrated experience with deploying advanced genetic technologies and the implementation of genomic selection within applied breeding programs.", " ", "An internationally recognised track record in the field of applied breeding with the ability to engage industry and prospective clients interested in the design, implementation, and continual improvement of selective breeding programs.", " ", "A proven track record delivering to, or working within, commercial breeding activities.", " ", "Experience or familiarity with aquaculture breeding, and scientific leadership in genomic selection and a proven record in leading research activities is desirable.", " ", "Experience working with software developers to design or enhance data management systems and their application to deliver applied breeding programs is also desirable.", " ", "For full details about this role please view the ", "Position Description", "  ", "Eligibility", "  ", "The successful applicant will be required to obtain and provide a National Police Check or equivalent.", "  ", "Flexible Working Arrangements", "  ", "We work flexibly at CSIRO, offering a range of options for how, when and where you work. Talk to us about how this role could be flexible for you. ", "Balance", "  ", "Diversity and Inclusion", "  ", "We are working hard to recruit diverse people and ensure that all our people feel supported to do their best work and feel empowered to let their ideas flourish. ", "Diversity and Inclusion Strategy", "  ", "We are committed to the safety and wellbeing of all children and young people.", "  ", "About CSIRO", "  ", "At ", "CSIRO", ", Australia's national science agency, we solve the greatest challenges through innovative science and technology.", "  ", "Join us and start creating tomorrow today!", "  ", "How to Apply", "  ", "Please apply on-line and provide a cover letter and CV that best demonstrate your motivation and ability to meet the requirements of this role.", "  ", "Applications Close", "  ", "4 July 2021, 11:00pm AEST"], "url": "https://www.seek.com.au/job/52325397?type=standout#searchRequestToken=6a033b33-d59e-4d80-95e3-ac921f08a1b6"},
{"search": "Data Analyst", "job_title": "Agribusiness Relationship Analyst - Launceston", "company": "Randstad - Banking & Finance", "location_1": "Launceston & North East", "location_2": "Banking & Financial Services", "sector_1": "Banking & Financial Services", "sector_2": "Banking - Business", "work_type": "Full Time", "salary": null, "desc": ["Use your agribusiness qualifications and get started into agri-banking!", "- Strong bank in sector", "- Agribusiness focus", "- Strong team environment and career growth", "We are working with our client to find some fantastic new Relationship Analysts for their Tasmania team. Known as a thought leader and innovator in the agricultural and food sector, this bank's global network and expertise coupled with their local knowledge is a consistent factor in their clients' success.", "Part of a regional support team you will have fun working in their collaborative culture with your Analyst peers, Product experts, and Relationship Managers and enjoy establishing strong relationships with your clients and their RMs to provide a key point of contact for queries across the portfolio. Responsibilities will include:", "Appropriate analysis and preparation of credit proposals, presentations and pitches for new clients, products and services;", "Preparing and submitting annual reviews and keeping Credit / Risk appraised of developments as they relate to your clients and industry;", "Managing a variety of lending operational and administration tasks across a portfolio of clients ;", "Understanding and ensuring compliance with all relevant internal and external rules, regulations and procedures;", "Assisting with the development and maintenance of individual client plans and providing high quality industry sector, competitor and client level analysis to support the credit application process, where required", "Providing guidance, advice and coaching to less experienced team members as required.", "In addition to your credit experience in business/corporate lending, the ideal people we want to talk to will be team players, possess great interpersonal and communication skills and have a genuine interest, passion or background in agribusiness. Relevant experience in preparation of complex loan applications and interpreting financial statements and industry data, with a focus on credit quality will be key to your success. ", "We will also consider an Associate Analyst looking for a step up and stretch", " from where they are if they can demonstrate some solid commercial credit skills and a genuine motivation to work in agri sector and grow their career.", "To enquire further, please contact ", "Chris Gatley on ", "0402177849", ". ", "Confidentiality is assured.", "At Randstad, we are passionate about providing equal employment opportunities and embracing diversity to the benefit of all. We actively encourage applications from any background."], "url": "https://www.seek.com.au/job/52417295?type=standard#searchRequestToken=6a033b33-d59e-4d80-95e3-ac921f08a1b6"},
{"search": "Data Analyst", "job_title": "Contracts Energy Trader", "company": "Opus Recruitment Solutions", "location_1": "Hobart", "location_2": "Mining, Resources & Energy", "sector_1": "Mining, Resources & Energy", "sector_2": "Analysis & Reporting", "work_type": "Full Time", "salary": "$140000 - $160000 per annum, + Bonus", "desc": ["JD Ross Energy and Opus Talent Solutions are excited to be partnering with Hydro Tasmania, in the search for an Energy Trader to join their trading team in Hobart.", "Hydro Tasmania have been at the forefront of the energy transition, pioneering some of the biggest legacy projects in the country, such as the Marinus Link and Battery of the Nation. Recently striking a game changing, first-ever deal for the trade of stored energy.", "This is a great opportunity for an Energy Trader to join a progressive utility that holds real family values, while working with dispatchable renewables, and in a role where you can make an impact.", "WHAT YOU WILL DO", "The Energy Trader develops and implements trading strategies to manage energy and environmental product market risks and maximise earnings within relevant limits. You will optimise Hydro Tasmania’s position for our diverse portfolio incorporating generation and retail activities across the National Electricity Market.", "As part of a team, you will:", "Develop strategies and tactics to optimise gross margin for wholesale and retail activities through participation in financial markets. ", "Conduct day to day contract trading activities ethically in line with all relevant legislation, regulation and market rules.", "Maintain relationships with wholesale market counterparties to achieve trading objectives.", "Monitor performance against trading plans and reflect on individual and team learnings for continuous improvement.", "Carry out analysis and pricing of non-standard products.", "Incorporate market and portfolio analysis to inform trading strategies and decisions.", "WHAT YOU WILL BRING", "To be successful in this role you will have:", "A passion for your craft, drive to succeed and collaborative nature that enjoys working as part of a dynamic team", "Demonstrated experience in futures and/or OTC trading within energy or other financial markets, or an ability to quickly develop your skills in energy trading based on experience in a related role with transferrable skills", "Strong understanding of markets and risk management strategies", "Tertiary qualifications in Finance, Economics, Mathematics or another relevant discipline with a strong quantitative focus", "Strong analytical, mathematical and problem solving skills", "Effective negotiation, influencing and stakeholder management skills.", " ", "WHAT YOU WILL GET BACK", "An opportunity to grow your career and redefine your role in Australia’s renewable energy transition", "A competitive remuneration package", "Flexible work that suits you", "A diverse and inclusive workplace.", "WHAT HYDRO TASMANIA GROUP IS ALL ABOUT", "For over 100 years we’ve led the charge in clean, sustainable energy – powering the nation from our idyllic, beautiful home base in Tasmania. We’re keeping our eyes on tomorrow, and our minds open to the possibilities that make better happen. We’re all here to make an impact that matters – and what matters most is the work we do together to find a way forward and prepare us for what’s next. You won’t find the opportunities we offer at other energy companies. Because whether you start at Hydro, Entura or Momentum – a career with us could take you beyond your expectations. We are passionate about diversity and inclusion and welcome applications from qualified candidates of all ages, races, abilities and genders. There’s a place for you amongst us to belong."], "url": "https://www.seek.com.au/job/52363940?type=standard#searchRequestToken=6a033b33-d59e-4d80-95e3-ac921f08a1b6"},
{"search": "Data Analyst", "job_title": "Energy Trader", "company": "Opus Recruitment Solutions", "location_1": "Hobart", "location_2": "Mining, Resources & Energy", "sector_1": "Mining, Resources & Energy", "sector_2": "Analysis & Reporting", "work_type": "Full Time", "salary": "$130000 - $170000 per annum, 15% bonus", "desc": ["Opus Talent Solutions and JD Ross Energy are excited to be partnering with Hydro Tasmania, in the search for an Energy Trader to join their trading team in Hobart.", "At Hydro Tasmania, we’re leaders in renewable energy, powering Australia with clean hydropower.  We really care about making a difference for the better, but it’s a big job and we can’t do it alone. Which is right where you come in.  As an Energy Trader, you’ll maximise value from the National Electricity Market in line with strategy whilst ensuring compliance to all relevant regulatory obligations.  ", "WHAT YOU WILL DO", "The Energy Trader develops and implements trading strategies to manage energy and environmental product market risks and maximise earnings within relevant limits. You will optimise Hydro Tasmania’s position for our diverse portfolio incorporating generation and retail activities across the National Electricity Market. ", "As part of a team, you will: ", "Develop strategies and tactics to optimise gross margin for wholesale and retail activities through participation in financial markets.", "Conduct day to day contract trading activities ethically in line with all relevant legislation, regulation and market rules.", "Maintain relationships with wholesale market counterparties to achieve trading objectives.", "Monitor performance against trading plans and reflect on individual and team learnings for continuous improvement.", "Carry out analysis and pricing of non-standard products.", "Incorporate market and portfolio analysis to inform trading strategies and decisions.", "WHAT YOU WILL BRING", "To be successful in this role you will have: ", "A passion for your craft, drive to succeed and collaborative nature that enjoys working as part of a dynamic team", "Demonstrated experience in futures and/or OTC trading within energy or other financial markets, or an ability to quickly develop your skills in energy trading based on experience in a related role with transferrable skills", "Strong understanding of markets and risk management strategies", "Tertiary qualifications in Finance, Economics, Mathematics or another relevant discipline with a strong quantitative focus", "Strong analytical, mathematical and problem solving skills", "Effective negotiation, influencing and stakeholder management skills.", "WHAT YOU WILL GET BACK", "An opportunity to grow your career and redefine your role in Australia’s renewable energy transition", "A competitive remuneration package", "Flexible work that suits you", "A diverse and inclusive workplace.", "WHAT HYDRO TASMANIA GROUP IS ALL ABOUT", " For over 100 years we’ve led the charge in clean, sustainable energy – powering the nation from our idyllic, beautiful home base in Tasmania. We’re keeping our eyes on tomorrow, and our minds open to the possibilities that make better happen. We’re all here to make an impact that matters – and what matters most is the work we do together to find a way forward and prepare us for what’s next. You won’t find the opportunities we offer at other energy companies. Because whether you start at Hydro, Entura or Momentum – a career with us could take you beyond your expectations. We are passionate about diversity and inclusion and welcome applications from qualified candidates of all ages, races, abilities and genders. There’s a place for you amongst us to belong. ", "IF YOU WANT TO MAKE A DIFFERENCE", "Please submit your resume and a cover letter outlining why you believe you will succeed in this role by 9am Monday 20 June 2021.", "CONTACT ", "Alex.brown@jdrossenergy.com"], "url": "https://www.seek.com.au/job/52349517?type=standard#searchRequestToken=6a033b33-d59e-4d80-95e3-ac921f08a1b6"},
{"search": "Data Analyst", "job_title": "Software Engineer - Information and Data Centre", "company": "CSIRO", "location_1": "Hobart", "location_2": "Information & Communication Technology", "sector_1": "Information & Communication Technology", "sector_2": "Engineering - Software", "work_type": "Full Time", "salary": null, "desc": [" ", "Are you", " ", "experienced in designing, developing & maintaining web-based, data-driven systems?", " ", "Do you have well-developed skills in languages such as Python & Java? ", " ", "Join CSIRO - Australia’s premier science & technology research organisation", " ", " ", "  ", "We are seeking a Software Engineer to work within the Scientific Data Systems (SDS) Group, part of CSIRO's National Collections and Marine Infrastructure (NCMI) business unit. We manage Marine National Facility (MNF) data from the Research Vessel Investigator and other biological collections to benefit research and industry.", "  ", "You will work in a diverse team developing, deploying and maintaining innovative web tools and systems for the curation, description and dissemination of scientific data.", "  ", "Your duties will include:", " ", " ", "Developing innovative software systems to support the tracking, publication and reuse of scientific data sets.", " ", "Developing and maintaining web-based systems, services, and tools to manage and visualise a wide range of scientific and geospatial data.", " ", "Stakeholder engagement and developing interoperable data systems for the dissemination of MNF data.  ", " ", "Determining client needs and taking personal responsibility for their satisfaction.", " ", " ", "  ", "Location: ", "Hobart, TAS", "Salary: ", "AU$85k - AU$96k plus up to 15.4% superannuation", "Tenure: ", "Indefinite", "Reference: ", "73084", "  ", " ", "  ", "To be considered you will need:", " ", " ", "A relevant tertiary qualification in Computer Science or Software Engineering and experience designing, developing and maintaining web-based, data-driven systems.", " ", "Demonstrated computing skills as follows: ", " ", "Ability to program in modern object-oriented languages (e.g. Python, Java) and experience with frameworks, libraries and languages relevant to the development of data systems and web-based applications,", " ", "Windows/Linux network administration skills, and", " ", "An understanding of modern software engineering methodologies. ", " ", "An understanding of DevOps principles and processes.", " ", " ", " ", "Experience in, or a strong willingness to support, the standards-based management, visualisation and dissemination of scientific data.", " ", "Familiarity with relational databases.", " ", "Excellent interpersonal, oral and written communications skills, including the ability to document software, data flows and to produce manuals and reports.", " ", "The ability to develop and meet goals, working with clients under limited direction to mutually agreed outcomes and specific deadlines.", " ", " ", "  ", "For full details about this role please review the ", "Position Description", ".", "  ", " ", "  ", "Eligibility", "  ", "The successful applicant will be required to obtain and provide a National Police Check or equivalent.", "  ", "Flexible Working Arrangements", "  ", "We work flexibly at CSIRO, offering a range of options for how, when and where you work. Talk to us about how this role could be flexible for you. ", "Balance", "  ", "Diversity and Inclusion", "  ", "We are working hard to recruit diverse people and ensure that all our people feel supported to do their best work and feel empowered to let their ideas flourish. ", "Diversity and Inclusion Strategy", "  ", "We are committed to the safety and wellbeing of all children and young people.", "  ", "About CSIRO", "  ", "At ", "CSIRO", ", Australia's national science agency, we solve the greatest challenges through innovative science and technology.", "  ", "Join us and start creating tomorrow today!", "  ", "How to Apply", "  ", "Please apply on-line and provide your CV, as well as ", "evidenced-based responses to the criteria", ", as outlined in the position description.", "  ", "Applications Close", "  ", "14th June 2021, 11:00pm AEST"], "url": "https://www.seek.com.au/job/52436512?type=standout#searchRequestToken=6a033b33-d59e-4d80-95e3-ac921f08a1b6"},
{"search": "Data Analyst", "job_title": "Associate Graduate Consultant ", "company": "Capgemini Australia Pty Ltd", "location_1": "Hobart", "location_2": "Information & Communication Technology", "sector_1": "Information & Communication Technology", "sector_2": "Consultants", "work_type": "Full Time", "salary": null, "desc": ["You've aced your exams, now ace your career!  Come join our much-celebrated Graduate Program, ranked as one of the top graduate programs in Australia in 2019 & 2020 by the Australian Association of Graduate Employers.", "\n", "Let's talk about our team:", "\n", "We are over 220,000 people passionate about helping our clients solve their most complex business and techology challenges, and we deliver transformational outcomes, at scale. We are driven by the conviction that the business value of technology comes from and through people.", "\n", "We live by our motto \"People matter, results count\". ", "\n", "Let's talk about what we do:", "\n", "At Capgemini, we help the world's leading brands use the best of new tech to transform the way they do business. As a global leader in consulting, technology services, and digital transformation, Capgemini is at the forefront of innovation to address the entire breadth of clients' opportunities in the evolving world of cloud, digital and platforms.", "\n", "Our graduates typically work in roles in the areas of Software Development, DevOps, Change Management, Business Analysis and Program Management Office.", "\n", "Let's talk about what you will need to be considered for our Graduate Program:", "\n", "You must attach a covering letter, resume and academic transcripts.", "\n", "To be considered, you will need to satisfy the following requirements:", "\n", "\n", "Australian or New Zealand citizenship or permanent residency", "\n", "A completed Bachelor or Master's degree during the last 2 years with a minimum credit plus average. We generally look for applicants with a Bachelor's degree in an area of technology, predominantly Information Systems, Computer Science, Commerce, Finance, Data, and Human Resources, however we will consider other degrees if you have a strong interest and leaning towards technology", "\n", "Be able to commence full time work in July 2021", "\n", "Prior work or Intern experience in a related field will be highly regarded", "\n", "Exceptional communication skills and an outstanding customer service ethic", "\n", "Great academic results as well as a passion for solving complex problems", "\n", "Resilient and energetic team player who is open minded and willing to learn", "\n", "Driven to succeed (at Capgemini we call this \"La Niaque\")", "\n", "A sense of humour, \"Fun\" has been a company value for 50 years!", "\n", "And finally, individ-uals who care about our people, our community and our planet and who are totally aligned to our values.", "\n", "\n", "Let's talk about what happens after you apply:", "\n", "Step 1: Application assessment", "\n", "We will review your profile through checking your academic results, previous work experience and any extracurricular activities you have undertaken, your motivation for joining us (which should be included in your covering letter), and what area you are interested to work in. We will also check that you have Australian or New Zealand citizenship or Permanent Resident status which is a mandatory requirement.", "\n", "Step 2: Behavioural and Cognitive assessments", "\n", "Those who make it through to this stage will be sent online assessments to complete, to help us understand your fit for particular roles and your ability to learn quickly and problem solve.  ", "\n", "Step 3: Assessment Centres", "\n", "Successful applicants will be invited to attend one of our assessment centres which will be held in Sydney, Melbourne, Adelaide and Canberra during May/June 2021.  Don't be surprised if one of our recruitment super stars reaches out to you for a chat - something interesting may catch our eye, and we may want to discuss.", "\n", "Step 4: Final interviews", "\n", "Successful candidates from the assessment centres will be invited to a final round of interviews with business leaders. Selections will be made from these interviews and we will proceed to offer and conduct pre-employment screening.  You will then be all set to join our amazing graduate program!", "\n", "Let's talk about what we can offer you once you join!", "\n", "Passionate people are Capgemini's Ace of spades. We believe that every one of us is an architect of positive futures.  We invite you to join us to discover a career that will challenge, support and inspire you. With a world class Learning and Development program for graduates and all employees, we will set you up for success.", "\n", "In return for your hard work and fresh insights, we'll provide you with incredible opportunities that will accelerate your development, along with the support and guidance you need to allow you to take your career in any direction you choose. Capgemini is more than just a workplace. It is an organisation of opportunity, innovation, collaboration, and it's where you can make lifelong connections.", "\n", "Working at Capgemini you'll find the rewards are more than just financial. Not only will you work alongside inspiring colleagues with a world of experience, but you'll also have access to great benefits including the ability to purchase additional leave to fit in travel and life, salary continuance insurance, paid parental leave, education assistance, salary packaging, as well as discounts on entertainment, financial and wellbeing services, travel and shopping.", "\n", "Ranked among Ethisphere's 2019 Most Ethical Companies in the World (for the 8th year running!), our seven values are at the heart of everything we do - Honesty, Boldness, Trust, Team Spirit, Freedom, Fun and Modesty. As Social Innovators, we are committed to making a positive impact on the planet and our communities. Capgemini is proud to be an Equal Opportunity Employer.", "\n", "Successful applicants will be required to complete police checks prior to commencement of employment.", "\n", "APPLICATIONS CLOSE 15 JUNE 2021", "\n", "To find out more about our Graduate Program, click here: https://www.capgemini.com/au-en/careers/capgemini-australia-graduate-program/", "\n", " "], "url": "https://www.seek.com.au/job/52479054?type=standout#searchRequestToken=6a033b33-d59e-4d80-95e3-ac921f08a1b6"},
{"search": "Data Analyst", "job_title": "Senior Policy Analyst (522491)", "company": "Department of Health", "location_1": "Hobart", "location_2": "Consulting & Strategy", "sector_1": "Consulting & Strategy", "sector_2": "Policy", "work_type": "Full Time", "salary": null, "desc": ["Salary:", "\n", "$95,033 to $107,840 pro rata, per annum.", "\n", "Classification:", "\n", "General Stream Band 6.", "\n", "Award: ", "\n", "Health and Human Services (Tasmanian State Service) Award.", "\n", "Period of employment / Hours: ", "\n", "Permanent full-time day work (part-time hours may be considered by negotiation)", "\n", "\n", "Please note: Other permanent full-time and part-time vacancies, and fixed term full-time and part-time vacancies, that may arise in the near future may also be filled from this selection process.", "\n", "\n", "Location:", "\n", "Policy, Purchasing, Performance & Reform - South. ", "\n", "Duties:", "\n", "\n", "Develop high-level, strategic advice regarding government relations and strategic policy issues for the portfolio Ministers, Secretary, Agency, and other stakeholders.", "\n", "Provide input into the negotiation, management, and implementation of intergovernmental agreements.", "\n", "Develop, research, and analyse submissions, applications and business cases relating to intergovernmental agreements.", "\n", "Assist with managing the Agency’s role in intergovernmental forums, including the development, analysis, and provision of strategic advice to support participants.", "\n", "Support conduct and coordinate Agency and/or Government Relations and Strategic Policy (GRaSP) projects under general direction.", "\n", "\n", "Note: - Please refer to the Statement of Duties for all the selection criteria of this position to address in your application.", "\n", "Desirable Requirements:", "\n", "\n", "Bachelor Degree in a relevant course of study.", "\n", "\n", "Essential Requirements:", "\n", "The Head of the State Service has determined that the person nominated for this job is to satisfy a pre‑employment check before taking up the appointment, on promotion or transfer. The following checks are to be conducted: ", "\n", "\n", "1.  Conviction checks in the following areas:", "\n", "\n", "a)  crimes of violence", "\n", "b)  sex related offences", "\n", "c)  serious drug offences", "\n", "d)  crimes involving dishonesty", "\n", "\n", "2.  Identification check", "\n", "3.  Disciplinary action in previous employment check.", "\n", "\n", "Download the Statement of Duties and any Associated Documents", "\n", "Statement of Duties (PDF):  ", "522491, 517978, 519390, 519766 Senior Policy Analyst Band 6 (May 2021).pdf", "\n", "Statement of Duties (Word):  ", "522491, 517978, 519390, 519766 Senior Policy Analyst Band 6 (May 2021).docx", "\n", "APPLICANT GUIDE", ":", "\n", " ", "Short_Form_Application_-_Guidelines_for_Applicants_-_Feb_2019.pdf", "\n", " ", "Short_Form_Application_-_Guidelines_for_Applicants_-_Feb_2019.docx", " ", "\n", "For more information ", "(Contact Officer)", "\n", "Name: Rebekah Moore", "\n", "Email:  ", "rebekah.moore1@health.tas.gov.au", "\n", "Phone: ", "(03) 6166 3859", "\n", "***************************************** ", "\n", "How to apply: ", "\n", "\n", "To apply, please provide a copy of your CV, that outlines your responsibilities and achievements in previous roles, with two referees and a 2 page summary on why you are the best person for the job.", "\n", "The Tasmania State Service values and encourages diversity at all levels of employment, and flexible and contemporary working arrangements are offered to support this.", "\n", "\n", "Online applications are preferred", " - please click the blue 'Apply Now' button. ", "\n", "Better health and quality of life around Tasmania. Visit us at ", "www.health.tas.gov.au."], "url": "https://www.seek.com.au/job/52530579?type=standout#searchRequestToken=6a033b33-d59e-4d80-95e3-ac921f08a1b6"},
{"search": "Data Analyst", "job_title": "Senior Policy Analyst (522491)", "company": "Department of Health", "location_1": "Hobart", "location_2": "Government & Defence", "sector_1": "Government & Defence", "sector_2": "Government - State", "work_type": "Full Time", "salary": null, "desc": ["Salary:", "\n", "$95,033 to $107,840 pro rata, per annum.", "\n", "Classification:", "\n", "General Stream Band 6.", "\n", "Award: ", "\n", "Health and Human Services (Tasmanian State Service) Award.", "\n", "Period of employment / Hours: ", "\n", "Permanent full-time day work (part-time hours may be considered by negotiation)", "\n", "\n", "Please note: Other permanent full-time and part-time vacancies, and fixed term full-time and part-time vacancies, that may arise in the near future may also be filled from this selection process.", "\n", "\n", "Location:", "\n", "Policy, Purchasing, Performance & Reform - South. ", "\n", "Duties:", "\n", "\n", "Develop high-level, strategic advice regarding government relations and strategic policy issues for the portfolio Ministers, Secretary, Agency, and other stakeholders.", "\n", "Provide input into the negotiation, management, and implementation of intergovernmental agreements.", "\n", "Develop, research, and analyse submissions, applications and business cases relating to intergovernmental agreements.", "\n", "Assist with managing the Agency’s role in intergovernmental forums, including the development, analysis, and provision of strategic advice to support participants.", "\n", "Support conduct and coordinate Agency and/or Government Relations and Strategic Policy (GRaSP) projects under general direction.", "\n", "\n", "Note: - Please refer to the Statement of Duties for all the selection criteria of this position to address in your application.", "\n", "Desirable Requirements:", "\n", "\n", "Bachelor Degree in a relevant course of study.", "\n", "\n", "Essential Requirements:", "\n", "The Head of the State Service has determined that the person nominated for this job is to satisfy a pre‑employment check before taking up the appointment, on promotion or transfer. The following checks are to be conducted: ", "\n", "\n", "1.  Conviction checks in the following areas:", "\n", "\n", "a)  crimes of violence", "\n", "b)  sex related offences", "\n", "c)  serious drug offences", "\n", "d)  crimes involving dishonesty", "\n", "\n", "2.  Identification check", "\n", "3.  Disciplinary action in previous employment check.", "\n", "\n", "Download the Statement of Duties and any Associated Documents", "\n", "Statement of Duties (PDF):  ", "522491, 517978, 519390, 519766 Senior Policy Analyst Band 6 (May 2021).pdf", "\n", "Statement of Duties (Word):  ", "522491, 517978, 519390, 519766 Senior Policy Analyst Band 6 (May 2021).docx", "\n", "APPLICANT GUIDE", ":", "\n", " ", "Short_Form_Application_-_Guidelines_for_Applicants_-_Feb_2019.pdf", "\n", " ", "Short_Form_Application_-_Guidelines_for_Applicants_-_Feb_2019.docx", " ", "\n", "For more information ", "(Contact Officer)", "\n", "Name: Rebekah Moore", "\n", "Email:  ", "rebekah.moore1@health.tas.gov.au", "\n", "Phone: ", "(03) 6166 3859", "\n", "***************************************** ", "\n", "How to apply: ", "\n", "\n", "To apply, please provide a copy of your CV, that outlines your responsibilities and achievements in previous roles, with two referees and a 2 page summary on why you are the best person for the job.", "\n", "The Tasmania State Service values and encourages diversity at all levels of employment, and flexible and contemporary working arrangements are offered to support this.", "\n", "\n", "Online applications are preferred", " - please click the blue 'Apply Now' button. ", "\n", "Better health and quality of life around Tasmania. Visit us at ", "www.health.tas.gov.au."], "url": "https://www.seek.com.au/job/52530580?type=standout#searchRequestToken=6a033b33-d59e-4d80-95e3-ac921f08a1b6"},
{"search": "Data Analyst", "job_title": "People & Culture Program Integration Specialist", "company": "TasNetworks", "location_1": "Hobart", "location_2": "Human Resources & Recruitment", "sector_1": "Human Resources & Recruitment", "sector_2": "Consulting & Generalist HR", "work_type": "Full Time", "salary": null, "desc": ["About the role", " ", "The role of People and Culture Program Integration Specialist, focuses on the coordination, design and delivery of people initiatives that build on a quality team member experience across all stages of the employment life cycle.", " ", " ", " ", "About the Business", " ", "At TasNetworks, we own, operate and maintain the electricity transmission and distribution network in Tasmania. We deliver a safe, efficient and reliable electricity supply to more than 285,000 residential, commercial and industrial customers. We are Powering a bright future, it's in our DNA;", " ", "We are our customers too", " ", "Safety is at the heart of all we do", " ", "We unify and respond to challenges", " ", "Trusted to deliver", " ", "We embrace diversity and forward thinking   ", " ", " ", " ", "About you", " ", "You are an experienced and savvy HR generalist with a conviction to challenge the status quo and the know-how to do so. You combine a continuous improvement mindset approach with great research and data analysis skills and the ability to develop conclusions and recommend a plan of action. Leadership and coaching comes naturally to you and you are able to engage with multiple stakeholders and manage change in a complex and diverse environment.  ", " ", " ", " ", "What's on offer", " ", "This is a full time permanent role offering a strong career path, excellent benefits, flexible working arrangements and employee assistance programs crafted to guide you in reaching your full potential. For those looking for a lifestyle change and a relocation to Tasmania, TasNetworks will support the move by offering relocation assistance. Can you help us Power a bright future?", " ", " ", " ", "Can you see yourself living here?", " ", "Based in Tasmania’s capital, historic Hobart will be a phenomenal base for the successful incumbent to reside in order to take up this role. The region is situated on the gorgeous river Derwent with appealing world heritage wilderness areas just a stone’s throw away. Enjoy a relaxed lifestyle with easy access to world-class events like Mona Foma, Taste of Tasmania and Wooden Boat festival.", " ", " ", " ", "How to apply", " ", "If this role and working at TasNetworks is of interest we look forward to hearing from you. TasNetworks is an Equal Opportunity employer and we encourage applications from all members of the community, including people of Aboriginal and Torres Strait Islander descent, culturally and linguistically diverse backgrounds and mature aged people. Please ensure you attach a cover letter outlining how your skills and experience are aligned with this role, and an up to date resume. For more information about this opportunity and to acquire a position description, please click ", "here.", " ", "Click ", "here", " to see a video about the role!", " ", "Applications close 11:59pm Tuesday the 15th of June.", " ", "For further information about the role, please contact ", "Victoria.Newton@tasnetworks.com.au", " ", " ", " ", "To be eligible for this position, you are required to have Australian citizenship, permanent residence or a current valid visa that allows you to fulfill the requirements of this role.", " ", " ", "  ", "\n\n"], "url": "https://www.seek.com.au/job/52431321?type=standout#searchRequestToken=6a033b33-d59e-4d80-95e3-ac921f08a1b6"},
{"search": "Data Analyst", "job_title": "Portfolio Analyst - Private Markets", "company": "Perceptive Talent Solutions Pty Ltd", "location_1": "Hobart", "location_2": "Banking & Financial Services", "sector_1": "Banking & Financial Services", "sector_2": "Funds Management", "work_type": "Full Time", "salary": "Highly Competitive Salary Package", "desc": ["My client is a consistently high performing industry super fund based in Sydney's CBD. They have a fantastic working culture a reputation as a leader within their industry segment. They are seeking a highly motivated Investment Analyst / Portfolio Manager to manage a range of direct investments into private markets.", "About the role:", "This newly created position will report directly to the CEO / CIO and will be based in the satellite office in Hobart. ", "You will lead the implementation of the private markets strategy through direct investments in property, infrastructure, private equity and private debt.", "You will provide critical support to the CIO on the assessment of new private market investment options and will monitor and report on investment fund performance. You will also be responsible for developing and maintaining a strong investment solution and governance framework. ", "About You:", "You will demonstrate substantial recent experience in a related role in private market transactions either within a super fund or another corporate environment. You will have a strong analytical and problem solving skill set and outstanding communications and people skills. ", "To Apply:", "For a confidential discussion please contact ", "Matt Steele", " from ", "Perceptive Talent Solutions", " on ph: ", "02 8004 7923", " or email: ", "matt@perceptive-talent.com.au"], "url": "https://www.seek.com.au/job/52422314?type=standout#searchRequestToken=6a033b33-d59e-4d80-95e3-ac921f08a1b6"},
{"search": "Data Analyst", "job_title": "Laboratory Analyst in LA - ICPMS", "company": "University of Tasmania", "location_1": "Hobart", "location_2": "Education & Training", "sector_1": "Education & Training", "sector_2": "Other", "work_type": "Full Time", "salary": null, "desc": ["Laboratory Analyst in LA-ICPMS", "\n", " ", "\n", "\n", "Fixed-term, full time position for three years", "\n", "Based in Hobart, Sandy Bay Campus", "\n", "Be part of one of the world’s leading laser ablation analytical laboratories in the field of geochemistry.", "\n", "\n", "The Centre for Ore Deposit and Earth Sciences (CODES), part of the School of Natural sciences is widely regarded as a global leader in ore deposit research. Having formed in 1989, CODES has developed a long-standing reputation for delivering high quality research within the mining industry.", "\n", "The Opportunity ", "\n", "The Centre for Ore Deposit and Earth Sciences (CODES) is seeking to appoint a Laboratory Analyst to be responsible for the operation and maintenance of one of the four LA-ICPMS units within the CODES Analytical Laboratories. The Laboratories also operate a clean sample preparation laboratory for solution ICPMS, a fully equipped Lapidary laboratory, WDS-XRF, portable XRF and bulk XRD instruments. The Laboratories are simultaneously a research and service unit which supports CODES research projects and external users, performing geochemical analyses following the methods developed within the Laboratories’ R&D program. The LA-ICP-MS equipment includes 4 RESOlution S-155 laser microprobes, 3 UP-platform laser microprobes, 3 Agilent 7900, 1 Agilent 8900, and 1 TOF-R mass-spectrometers.", "\n", "The successful candidate will be highly trained in geochemical microanalysis and able to provide advice and training on how to operate the equipment, support research projects within CODES, and facilitate access to the Laboratories for external users.", "\n", "Key Accountabilities:", "\n", "\n", "Operate one LA-ICPMS laboratory consisting of a quadrupole ICPMS and an excimer laser microprobe", "\n", "Perform maintenance and minor repairs of instruments", "\n", "Provide expert advice to internal and external users", "\n", "Train academic staff and research students on the operation of the equipment.", "\n", "Perform LA-ICPMS analyses for and report results to external users of the Laboratories", "\n", "\n", "Your Application ", "\n", "To be successful in the role, your application will need to demonstrate;", "\n", "\n", "An Honours degree or higher qualification in the field of geochemistry, or equivalent, with extensive experience in the field of analytical geochemistry.", "\n", "Experience in independently operating and maintaining LA-ICPMS equipment.", "\n", "Interest and the ability to show initiative in LA-ICPMS analytical developments.", "\n", "Experience with data reduction procedures for LA-ICPMS analytical data, including U-Pb geochronology.", "\n", "Ability to work as part of a team.", "\n", "\n", "Remuneration", "\n", "Appointment to this role will be at HEO 7 and will have a total remuneration package of up to $112,425 comprising base salary within the range of $87,423 to $96,090 plus 17% superannuation.", "\n", "How to Apply:", "\n", "\n", "To apply online, please provide your resume, cover letter outlining your suitability and motivation for the role, and your responses to the position/selection criteria listed in the position description.", "\n", "For further information about this position, please contact the Leader of CODES Analytical Laboratories, Professor Leonid Danyushevsky, ", "L.Dan@utas.edu.au", " or ", "03 6226 2469", ".", "\n", "Please visit ", "https://www.utas.edu.au/jobs/applying", " for our guide to applying and details on the recruitment process.", "\n", "\n", "Applications close Tuesday, 22 June 2021, 11.55pm", "\n", " ", "Position Description - Laboratory Analyst.pdf"], "url": "https://www.seek.com.au/job/52371760?type=standout#searchRequestToken=6a033b33-d59e-4d80-95e3-ac921f08a1b6"},
{"search": "Data Analyst", "job_title": "Laboratory Analyst in LA - ICPMS", "company": "University of Tasmania", "location_1": "Hobart", "location_2": "Science & Technology", "sector_1": "Science & Technology", "sector_2": "Laboratory & Technical Services", "work_type": "Full Time", "salary": null, "desc": ["Laboratory Analyst in LA-ICPMS", "\n", " ", "\n", "\n", "Fixed-term, full time position for three years", "\n", "Based in Hobart, Sandy Bay Campus", "\n", "Be part of one of the world’s leading laser ablation analytical laboratories in the field of geochemistry.", "\n", "\n", "The Centre for Ore Deposit and Earth Sciences (CODES), part of the School of Natural sciences is widely regarded as a global leader in ore deposit research. Having formed in 1989, CODES has developed a long-standing reputation for delivering high quality research within the mining industry.", "\n", "The Opportunity ", "\n", "The Centre for Ore Deposit and Earth Sciences (CODES) is seeking to appoint a Laboratory Analyst to be responsible for the operation and maintenance of one of the four LA-ICPMS units within the CODES Analytical Laboratories. The Laboratories also operate a clean sample preparation laboratory for solution ICPMS, a fully equipped Lapidary laboratory, WDS-XRF, portable XRF and bulk XRD instruments. The Laboratories are simultaneously a research and service unit which supports CODES research projects and external users, performing geochemical analyses following the methods developed within the Laboratories’ R&D program. The LA-ICP-MS equipment includes 4 RESOlution S-155 laser microprobes, 3 UP-platform laser microprobes, 3 Agilent 7900, 1 Agilent 8900, and 1 TOF-R mass-spectrometers.", "\n", "The successful candidate will be highly trained in geochemical microanalysis and able to provide advice and training on how to operate the equipment, support research projects within CODES, and facilitate access to the Laboratories for external users.", "\n", "Key Accountabilities:", "\n", "\n", "Operate one LA-ICPMS laboratory consisting of a quadrupole ICPMS and an excimer laser microprobe", "\n", "Perform maintenance and minor repairs of instruments", "\n", "Provide expert advice to internal and external users", "\n", "Train academic staff and research students on the operation of the equipment.", "\n", "Perform LA-ICPMS analyses for and report results to external users of the Laboratories", "\n", "\n", "Your Application ", "\n", "To be successful in the role, your application will need to demonstrate;", "\n", "\n", "An Honours degree or higher qualification in the field of geochemistry, or equivalent, with extensive experience in the field of analytical geochemistry.", "\n", "Experience in independently operating and maintaining LA-ICPMS equipment.", "\n", "Interest and the ability to show initiative in LA-ICPMS analytical developments.", "\n", "Experience with data reduction procedures for LA-ICPMS analytical data, including U-Pb geochronology.", "\n", "Ability to work as part of a team.", "\n", "\n", "Remuneration", "\n", "Appointment to this role will be at HEO 7 and will have a total remuneration package of up to $112,425 comprising base salary within the range of $87,423 to $96,090 plus 17% superannuation.", "\n", "How to Apply:", "\n", "\n", "To apply online, please provide your resume, cover letter outlining your suitability and motivation for the role, and your responses to the position/selection criteria listed in the position description.", "\n", "For further information about this position, please contact the Leader of CODES Analytical Laboratories, Professor Leonid Danyushevsky, ", "L.Dan@utas.edu.au", " or ", "03 6226 2469", ".", "\n", "Please visit ", "https://www.utas.edu.au/jobs/applying", " for our guide to applying and details on the recruitment process.", "\n", "\n", "Applications close Tuesday, 22 June 2021, 11.55pm", "\n", " ", "Position Description - Laboratory Analyst.pdf"], "url": "https://www.seek.com.au/job/52371759?type=standout#searchRequestToken=6a033b33-d59e-4d80-95e3-ac921f08a1b6"},
{"search": "Data Analyst", "job_title": "Metallurgical Superintendent", "company": "Bluestone Mines Tasmania Joint Venture P ty Ltd", "location_1": "Devonport & North West", "location_2": "Mining, Resources & Energy", "sector_1": "Mining, Resources & Energy", "sector_2": "Mining - Processing", "work_type": "Full Time", "salary": null, "desc": ["Tasmania Tin Operations", " ", "Renison Mine", "About Bluestone", "Bluestone Mines Tasmania Joint Venture Pty Ltd, is Australia's largest Tin producer.  Bluestone is a well-established, high yield tin mine now entering an exciting redevelopment period. The Renison mine is located on Tasmania's beautiful West Coast between the towns of Zeehan and Rosebery.", "About the mine", "It is an exciting time at the Renison underground mine which has recently announced its Life of Mine plan outlining a strong resource plan for the next 10 years. Renison is embarking on a progressive improvement journey to challenge the way we work and optimise our operations to increase our production and transform our mining style. A capital plan of works to construct a paste backfill plant and new ventilation shaft is just some of the work underway to support the journey.", "The Renison Processing Plant consists of a diverse range of processing stages, including a new crushing, screening and ore sorting plant, rod and ball mill grinding, sulphide and oxide flotation, gravity concentration, state-of-the-art 24 stream sampling and on-stream analysis, historian data management system, and concentrate leaching. A feasibility study into tailings retreatment via mineral processing and pyrometallurgical treatment is also currently underway.", "About the role", "This is a fantastic opportunity for an experienced metallurgical professional to drive the business forward using their creativity and leadership skills. Reporting to the Manager Processing you will ensure the efficient running of people and metallurgical services. You will partner with leaders, employees, and contractor work groups to provide support and advice creating a safe, effective, and positive workforce.", "This position is being offered is on a preferred 5:2/4:3 roster with the possibility of FIFO/DIDO. Variations to this roster might be considered.", "Core responsibilities", " ", "Implements the metallurgical standards, plant operating practices and processes to meet recovery, production, and quality targets.", " ", "Report against parameters, challenging set points as required to allow delivery of the Business Plan.", " ", "Creates a continuous improvement culture and implements improving initiatives.", " ", "Demonstrated willingness to be flexible and adaptable to changing priorities.", " ", "A strong focus on creating a positive engaging culture within your teams whilst maintaining safety a priority.", " ", "Using experience and knowledge to monitor less experienced people to reach their potential.", " ", "Demonstrate an overriding commitment to health, safety, environment responsibility and sustainable development.", "About you", " ", "You will have tertiary qualifications in Metallurgy or Chemical Engineering with experience in a similar role or ready to take the next step in your career.", "Safety is a priority for you, and you actively contribute to making your workplace safe. Strong communication and interpersonal skills are a must, which allows you to build relationships across departments and to communicate at all levels.", "This is an exciting opportunity to join a friendly and inclusive team where results are rewarded, and new ideas are encouraged and supported.", " ", "Bluestone Mines Tasmania offers a range of lifestyle options, catering for both residential and drive in drive out options.  Attractive residential benefits are available or alternatively, fully catered modern Single Persons Quarters are available for those seeking a drive-in-drive-out option.", "Close date: 27 June 2021", "To apply online, please click on the appropriate link below."], "url": "https://www.seek.com.au/job/52456338?type=standard#searchRequestToken=1e662ff9-c532-4f0a-8448-70ce0a5e8761"},
{"search": "Data Analyst", "job_title": "Undergraduate Accountant (immediate start)", "company": "WLF Accounting & Advisory", "location_1": "Hobart", "location_2": "Accounting", "sector_1": "Accounting", "sector_2": "Financial Accounting & Reporting", "work_type": "Full Time", "salary": null, "desc": ["If you are currently studying an accounting degree and looking to launch your career with Tasmania’s leading accounting and advisory firm while completing your degree, we invite your application.", "  ", " ", "  ", "About you", "  ", "Our staff and clients are our greatest assets, so we want to employ the best. If the following sounds like you, we encourage you to submit an application.", " ", " ", "currently studying an undergraduate or postgraduate degree with an Accounting major", " ", "keen to gain a head-start on your accounting career by combining it with your study", " ", "a commitment to excellent customer service", " ", "IT savvy, confident and interested in working with technology for your firm and clients", " ", "business experience and skills, gained through casual work, a previous career or voluntary placements", " ", "skills in data analysis, and an aptitude for delivering solutions", " ", "self-motivated with initiative and life skills, gained through being engaged with work, clubs or your community", " ", "have a driver’s licence", " ", "a great team player who is reliable and communicates well", " ", "Applicants must have permanent residency and be able to work in Australia. Further information for international students is available on our website.", "  ", " ", "  ", "About WLF", "  ", "WLF Accounting & Advisory is a proudly Tasmanian firm with a long-standing reputation for delivering the highest standard of service to our clients for 130 years. We have more than 80 staff and 12 Partners delivering specialist services across all areas of accounting.", "  ", "We are looking to fill an undergraduate position within our Business and Personal Advisory division for an immediate start.", " The successful applicant will work full time as an accountant, and study part-time. We provide:", " ", " ", "paid time off for study, including lectures, tutorials and exams", " ", "a supportive environment with undergraduate colleagues and recent graduates, who can share their experiences with you", " ", "the chance to launch your career with real-world experience while completing your degree", " ", "Working at WLF is more than a job – as part of our team you will be rewarded with a competitive salary package, a flexible workplace and ongoing professional development.", "  ", "We are a registered training employer of Chartered Accountants Australia and New Zealand and we support our Graduate Accountants through completing a CA qualification – we pay for the course fees and study materials upfront, offer paid study leave for each module and even pay you to attend our in-house tutorials.", "  ", " ", "  ", "The next steps:", "  ", "Applications are now open and must be submitted through the listing on Seek. To be considered you must provide:", " ", " ", "curriculum vitae", " ", "academic transcript", " ", "two referees with contact telephone and email details", " ", "a brief covering letter, no more than 400 words describing how your experience is relevant to our needs and why you’re the best candidate", " ", "a copy of your IELTS or PTE results and visa if you’re an international student", " ", "Please note", " that Seek will allow for 2 PDF uploads only. We suggest you combine the above files to one or two PDFs.", "  ", "Applications close:  Sunday 4 July 2021 (at midnight)", "  ", "If you have any questions please contact us at ", "careers@wlf.com.au", " ", "  ", " "], "url": "https://www.seek.com.au/job/52574104?type=standout#searchRequestToken=1e662ff9-c532-4f0a-8448-70ce0a5e8761"},
{"search": "Data Analyst", "job_title": "Animal Health Field Technician", "company": "Tassal Operations Pty Ltd", "location_1": "Hobart", "location_2": "Farming, Animals & Conservation", "sector_1": "Farming, Animals & Conservation", "sector_2": "Fishing & Aquaculture", "work_type": "Full Time", "salary": null, "desc": ["Our products are on dinner plates and in lunch boxes right across Australia. With over 30 years of experience, we are industry leaders, innovators, safe and diligent producers and first and foremost, we are responsible farmers who prioritise our people, their safety and the communities in which we operate.", "We are farmers. Our communities form our heartland. Our people are our heartbeat.", "The Position:", "This position is responsible for the gathering of health and environmental data, being first responders in disease outbreak investigations, to implement the zero harm for fish framework and to work closely with the Animal Health Team to improve fish survivability in the company.  The position requires the individual to work closely with the Animal Health team to optimise welfare of our fish (in relation to husbandry, environment and disease management); collect production data; disease monitoring and surveillance (in particular amoebic gill disease), to conduct disease investigations on site and to drive improvements in animal health and welfare across the company. This position may be based in Margate however regular travel to our marine sites further south is essential.", "Day to day duties may include:", "Surveillance across all of Tassal’s marine farming sites for disease;", "Investigation of fish health incidents and disease outbreaks;", "Support for the implementation of best practice biosecurity;", "Support Tassal’s phytoplankton and jellyfish monitoring program;", "Timely and effective communication of fish health status including but not limited to formal investigation and reporting; data analysis; case reviews and follow up;", "Support fish health related research; and", "Support other initiatives of Tassal’s technical team.", "You: ", "To be considered for this role you will have:", "Ideally a tertiary qualification in biological science (or another related field); although practical experience will also be favourably viewed", "Passion in and exposure to aquatic animal health;", "The ability to work autonomously and as part of a team;", "Strong attention to detail and critical thinking ability;", "Excellent communication skills (verbal and written);", "Excel and data management skills;", "Flexibility in regards to working hours and working location (travel between sites is required);", "Restricted coxswains, deck machinery and/or commercial dive tickets advantageous;", "Boat experience advantageous", "FishTalk software management experience viewed favourably; and", "Current drivers licence essential", "Benefits for you:", "Good life balance with a 2/2/3 Roster;", "5 weeks annual leave per year;", "Become part of and learn from an experienced, commercial aquatic animal health team;", "Work on the water at our beautiful marine leases, as well as have time to analyse and communicate results from back at the office in Margate; and", "Develop an understanding of planning and implementing a variety of health-related tasks that guide animal welfare and decision making.", "We’re passionate about farming and we’re proud of it! We are committed to protecting the environment we operate in and ensuring the farmed seafood we produce is of the highest quality so that you can continue to enjoy it today and into the future. As the world changes, we adapt, and through a combination of science, technology and passion, we’re revolutionising seafood farming in Australia. We strive for excellence across our four critical factors of success (4P's) - Our People, Our Planet, Our Product and Our Performance and are recognised as an Employer of Choice. To learn more about our business, people and products visit  www.tassal.com.au [link removed]", " ", "If this is a home-grown Australian success story that you want to be a part of - apply today!", " ", "Interested? Hit the apply now button or head to the vacancy on our website to apply directly http://tassalgroup.com.au/our-people/join-our-team/ [link removed]", " ", "For a confidential discussion regarding this role, please contact Erin Bennett, People and Culture Coordinator on ", "0418 628 213", ". Applications close Wednesday 23 June 2021 at 9.00am."], "url": "https://www.seek.com.au/job/52505472?type=standout#searchRequestToken=1e662ff9-c532-4f0a-8448-70ce0a5e8761"},
{"search": "Data Analyst", "job_title": "Software Engineer - Information and Data Centre", "company": "CSIRO", "location_1": "Hobart", "location_2": "Government & Defence", "sector_1": "Government & Defence", "sector_2": "Government - Federal", "work_type": "Full Time", "salary": null, "desc": [" ", "Are you", " ", "experienced in designing, developing & maintaining web-based, data-driven systems?", " ", "Do you have well-developed skills in languages such as Python & Java? ", " ", "Join CSIRO - Australia’s premier science & technology research organisation", " ", " ", "  ", "We are seeking a Software Engineer to work within the Scientific Data Systems (SDS) Group, part of CSIRO's National Collections and Marine Infrastructure (NCMI) business unit. We manage Marine National Facility (MNF) data from the Research Vessel Investigator and other biological collections to benefit research and industry.", "  ", "You will work in a diverse team developing, deploying and maintaining innovative web tools and systems for the curation, description and dissemination of scientific data.", "  ", "Your duties will include:", " ", " ", "Developing innovative software systems to support the tracking, publication and reuse of scientific data sets.", " ", "Developing and maintaining web-based systems, services, and tools to manage and visualise a wide range of scientific and geospatial data.", " ", "Stakeholder engagement and developing interoperable data systems for the dissemination of MNF data.  ", " ", "Determining client needs and taking personal responsibility for their satisfaction.", " ", " ", "  ", "Location: ", "Hobart, TAS", "Salary: ", "AU$85k - AU$96k plus up to 15.4% superannuation", "Tenure: ", "Indefinite", "Reference: ", "73084", "  ", " ", "  ", "To be considered you will need:", " ", " ", "A relevant tertiary qualification in Computer Science or Software Engineering and experience designing, developing and maintaining web-based, data-driven systems.", " ", "Demonstrated computing skills as follows: ", " ", "Ability to program in modern object-oriented languages (e.g. Python, Java) and experience with frameworks, libraries and languages relevant to the development of data systems and web-based applications,", " ", "Windows/Linux network administration skills, and", " ", "An understanding of modern software engineering methodologies. ", " ", "An understanding of DevOps principles and processes.", " ", " ", " ", "Experience in, or a strong willingness to support, the standards-based management, visualisation and dissemination of scientific data.", " ", "Familiarity with relational databases.", " ", "Excellent interpersonal, oral and written communications skills, including the ability to document software, data flows and to produce manuals and reports.", " ", "The ability to develop and meet goals, working with clients under limited direction to mutually agreed outcomes and specific deadlines.", " ", " ", "  ", "For full details about this role please review the ", "Position Description", ".", "  ", " ", "  ", "Eligibility", "  ", "The successful applicant will be required to obtain and provide a National Police Check or equivalent.", "  ", "Flexible Working Arrangements", "  ", "We work flexibly at CSIRO, offering a range of options for how, when and where you work. Talk to us about how this role could be flexible for you. ", "Balance", "  ", "Diversity and Inclusion", "  ", "We are working hard to recruit diverse people and ensure that all our people feel supported to do their best work and feel empowered to let their ideas flourish. ", "Diversity and Inclusion Strategy", "  ", "We are committed to the safety and wellbeing of all children and young people.", "  ", "About CSIRO", "  ", "At ", "CSIRO", ", Australia's national science agency, we solve the greatest challenges through innovative science and technology.", "  ", "Join us and start creating tomorrow today!", "  ", "How to Apply", "  ", "Please apply on-line and provide your CV, as well as ", "evidenced-based responses to the criteria", ", as outlined in the position description.", "  ", "Applications Close", "  ", "14th June 2021, 11:00pm AEST"], "url": "https://www.seek.com.au/job/52436513?type=standout#searchRequestToken=6a033b33-d59e-4d80-95e3-ac921f08a1b6"},
{"search": "Data Analyst", "job_title": "Animal Health Technical Team Leader", "company": "Tassal Operations Pty Ltd", "location_1": "Hobart", "location_2": "Farming, Animals & Conservation", "sector_1": "Farming, Animals & Conservation", "sector_2": "Veterinary Services & Animal Welfare", "work_type": "Full Time", "salary": null, "desc": ["Our products are on dinner plates and in lunch boxes right across Australia. With over 30 years of experience, we are industry leaders, innovators, safe and diligent producers and first and foremost, we are responsible farmers who prioritise our people, their safety and the communities in which we operate.", "  ", "We are farmers. Our communities form our heartland. Our people are our heartbeat.", "  ", "The Position:", "  Reporting to the Senior Manager – Animal Health and Welfare, the Animal Health Team leader will be responsible for supporting Tassal’s animal health strategy through implementation of the animal health management plan; and disease surveillance program, leading the animal health team to success. This position will be based at Margate, however travel to our marine sites regularly is essential. This position will also provide support in achieving Tassal’s objectives in relation to animal health initiatives with a focus on fish health, specifically in relation to amoebic gill disease management, phytoplankton monitoring, preventative production medicine, support of internal and external research and development initiatives; and support of best-practice welfare standards.", "  ", "Day to day duties may include:", " ", " ", "Lead a team of four animal health technicians, who will be structured as two shifts of two team members.", " ", "Responsibility for day-to-day planning and conducting of animal health surveillance, fish performance assessment, site environmental status, as well as data management and reporting", " ", "Assistance in the investigation of fish health incidents and disease outbreaks;", " ", "Support for the implementation of best practice biosecurity;", " ", "Support Tassal’s phytoplankton and jellyfish monitoring program;", " ", "Timely and effective communication of fish health status including but not limited to formal investigation and reporting; data analysis; case reviews and follow up;", " ", "Support fish health related research; and", " ", "Support other initiatives of Tassal’s technical team;", " ", "You:", " We are looking for someone who can lead a team through their initiative, and ability to be analytically minded and commercially aware.", "  ", "To be considered for this role you will have:", " ", " ", "Tertiary qualifications in veterinary science or marine biology (or another related field);", " ", "Experience leading or supervising teams;", " ", "Passion in and exposure to aquatic animal health;", " ", "The ability to work autonomously and as part of a team;", " ", "Strong attention to detail and critical thinking ability;", " ", "Excellent communication skills (verbal and written);", " ", "Excel and data management skills;", " ", "Flexibility in regards to working hours and working location (travel between sites is required);", " ", "Restricted coxswain and/or commercial dive tickets advantageous;", " ", "FishTalk software management experience viewed favourably; and", " ", "Current drivers licence essential", " ", "Benefits:", " ", " ", "Earn a leadership position in an experienced, commercial aquatic animal health team, whilst continually learning from other members;", " ", "Have responsibility for a variety of health-related tasks and help guide animal welfare and decision making on Tassal’s marine farms;", " ", "Work on the water at our beautiful marine leases, as well as have time to plan and coordinate tasks from in the office in Margate; and", " ", "Family friendly Monday-Friday Roster.", " ", "We’re passionate about farming and we’re proud of it! We are committed to protecting the environment we operate in and ensuring the farmed seafood we produce is of the highest quality so that you can continue to enjoy it today and into the future. As the world changes, we adapt, and through a combination of science, technology and passion, we’re revolutionising seafood farming in Australia. We strive for excellence across our four critical factors of success (4P's) - Our People, Our Planet, Our Product and Our Performance and are recognised as an Employer of Choice. To learn more about our business, people and products visit  www.tassal.com.au ", "  ", " ", "  ", "If this is a home-grown Australian success story that you want to be a part of - apply today!", "  ", " ", "  ", "Interested? Hit the apply now button or head to the vacancy on our website to apply directly http://tassalgroup.com.au/our-people/join-our-team/ ", "  ", " ", "  ", "For a confidential discussion regarding this role, please contact Erin Bennett, People and Culture Coordinator on ", "0418 628 213", ". Applications close Wednesday 23 June 2021 at 9.00am."], "url": "https://www.seek.com.au/job/52505630?type=standout#searchRequestToken=1e662ff9-c532-4f0a-8448-70ce0a5e8761"},
{"search": "Data Analyst", "job_title": "Clinical Outcomes Partner", "company": "Baptcare", "location_1": "Devonport & North West", "location_2": "Healthcare & Medical", "sector_1": "Healthcare & Medical", "sector_2": "Nursing - Aged Care", "work_type": "Full Time", "salary": null, "desc": ["Clinical Outcomes Partner", "Karingal Community, Devonport Tasmania", "Permanent Full-Time", "- Opportunity to make a significant contribution", "- A supportive team environment", "- Not for profit salary packaging", "About the Organisation:", "Baptcare is a customer focused, faith centred and purpose driven not for profit organisation, providing residential and community care for older people and support to children, families, and people with disability, financially disadvantaged people and people seeking asylum.", "About the Role:", "We are seeking an experienced Clinical Outcomes Partner on a full-time basis to join Baptcare Karingal's Leadership team.The Clinical Outcomes Partner works collaboratively to suppport the care teams and the Facility Manager to deliver quality care outcomes.This role is responsible for driving the activity required to optimise funding.Through the provision of education, the Clinical Outcomes Partner assists staff to understand and adhere to the expected outcomes.", "Qualifications, Duties and Responsibilities:", "* Experienced Registered Nurse", "* Assist monitoring quality of care and resident outcomes. Manages the quality activities necessary to provide compliant, evidence-based practice ensuring that care standards are being monitored and improved", "* Development of an education program specific to direct care staff. Identify potential opportunities for staff development and initiate relevant education and development. Responsible for the Baptcare manual handling program delivery and outcomes", "* Responsible for ACFI process compliance in the facility, ensures the program of documentation supports the optimization of funding opportunities", "* Assist the Facility Manager to demonstrate that there is a process of continuous improvement and review in the clinical domain through auditing and data analysis, and quality activities", "* Support the Facility Manager as a key member of the Leadership team, in all aspects of service provision and quality customer experience", "* Promote and maintain Baptcare WHS policies, procedures and practices to ensure quality outcomes for all stakeholders", "* May deputise for the Facility Manager in their absence and may provide backfill support to the NUM role as needed", "How to Apply:", "Please visit https://www.baptcare.org.au/get-involved/careers/vacancies and click '", "Apply Now", "' to apply for this position and view the role statement", "Only short-listed applicants will be contacted. No agencies please.", "Please direct enquiries to Trent Baxter on ", "t.baxter@baptcare.org.au", "Applications close ", "Wednesday 30th June at 5pm", ".", "Appointment to this role is subjected to a current influenza vaccination and a satisfactory police check.", "Baptcare is committed to ensuring our employees are representative of the communities that we serve. People with disability are highly encouraged to apply for jobs with Baptcare and where possible, we will make reasonable adjustments to enable individuals with disabilities to perform the essential functions of the role.", "Baptcare is a child-safe organisation and has a zero-tolerance approach to child abuse, and indeed to the abuse of any person. Applicants will be carefully screened and will need to demonstrate a commitment to the safety of children and vulnerable people.", "Baptcare is committed to building a respectful and inclusive workplace, appointing the best person for the role and supporting diversity."], "url": "https://www.seek.com.au/job/52573284?type=standard#searchRequestToken=1e662ff9-c532-4f0a-8448-70ce0a5e8761"},
{"search": "Data Analyst", "job_title": "Senior Lecturer in Southern Ocean Vertebrate Ecology", "company": "University of Tasmania", "location_1": "Hobart", "location_2": "Education & Training", "sector_1": "Education & Training", "sector_2": "Teaching - Tertiary", "work_type": "Full Time", "salary": null, "desc": ["Lecturer/Senior Lecturer in Southern Ocean Vertebrate Ecology", "\n", "\n", "Full time ongoing position.", "\n", "Based in Hobart.", "\n", "Make a strong contribution to the University as an innovative scientist and educator in our vertebrate ecology team.", "\n", "\n", "The Institute for Marine and Antarctic Studies (IMAS) is a centre of excellence for both research and education with world-leading research strengths in Oceanography, Fisheries and Aquaculture, Marine Ecology and Biodiversity, and Southern Ocean and Antarctic sciences.", "\n", "The Opportunity ", "\n", "We are looking for an innovative scientist and educator tasked with research and undergraduate and graduate level teaching. As the Lecturer/Senior Lecturer you will develop a multidisciplinary research and teaching program focused on the ecology of marine vertebrates including critical concerns regarding anthropogenic and climate change interactions in the Antarctic region.", "\n", "Key Accountabilities:", "\n", "\n", "Contribute to the University in achieving strategic objectives and operational responsibilities.", "\n", "Undertake high-quality research of national and international standing, secure external competitive funding, publish research findings and successfully supervise research higher degree students to completion, in order to meet and regularly exceed the University’s research performance expectations for Level B/C.", "\n", "Undertake scholarly undergraduate (and if relevant postgraduate) coursework teaching.", "\n", "Increasingly provide academic leadership, particularly in fostering outstanding research and/or learning and teaching.", "\n", "Contribute to the development and maintenance of productive and effective links inside the University.­", "\n", "\n", "Your Application", "\n", "To be successful in the role, your application will need to demonstrate;", "\n", "\n", "A PhD in a relevant field.", "\n", "A strong record and commitment to research that has achieved national and preferably international recognition and made notable contributions to the field of marine mammal and seabird ecology or management.", "\n", "A capacity in quantitative ecology, with high level quantitative analysis and numerical modelling skills.", "\n", "A record of contributions to successful research higher degree supervision and completions.", "\n", "Experience and demonstrated achievement in University-level teaching and learning.", "\n", "Experience in marine biotelemetry is desirable.", "\n", "\n", "Remuneration", "\n", "Appointment to this role at Academic Level B will have a total remuneration package of up to $133,842 comprising base salary within the range of $98,537 to $114,395 plus 17% superannuation.", "\n", "Appointment to this role at Academic Level C will have a total remuneration package of up to $158,046 comprising base salary within the range of $118,946 to $135,082 plus 17% superannuation.", "\n", "How to Apply:", "\n", "\n", "To apply online, please provide your resume, cover letter outlining your suitability and motivation for the role, and your responses to the position/selection criteria.", "\n", "For further information about this position, please contact Catriona MacLeod, Principal Research Fellow/Head of Centre - Ecology & Biodiversity, ", "Catriona.Macleod@utas.edu.au", " or ", "(03) 6226 8237", ".", "\n", "Please visit ", "http://www.utas.edu.au/jobs/applying2", " for our guide to applying and details on the recruitment process.", "\n", "\n", "Applications close Tuesday, 29 June 2021, 11.55pm", "\n", " ", "Position Description - Lecturer Senior Lecturer in Southern Ocean Vertebrate Ecology.pdf", "\n", "To be eligible for this position, you are required to have Australian citizenship, permanent residence or a current valid visa that allows you to fulfill the requirements of this role."], "url": "https://www.seek.com.au/job/52427111?type=standout#searchRequestToken=1e662ff9-c532-4f0a-8448-70ce0a5e8761"},
{"search": "Data Analyst", "job_title": "Human Resources Officer", "company": "Custom HR", "location_1": "Hobart", "location_2": "Human Resources & Recruitment", "sector_1": "Human Resources & Recruitment", "sector_2": "Consulting & Generalist HR", "work_type": "Full Time", "salary": null, "desc": ["Our client is a privately owned and operated Tasmanian company servicing infrastructure projects throughout the state. Operating for over 55 years, the company is committed to the safety of its employees and the public, product quality, and customer service.", "  ", "This role will report to the Corporate Services Manager and undertake key HR functions that support the company's overall people strategy and objectives.", "  ", "This position offers the opportunity to apply your skills and experience in HR and payroll across a broad range of responsibilities including :  ", " ", " ", "end to end recruitment;", " ", "engagement of new employees", " ", "assistance with drafting of processes, procedures and programs as required;", " ", "facilitating dispute resolution;", " ", "undertaking workplace investigations;", " ", "co-ordinating training and maintaining training records;", " ", "assistance with the timely and accurate processing of payroll (and all related activities) on a weekly basis;", " ", "act as the first point of contact for payroll queries;", " ", "provide accurate, informed and timely advice and information on certain HR related matters;", " ", "discreet handling of confidential information and documentation;", " ", "confidential management of the HR database;", " ", "administration of all HR regulatory reporting requirements and related tasks – including data analysis;", " ", "specific project work as directed.", " ", "This position calls for a confident and competent individual who communicates effectively and easily builds trust and credibility. ", "  ", "You will be a people-person who is pro-active and equipped to work in a stand-alone HR role providing advice, support and guidance to line managers and business units.  Highly organised, you will be also disciplined to meet deadlines and apply a high degree of accuracy and attention to detail to all you do.   ", "  ", "Ideally you will possess:", " ", " ", "relevant qualifications or equivalent experience in Human Resources (or be studying towards);", " ", "experience as a HR generalist covering all of the above responsibilties;", " ", "a working understanding of Modern Awards and Fair Work legislation", " ", "a strong work ethic and organisational skills with the ability to manage several tasks on the go;", " ", "exceptional teamwork, interpersonal and communication skills", " ", "strong analytical and problem solving skills;", " ", "exceptional computer skills including experience developing forms, templates and presentations in MS Office as well as using HR Systems or ERP’s;", " ", "a current drivers licence; and ", " ", "If you feel you can bring the capability and motivation we are looking for, and would value the opportunity to work for a market leader with a long track record of delivering quality projects for Tasmania, please press Apply and attach an up to date CV and covering letter addressing all criteria.", "  ", " "], "url": "https://www.seek.com.au/job/52583836?type=standout#searchRequestToken=1e662ff9-c532-4f0a-8448-70ce0a5e8761"},
{"search": "Data Analyst", "job_title": "Procurement Manager - Projects", "company": "Red Giant", "location_1": "Hobart", "location_2": "Manufacturing, Transport & Logistics", "sector_1": "Manufacturing, Transport & Logistics", "sector_2": "Purchasing, Procurement & Inventory", "work_type": "Full Time", "salary": null, "desc": ["The Company ", "  ", "Spirit of Tasmania is a private company established in 1993 by the Tasmanian government to operate passenger and freight services across Bass Strait.  Operating two ferries between Melbourne and Devonport, the company has two shore based sites with a head office in Devonport Tasmania and Port Melbourne Victoria.", "  ", "Context", "  ", "Spirit of Tasmania is about to commence construction of two new vessels to replace the current fleet.  These vessels will be larger and have greater capacity for both passengers and freight than the current vessels.", "  ", "As part of these builds, a commitment has been made to collaboratively pursue the use of Tasmanian materials and content in the construction of the vessels to deliver up to $100 million in local supply to Tasmanian businesses.", "  ", "The Role", "  ", "To facilitate the procurement of Tasmanian materials and content, Spirit of Tasmania is seeking to appoint a Tasmanian based Procurement Manager – Projects, with strong expertise in procurement with local industry. ", "  ", "The role will be Tasmanian based however, whilst there is an expectation that you will spend some time at the Head Office in Devonport, there is flexibility around the permanent working location.  Interstate travel will also be required.", "  ", "Vessels will be constructed at RMC Shipyard in Finland and the Procurement Manager Projects will work very closely with the shipyard representative in relation to both the procurement of local materials and content, timing, quality and logistics of the delivery of materials and content. ", "  ", "Experience", "  ", "Spirit of Tasmania is open to the specific experience and background someone may bring, provided you possess the necessary senior procurement skills and bring a strong knowledge of Tasmanian industry.", "  ", "In addition to procurement expertise, you will bring experience with supply chain/logistics and strong commercial acumen.", "  ", "A background or experience in heavy industry, maritime, engineering or large hospitality is desirable but not essential.", "  ", "Application Process", "  ", "To request more information please email ", "joanne@redgiant.com.au", " or for a confidential discussion, please contact Joanne Inches on ", "0408 331 311", ".", "  ", "Applications close 9am Monday 7th June 2021.", "  ", "Applications are to be submitted to ", "joanne@redgiant.com.au", " or ", "info@redgiant.com.au", "  ", "DO NOT submit applications via any online sites."], "url": "https://www.seek.com.au/job/52337213?type=standout#searchRequestToken=1e662ff9-c532-4f0a-8448-70ce0a5e8761"},
{"search": "Data Analyst", "job_title": "Senior Lecturer in Southern Ocean Vertebrate Ecology", "company": "University of Tasmania", "location_1": "Hobart", "location_2": "Education & Training", "sector_1": "Education & Training", "sector_2": "Other", "work_type": "Full Time", "salary": null, "desc": ["Lecturer/Senior Lecturer in Southern Ocean Vertebrate Ecology", "\n", "\n", "Full time ongoing position.", "\n", "Based in Hobart.", "\n", "Make a strong contribution to the University as an innovative scientist and educator in our vertebrate ecology team.", "\n", "\n", "The Institute for Marine and Antarctic Studies (IMAS) is a centre of excellence for both research and education with world-leading research strengths in Oceanography, Fisheries and Aquaculture, Marine Ecology and Biodiversity, and Southern Ocean and Antarctic sciences.", "\n", "The Opportunity ", "\n", "We are looking for an innovative scientist and educator tasked with research and undergraduate and graduate level teaching. As the Lecturer/Senior Lecturer you will develop a multidisciplinary research and teaching program focused on the ecology of marine vertebrates including critical concerns regarding anthropogenic and climate change interactions in the Antarctic region.", "\n", "Key Accountabilities:", "\n", "\n", "Contribute to the University in achieving strategic objectives and operational responsibilities.", "\n", "Undertake high-quality research of national and international standing, secure external competitive funding, publish research findings and successfully supervise research higher degree students to completion, in order to meet and regularly exceed the University’s research performance expectations for Level B/C.", "\n", "Undertake scholarly undergraduate (and if relevant postgraduate) coursework teaching.", "\n", "Increasingly provide academic leadership, particularly in fostering outstanding research and/or learning and teaching.", "\n", "Contribute to the development and maintenance of productive and effective links inside the University.­", "\n", "\n", "Your Application", "\n", "To be successful in the role, your application will need to demonstrate;", "\n", "\n", "A PhD in a relevant field.", "\n", "A strong record and commitment to research that has achieved national and preferably international recognition and made notable contributions to the field of marine mammal and seabird ecology or management.", "\n", "A capacity in quantitative ecology, with high level quantitative analysis and numerical modelling skills.", "\n", "A record of contributions to successful research higher degree supervision and completions.", "\n", "Experience and demonstrated achievement in University-level teaching and learning.", "\n", "Experience in marine biotelemetry is desirable.", "\n", "\n", "Remuneration", "\n", "Appointment to this role at Academic Level B will have a total remuneration package of up to $133,842 comprising base salary within the range of $98,537 to $114,395 plus 17% superannuation.", "\n", "Appointment to this role at Academic Level C will have a total remuneration package of up to $158,046 comprising base salary within the range of $118,946 to $135,082 plus 17% superannuation.", "\n", "How to Apply:", "\n", "\n", "To apply online, please provide your resume, cover letter outlining your suitability and motivation for the role, and your responses to the position/selection criteria.", "\n", "For further information about this position, please contact Catriona MacLeod, Principal Research Fellow/Head of Centre - Ecology & Biodiversity, ", "Catriona.Macleod@utas.edu.au", " or ", "(03) 6226 8237", ".", "\n", "Please visit ", "http://www.utas.edu.au/jobs/applying2", " for our guide to applying and details on the recruitment process.", "\n", "\n", "Applications close Tuesday, 29 June 2021, 11.55pm", "\n", " ", "Position Description - Lecturer Senior Lecturer in Southern Ocean Vertebrate Ecology.pdf", "\n", "To be eligible for this position, you are required to have Australian citizenship, permanent residence or a current valid visa that allows you to fulfill the requirements of this role."], "url": "https://www.seek.com.au/job/52427112?type=standout#searchRequestToken=1e662ff9-c532-4f0a-8448-70ce0a5e8761"},
{"search": "Data Analyst", "job_title": "Finance and Insurance Specialist", "company": "Co-Op Toyota", "location_1": "Hobart", "location_2": "Sales", "sector_1": "Sales", "sector_2": "Account & Relationship Management", "work_type": "Full Time", "salary": null, "desc": ["An exciting opportunity has become available at Co-Op Toyota.", "Toyota Australia’s current Dealer Of The Year!", "The successful candidate will be trained and mentored in all areas of vehicle Finance and Insurance.", "To be the successful candidate for this role, consider:", "Are you enthusiastic and friendly?", "Are you ambitious & optimistic?", "Do you have an eye for detail?", "Do you have a strong desire to make a meaningful contribution at work & be considered the hardest worker in the room?", "Previous experience in ", "Retail Sales or with Banking / Lending exposure", " is desirable but not essential. ", "To apply, please attach a current copy of your ", "resume and a cover letter ", "and email to ", "braden.mcgee@co-optoyota.com.au", "Applications close Friday 11th June 2021."], "url": "https://www.seek.com.au/job/52415478?type=standout#searchRequestToken=1e662ff9-c532-4f0a-8448-70ce0a5e8761"},
{"search": "Data Analyst", "job_title": "Management Accountant", "company": "Kinetic", "location_1": "Hobart", "location_2": "Accounting", "sector_1": "Accounting", "sector_2": "Management Accounting & Budgeting", "work_type": "Full Time", "salary": "$100,000 - $129,999", "desc": [" ", "Launceston, Tasmania based", " ", "Flexible/part-time work arrangement options available", " ", "Good role for first time mover from Chartered.", " ", "Progression opportunities into wider Group business available", " ", "Great opportunity to grow and develop business partnering and internal reporting. ", " ", " ", " ", "The Opportunity", " ", "This position is responsible for providing professional accounting input to the financial and management accounting functions of the business and / or related entities.", " ", " ", " ", "You will be involved in", " ", " ", "Produce monthly financial and management reports, including interpretation and analysis, by developing and maintaining appropriate reporting processes.", " ", "Contribute to the effective management of the company's cash flow through analysis of revenue and expenditure trends. Ensure that consultation and communication processes are established and effective.", " ", "Contribute to an effective business planning process by ensuring the availability of relevant financial data (current and historical) in areas such as revenue, expenditure and profitability.", " ", "Prepare and maintain accounting records to show details of revenue streams and expenditures and reconciliations.", " ", "Complete monthly BAS Statements and develop draft budgets.", " ", "Liaise with external auditors as necessary to facilitate and support external audit process.", " ", "Report on existing financial position and income streams, costs, anticipated costs and revenue based on past, present and future levels of activity.", " ", " ", " ", "The boxes you'll tick ", " ", " ", "Formal qualifications in Accountancy (CA / CPA).", " ", "Sound financial and management reporting skills.", " ", "Excellent communication and interpersonal skills with the ability to build rapport", " ", "Strong analytical skills and uses data to influence strategic decisions at the senior leadership level.", " ", "Self-motivated with a demonstrated enthusiastic approach to day-to-day business operations and positive approach to a continual changing work environment.", " ", "Strong computer literacy, MS Office (Word, Excel and PowerPoint) and high-level proficiency in excel (v-lookups, pivot tables).", " ", " ", " ", "The benefits of working with us", " ", " ", "Employment with Australasia's leading mass transit bus operator focusing on a positive culture and company values", " ", "Comprehensive Employee Assistance Program Including wellbeing, financial and nutritional coaching, counselling and legal advice", " ", " ", " ", "How You Apply", " ", "Kinetic is proud to be an Equal Opportunity Employer and our people represent the community which we service. We invite all suitably qualified applicants to apply, including Aboriginal and Torres Strait Islander people, and people from diverse social, cultural and gender backgrounds.", " ", "There has never been a better time to join Kinetic! So, if this sounds like you and you are ready for a challenging and rewarding career with Kinetic then:", " ", " ", "Click the 'Apply for this job' button", " ", "Complete your application with ", "your resume and cover letter addressing how you 'tick the boxes'", ". ", " ", "If successful you will need to complete a National Police Clearance Prior to commencement.", " ", " ", " ", "About us", " ", "Kinetic is Australasia's only dedicated mass transit bus operator, Kinetic, alongside some of the most recognisable names in bus transport including Australasian airport transit business SkyBus, New Zealand's largest bus operator Go Bus, iconic Gold Coast bus operator Surfside Buslines and Sydney's leading bus and coach charter company Telfords. Collectively Kinetic employs more than 4000 people and moves in excess of 50 million people every year. For more information visit https://wearekinetic.com/."], "url": "https://www.seek.com.au/job/52266929?type=standout#searchRequestToken=1e662ff9-c532-4f0a-8448-70ce0a5e8761"},
{"search": "Data Analyst", "job_title": "Information, Communication & Technology Manager", "company": "West Arnhem Regional Council", "location_1": "Hobart", "location_2": "Information & Communication Technology", "sector_1": "Information & Communication Technology", "sector_2": "Management", "work_type": "Full Time", "salary": null, "desc": ["Information, Communication & Technology Manager", " ", "Jabiru, NT  ", " ", "About our region", " ", "West Arnhem Regional Council covers an area of almost 50,000 km2 of stunning natural landscape in the western part of Arnhem Land, Northern Territory.", " ", "More than two thirds of the region’s population of just over 6,000 identify as Aboriginal Australians, who reside in a collection of towns, communities and outstations. Council provides a range of local government services to five towns and communities across four wards with many popular tourist destinations.", " ", " ", " ", "The role", " ", " ", " ", " is responsible for promoting operational excellence and identifying and implementing ICT technology and process improvement initiatives within the Council to enable the delivery of best practice and efficient services;", " ", " ", " ", " will drive and deploy business and ICT process improvement methodologies mindsets and toolkits across the Council;", " ", " ", " ", "will build capability through knowledge-sharing and training; and", " ", " ", " ", "support managers and staff in the implementation of new initiatives.", " ", " ", " ", " ", "About you", " ", " ", "Demonstrated experience in a senior management position leading a team of ICT professionals to deliver exceptional customer service and ICT solutions.", " ", "Extensive knowledge and expertise in ICT principles and practices including: ", " ", " PC architecture, components, configuration and peripherals;", " ", " network technologies; and", " ", " Microsoft network, operating systems, and applications..", " ", " ", " ", " ", " ", "You will receive:", " ", " ", "Executive Remuneration Package", " ", "6 weeks annual leave", " ", "12.5% superannuation", " ", "Remote locality allowance", " ", "Relocation assistance", " ", "Laptop", " ", "Phone allowance", " ", "Free uniforms", " ", "Furnished accommodation", " ", "Employee Assistance Program", " ", "Heavily subsidies rent", " ", " ", " ", "HOW TO APPLY", " ", "Please visit our website to download the position description.", " ", "All applications must be submitted online via our website:   ", "https://www.westarnhem.nt.gov.au/employment", " ", "Applications should address the selection criteria as outlined in the position description. Please note that applications that do not address the selection criteria may not be considered.", " ", "Should you require further assistance, please phone", "(08) 8979 9404", " or email ", "vacancy@westarnhem.nt.gov.au", ".", " ", " ", " ", "You must have the ", "right to live and work in Australia ", "to apply for this job.", " ", " "], "url": "https://www.seek.com.au/job/52563822?type=standout#searchRequestToken=1e662ff9-c532-4f0a-8448-70ce0a5e8761"},
{"search": "Data Analyst", "job_title": "Communications Cabler/Technician, Data cabling", "company": "TCS Tas Holdings Pty Ltd", "location_1": "Launceston & North East", "location_2": "Information & Communication Technology", "sector_1": "Information & Communication Technology", "sector_2": "Telecommunications", "work_type": "Full Time", "salary": null, "desc": ["Telephone & Communication Services (TCS TAS) is seeking a motivated individual with the ability to work unsupervised, with a positive attitude towards learning, and an aptitude for expanding their existing technical skillset. A full-time position is available. Position available for immediate start.", "Telephone & Communication Services is a Tasmanian owned, State-Wide company that provides end to end capability from customer contact to field based installation and maintenance services across an extensive range of clients", "The ideal applicant must have one or more of the following technologies experiences:", "Hold a current Open Cablers Licence, preferred endorsements Structured and Fibre Optics.", "Minimum of 2 years of industry experience within the communications, electrical, or Security industry.", "Have a working knowledge of IT networks:  fibre optic, wireless, 4G.", "PABX and security/CCTV systems experience an advantage", "Have excellent safety awareness and meticulous attention to detail to maintain a high standard of workmanship.", "Can pass a security clearance check", "Hold a current driver's licence ", " ", "- The remuneration package discussed in the interview.", "Please forward resume to  ", "info@tcstas.com.au", " [link removed]", " ", " "], "url": "https://www.seek.com.au/job/52473411?type=standard#searchRequestToken=1e662ff9-c532-4f0a-8448-70ce0a5e8761"},
{"search": "Data Analyst", "job_title": "Project Officer", "company": "OneCare Limited", "location_1": "Hobart", "location_2": "Information & Communication Technology", "sector_1": "Information & Communication Technology", "sector_2": "Programme & Project Management", "work_type": "Full Time", "salary": null, "desc": ["Who we are", "OneCare is a not-for-profit aged care organization, founded on the principles of compassion, respect and dignity for the individual. We take a holistic approach to the provision of our services, treating each resident and consumer as a ‘whole person’ with regard to the design and delivery of their individual care and well-being. We have a rich history and have been providing residential aged care for more than 40 years.", " ", " ", " ", "What do we need", "An experienced Project Officer to assist design, develop and implement a range of corporate services (HR, IT & Finance) projects. Each project is aligned to OneCare’s strategic plan with a focus on customer service and continuous improvement.  ", "This role is permanent full time (0.8 FTE will be considered)", " ", "Reporting to the Executive Manager People and Systems you will:", " ", " ", "Support the Executive team design, develop and implement projects linked to Strategic Plan goals that address and enable best practise.", " ", "Develop and deliver comprehensive project supports and resources to assist with the successful implementation of improvements.", " ", "Develop and maintain collaborative and durable relationships with key internal and external stakeholders, identifying obstacles, resolving differences and cultivating commitment to strategic system improvement.", " ", "Skills and experience required:", " ", " ", "Tertiary level qualifications in business, information technology, human resources or similar field, plus 2+ years experience in a similar role.", " ", "Sound knowledge of contemporary project management, along with a proven experience in supporting the delivery of projects in-line with project plans.", " ", "Demonstrated system implementation experience, plus sound knowledge of process re-engineering or process mapping.", " ", "Strong problem-solving skills along with the ability to seek all relevant information; analyse that information from different perspectives and making recommendations based on the available information.", " ", "High level interpersonal, verbal and written communication skills including consultation, presentation and negotiation.", " ", "Demonstrated commitment to a team approach together with capacity to exercise initiative, flexibility, innovation and self-motivation.", " ", "Current valid Tasmania’s driver’s license (some intra-state travel required)", " ", " ", " ", "Working with Us", "Here at OneCare, we care deeply about our residents, our staff and the jobs we do each day. Our workplace is caring, supportive and down to earth. As a values-led consumer focused business, OneCare offers a rewarding work environment where you will be able to contribute meaningfully and will see the results of your efforts. ", " ", "We offer competitive remuneration with access to not-for-profit salary packaging.", " ", "To apply please submit your Cover Letter and Resume through SEEK. ", " ", "Applications close 9am Monday 14 June 2021.  For the position description please email ", "HR@onecare.org.au", ". If you would like to discuss the role please contact Natalie Neilson, Executive Manager People and Systems by phone: ", "6220 1200", " or email: ", "Natalie.Neilson@onecare.org.au", " ", "A current National Police Check and a Working with Vulnerable People Employment Check is an essential requirement to work at OneCare.  "], "url": "https://www.seek.com.au/job/52428150?type=standout#searchRequestToken=1e662ff9-c532-4f0a-8448-70ce0a5e8761"},
{"search": "Data Analyst", "job_title": "Principal Consultant (Advisory)", "company": "The Project Lab", "location_1": "Hobart", "location_2": "Consulting & Strategy", "sector_1": "Consulting & Strategy", "sector_2": "Other", "work_type": "Full Time", "salary": null, "desc": ["About the Business", "The Project Lab is a consulting and advisory firm that bases its services on management consulting principles. We help our clients ", "build and grow", "; ", "understand", "; and ", "change", " their organisations to ensure they are high performing and remain sustainable, compliant and relevant. Our core focus is on the outcome regardless of what service we are providing, or how it is being provided e.g., solving complex problems, identifying opportunities for growth, ensuring compliance, or guiding through change. ", "For further information about The Project Lab visit www.theprojectlab.com.", "About the Role", "Based in Hobart, this role is responsible for supporting the growth across the business. This role falls under the direction of Head of Growth and works closely with our growth team, staff and consultants to ensure our services are client focussed and there is a continuous pipeline of work.", "This exciting role is an opportunity to work collaboratively with a dynamic team to make a contribution to growth of the Project Lab and expand our positive impact on the Tasmanian community.", "About You", "You have a demonstrated passion for understanding how and why businesses and markets work, with a desire to influence positive change. You are experienced in running a successful business (including working for yourself) and have background in leadership and collaborative team engagements. You have a strong professional network, established over time based on trusted and demonstrated capability.  ", "You are highly competent and successfully work autonomously. You have demonstrated experience in both building, and working with dynamic and cross-disciplinary teams. You can think on your feet, know when and how to resolve a problem, and don’t shy away from challenging situations. You demonstrate advanced people skills, actively listen, encourage others, convey reliable facts and build rapport in difficult situations to achieve the vision. ", "You have post-graduate qualifications/certifications in either Business, Finance, Consulting, IT or Engineering and a minimum 7 years’ experience in business or management consulting, business analysis or a related field. ", "How to find out more and apply:", "Head to: www.theprojectlab.com/careers/principal-consultant-advisory", "We look for attention to detail and those who follow instructions!", "All applications will be treated as private and confidential. Unsolicited applications will be disregarded."], "url": "https://www.seek.com.au/job/52366170?type=standout#searchRequestToken=1e662ff9-c532-4f0a-8448-70ce0a5e8761"},
{"search": "Data Analyst", "job_title": "Technical Specialist - Space Weather Network", "company": "Bureau Of Meteorology", "location_1": "Hobart", "location_2": "Government & Defence", "sector_1": "Government & Defence", "sector_2": "Government - Federal", "work_type": "Full Time", "salary": "$80,665 - $91,713", "desc": ["The Bureau of Meteorology is seeking a dedicated, highly talented professional to fill the role of Technical Specialist, in the National Observing Operations (NOO) Space Weather Network Operations (SWN) Team. The successful applicant will be integral in ensuring the SWN team is meeting its program objectives including acting as a liaison with stakeholder groups on technical aspects of the observing network, review and contribute to working documentation, prepare and deliver reports and provide technical expertise on business development opportunities in line with the Bureau's strategy.", " ", "  ", "The NOO SWN team sits within the Bureau's Data & Digital Group and is primarily responsible for providing operational support to a broad range of specialist infrastructure (both remotely and locally) at several sites across Australia and its Territories. The observing network features instruments and sensors, which include: Ionospheric radars (ionosondes), Magnetometers, Scintillation (Total Electron Content) monitors, Solar Optical and Radio sensors, Riometers, Aurora monitors and Neutron monitors. Observations are combined with data from satellites and other sources to monitor space weather and provide the national services and advice on space weather conditions.", " ", "  ", "To operate effectively as a Technical Officer (TO4) you will undertake moderate to very complex operational and network support tasks whilst working under the general guidance of the Manager, SWN Operations. These tasks will include the coordination of resources for maintenance, inspections and return to service of sophisticated technologies, advanced system diagnostics and fault finding; technical administration, facilitate knowledge sharing and provide support to teams working in remote environments to encourage a network-wide consistent approach to practices and system.", " ", "  ", "Our ideal candidate will have a strong radio/electronics and data communications background."], "url": "https://www.seek.com.au/job/52400850?type=standout#searchRequestToken=1e662ff9-c532-4f0a-8448-70ce0a5e8761"},
{"search": "Data Analyst", "job_title": "Project Officer", "company": "Volunteering Tasmania Inc", "location_1": "Hobart", "location_2": "Community Services & Development", "sector_1": "Community Services & Development", "sector_2": "Other", "work_type": "Full Time", "salary": "Schads Award Level 5 ", "desc": ["Project Officer ", "0.8 – 1.0 FTE | SCHADS Level 5", "Location: ", "although our Head Office is in North Hobart, this role can be performed anywhere within Tasmania by negotiation. ", "Volunteering Tasmania is the Peak Body for Volunteering in Tasmania. We support people to engage with volunteering and support the volunteering sector in best-practice volunteer management. We advocate strongly for our sector and develop policy positions and respond to government policy and initiatives to give voice to volunteers and the volunteer sector. Volunteering Tasmania supports research and evidence-based decision-making in volunteering in Tasmania.", "Our Vision:", " The contribution of volunteering is understood, respected and valued as a powerful driver of community prosperity and inclusion in Tasmania.", "Our Purpose: ", "We connect and build an inclusive community to make a difference through the impact of volunteering.", "Our Values:", " be informed, be inspired, be connected, make a difference.", "This position will provide the operational support to the areas as outlined above to ensure the successful delivery of Volunteering Tasmania Volunteering Awards, EV CREW and CPD Program as well as sector development activities.  ", "Selection Criteria", "Qualifications, Skills and Experience", "At least 3 years’ experience delivering campaigns and/or management of projects.", "Ability to undertake significant projects and/or functions involving the use of analytical skills.", "High-level verbal communications skills, including experience presenting to groups.", "Strong interpersonal skills with proven experience in relationship building and management among stakeholders from diverse cultures, professions, ages, and needs.", "Ability to manage competing projects and adapt to shifting priorities within a face-paced work environment.", "Proven ability to work autonomously and remotely, as well as part of a team.", "High level of initiative, problem solving and risk mitigation and a ‘can do’ attitude.", "Desirable Attributes", "A knowledge of Emergency Management", "A passion for volunteering", "APPLICATION INSTRUCTIONS", "Applications close Thursday 8th July 2021, 5pm. ", "Do NOT click ‘Apply Now’. Follow the instructions below to apply.", "In the first instance, please email team@volunteeringtas.org.au [link removed], using the subject line: ", "Project Officer enquiry via SEEK ", "to request a Position Description.", "To apply, email KateC@volunteeringtas.org.au [link removed]", "Applications must include a cover letter addressing all selection criteria in the PD (no more than 3 pages) and a separate CV.", " "], "url": "https://www.seek.com.au/job/52573135?type=standard#searchRequestToken=1e662ff9-c532-4f0a-8448-70ce0a5e8761"},
{"search": "Data Analyst", "job_title": "Business Consultant (Advisory)", "company": "The Project Lab", "location_1": "Launceston & North East", "location_2": "Consulting & Strategy", "sector_1": "Consulting & Strategy", "sector_2": "Management & Change Consulting", "work_type": "Full Time", "salary": null, "desc": ["About the Business", "The Project Lab is a consulting and advisory firm that bases its services on management consulting principles. We help our clients ", "build and grow", "; ", "understand", "; and ", "change", " their organisations to ensure they are high performing and remain sustainable, compliant and relevant. Our core focus is on the outcome regardless of what service we are providing, or how it is being provided e.g., solving complex problems, identifying opportunities for growth, ensuring compliance, or guiding through change. ", "For further information about The Project Lab visit www.theprojectlab.com.", "About the Role", "Based in Launceston or Hobart, this role responsible for helping Tasmanian businesses succeed, and support the growth of the business within the SMB sector in Tasmania. This role falls under the direction of Head of Growth, working closely with our growth team, staff and consultants to ensure our services are client focussed and there is a continuous pipeline of work from the SMB sector. ", "This exciting role is an opportunity to work with small businesses and make a positive difference to the Tasmanian community.", "About You", "You have a passion for understanding how and why businesses work, with a desire to influence positive change using your experience to provide the timely, defensible advice to enable the growth and development of small business clients. You understand the opportunities for businesses that can have a well-articulated conversation about risk in the current environment.", "You can work autonomously or as part of a team to ensure consistent, high-quality service delivery of simultaneous projects/programs of work. Your passion for the small business sector, experience and empathy enable you to assist a wide range of clients to achieve tangible results, and your reputation within the Tasmanian business community is evidence of your ability to achieve this. ", "You have post-graduate qualifications/certification in Business, Finance, Risk, Management Consulting, IT, Engineering or Technology, and demonstrated experience working with small businesses.", "How to find out more and apply:", "Head to: www.theprojectlab.com/careers/advisory-business-consultant", "We look for attention to detail and those who follow instructions!", "All applications will be treated as private and confidential. Unsolicited applications will be disregarded.", " "], "url": "https://www.seek.com.au/job/52378144?type=standout#searchRequestToken=1e662ff9-c532-4f0a-8448-70ce0a5e8761"},
{"search": "Data Analyst", "job_title": "Senior Project Officer - APS 6", "company": "Adecco", "location_1": "Hobart", "location_2": "Government & Defence", "sector_1": "Government & Defence", "sector_2": "Government - Federal", "work_type": "Contract/Temp", "salary": null, "desc": ["We are looking for a Senior Project Officer - APS6 to work with our Federal Government client based in their Hobart Office.", "The Senior Project Officer supports Assistant Directors and State Managers in the day to day management and delivery of projects relating to the conduct of the Electoral Event. ", "Client Details", "The role of our Federal Government client is to maintain an impartial and independent electoral system for eligible voters through active Electoral roll management, efficient delivery of polling services and targeted educations and public awareness programs.", "Description", "The Senior Project Officer supports Assistant Directors and State Managers in the day to day management and delivery of projects relating to the conduct of the Electoral Event. ", "During the electoral event, the role will undertake work with independence under limited direction, utilising functional expertise within the area of project management as agency priorities necessitate.", "Key position responsibilities ", "Assist to ensure the agency satisfies its legislative obligations under the ", "Commonwealth Electoral Act 1918 (Cth)", " in relation to the delivery of an Electoral Event.", "Contribute to and/or manage a range of time sensitive, large scale projects to modernise and shape the delivery of an Electoral Event, while ensuring high quality project outcomes are delivered on budget and using evidence based decision making which is robust under public scrutiny.", "Manage priorities, monitor progress, conduct quality assurance activities, and ensure quality outcomes, to deliver required project deliverables for the agency, ensuring current and future agency and stakeholder needs are addressed.", "Provide analysis on complex issues and contribute to the management, preparation, and coordination of policy formulation and/or project management.", "May be required to supervise a team to ensure high quality outputs, including the development of team members at lower classifications, building team capacity, and encouraging career development.", "Develop and support key internal and external relationships, including managing stakeholders to achieve work area and agency goals. In addition, represent the agency by promoting its interests in various forums.", "Provide accurate specialist advice, guidance and reporting on functional responsibilities.", "Make and communicate decisions, governed by legislation, regulations, best practice principles or relevant operating instructions and procedures.", "Perform additional duties or assume responsibility of functions as directed from time to time", "Profile", "The successful candidate must be an Australian Citizen and maintain Political neutrality throughout the Assignment.", "Mandatory", "Knowledge and experience in the effective management and delivery of large scale projects within a highly operational and legislated environment. ", "Ability to undertake risk management and assessment within a project management and delivery environment.", "Experience in successfully setting priorities and delivering quality results on time and on budget.", "Proven ability to communicate effectively whilst anticipating stakeholder needs and expectations across a geographically dispersed network.", "Proven analytical abilities with the ability to propose and facilitate change and contribute to business improvement strategies. ", "Demonstrated ability to manage staff while developing capabilities, encouraging career development and promoting professionalism. ", "Sound judgement with an ability to make informed decisions.", "Demonstrated personal integrity whilst achieving results within legislative and policy parameters.", "Desirable", "Relevant tertiary qualifications in project management, management, business, public administration or similar.", "Job Offer", "3 month contract with possibility of extension", "Candidates will be required to complete and pass a Police check and Citizenship check", "Adecco and Our Client are equal opportunity employers. As part of our commitment to creating a diverse and inclusive workplace, Aboriginal and Torres Strait Islander people are encouraged to apply."], "url": "https://www.seek.com.au/job/52450101?type=standout#searchRequestToken=1e662ff9-c532-4f0a-8448-70ce0a5e8761"},
{"search": "Data Analyst", "job_title": "Digital Account Director", "company": "The20", "location_1": "Hobart", "location_2": "Marketing & Communications", "sector_1": "Marketing & Communications", "sector_2": "Digital & Search Marketing", "work_type": "Full Time", "salary": null, "desc": ["A creative agency located in Hobart, The20 is evolving and growing. It’s an exciting time for us as we define and articulate our difference. Our people are everything, and we’re after someone who’ll fit seamlessly into our culture. Someone who’s invested in our future. Someone who understands that our place is our strength. Someone who holds and values the truth above everything.", " ", "The Role", "As Digital Account Director you’ll drive our digital business to new levels.", "Even though you’ll be employed by The20, you’ll be directly integrated into the OMD business and brand – a joint relationship that exists uniquely within Tasmania. ", "Your primary role is to grow our digital business for both new and existing clients. You’ll demonstrate an understanding of a client’s business and deliver a service that is both effective and compelling. This includes being responsible for the development and presentation of strategic digital marketing activity.", " ", "Essential skills and experience", "Digital marketing experience across all digital media channels", "Proven competence in creating strategic and effective digital media strategies, and the ability to implement them", "A clear understanding of excellent creative craft in digital", "Agency experience – particularly in working with creatives to guide big ideas in digital contexts", "Experience working with digital ad tech and ops, including ad serving (DCM), data visualisation, conversion rate optimisation, activating CRM audiences, tag management and website analytics ", " ", "To find out more about this role, email Matt Fishburn at ", "matt@the20.com.au", ", otherwise send your application to ", "careers@the20.com.au", " by noon on Monday 14 June and include all the obvious things and most importantly, a cover letter."], "url": "https://www.seek.com.au/job/52411352?type=standard#searchRequestToken=6e7f244f-dbd0-4835-9acd-d27e785b8804"},
{"search": "Data Analyst", "job_title": "Cloud Platform Administrator ", "company": "Aurec", "location_1": "Hobart", "location_2": "Information & Communication Technology", "sector_1": "Information & Communication Technology", "sector_2": "Database Development & Administration", "work_type": "Contract/Temp", "salary": null, "desc": ["We are looking to engage a skilled and enthusiastic ", "Cloud Platform Administrator ", "to join our Federal Government client! The perfect candidate will have ", "excellent communication skills", " and have the ability to work ", "honestly and collaboratively", " within their team.", " ", "You will have an opportunity to ", "make a strong difference", " throughout this ", "12 month contract with a 12 month extension offered ", "and we are willing to consider ", "Australian Citizens ", "for this role.", " ", "Role / Responsibilities:", "Manage and Operate cloud infrastructure solutions.", "Be responsible for one or more Cloud Service components as a specialist.", "Ensure the group's data platforms are well maintained, optimised, secure and stable.", "Level 2 end user support, system maintenance, triage and troubleshooting across one or more Cloud Service components.", "Support and maintain operation of unified communications and collaboration using Microsoft Office 365 services such as Teams, SharePoint Online, and other systems as required.", "Continual improvement of customer environments and toolsets.", "Escalation & advanced troubleshooting across key technologies.", "Foster a positive culture within the Service Operations team aligned with Agency values.", "Build and maintain effective working relationships with internal and external stakeholders.", " ", "Skills and Experience:", "Proven experience, of greater than 3 years, in a Cloud technical support role.", "Experience in Microsoft Azure or Amazon Web Services, preferably both.", "Recent experience in and knowledge of contemporary ICT management and governance. frameworks and methodologies (ITL, COBIT, TOGAF)", "Proven ability to work through, and progress, work issues with limited direction.", "Proven ability to define successful new product requirements and implementation strategies.", "Experience working in Government or providing services to Government agency.", " ", " ", "Australian Citizens will be considered for this role.", " ", " ", "To be considered for these roles, ", "APPLY", " to this advertisement or contact ", "VAUGHAN", " on ", "02 5109 0913"], "url": "https://www.seek.com.au/job/52497817?type=standard#searchRequestToken=1e662ff9-c532-4f0a-8448-70ce0a5e8761"},
{"search": "Data Analyst", "job_title": "Marketing Officer", "company": "The District Nurses", "location_1": "Hobart", "location_2": "Marketing & Communications", "sector_1": "Marketing & Communications", "sector_2": "Marketing Communications", "work_type": "Part Time", "salary": null, "desc": ["The District Nurses (TDN) has been delivering in home community health care to Tasmanians for over 120 years, maintaining a primary healthcare focus in all of our services.  We are a not for profit, charitable organisation that is not affiliated with any residential aged care service or religious organisation.", "Our dedicated team of nurses and support workers provide clinical, emotional and social support for vulnerable members of our community.  We provide Commonwealth and State subsidised services, home care packages, private and brokered services as well as on site clinical services at our Moonah facility.  ", "TDN is looking for a creative, innovative and forward thinker to join our growing organisation, based at our Moonah head office.  ", "About the Role", "Reporting to the Chief Executive Officer, the Marketing Officer will be responsible for;", "Coordinating TDN's brand strategy", "Marketing, public relations and business development", "Key resource on critical incident, internal and external communication strategies, including social media platforms", "Preparation and coordination of marketing budget", "About You", "As an experienced marketing professional, you will use your wealth of experience to deliver and coordinate marketing initiatives in the context of a not for profit organisation and be able to demonstrate the following skills and experience; ", "Tertiary qualifications in marketing or related discipline", "Ability to develop and maintain key internal and external relationships and networks", "Comprehensive corporate communications and public relations experience", "Advanced technology skills in MS Office suite, google analytics, AdWords and data visualisation.", "It is essential that you can demonstrate evidence of the following;", "National Police Conviction Check", "Current Tasmanian Drivers license", "Working with vulnerable people card (employee)", "*Willing to undertake a pre-employment medical", "How to Apply", "For a copy of the Position Description, please visit our website;", "http://thedistrictnurses.org.au/careers/", "All applications are to be submitted via SEEK, and must include a resume and a cover letter which addresses each individual selection criteria.", "For more information on this position, please contact Sally Faulkner, Chief Executive Officer on ", "p", " ", "6208 0500", " or ", "e", " ", "sfaulkner@thedistrictnurses.org.au", "Applications Close 9am Tuesday 15th June 2021"], "url": "https://www.seek.com.au/job/52427110?type=standout#searchRequestToken=6e7f244f-dbd0-4835-9acd-d27e785b8804"},
{"search": "Data Analyst", "job_title": "Software Developer", "company": "Aquatic Informatics Inc", "location_1": "Hobart", "location_2": "Information & Communication Technology", "sector_1": "Information & Communication Technology", "sector_2": "Developers/Programmers", "work_type": "Full Time", "salary": null, "desc": ["Please apply on our website:", "https://danaher.wd1.myworkdayjobs.com/HachJobs/job/Hobart-Tasmania-Australia/Aquatic-Informatics---Software-Developer_R1144028-1", " ", "About Our Company", "Aquatic Informatics: A wholly owned subsidiary of the Water Platform of Danaher Corporation (NYSE: DHR), Aquatic Informatics (https://aquaticinformatics.com/) is a mission-driven software company that organizes the world’s water data to make it accessible and useful. We provide software solutions that address critical water data management, analytics, and compliance challenges for the rapidly growing water industry. Water monitoring agencies worldwide trust us to acquire, process, model, and publish water information in real time. We offer a full range of solutions, from standalone software packages for individual users, hosted software services, and enterprise-wide national systems. We serve over 1,000 municipal, federal, state/provincial, hydropower, mining, academic, and consulting organizations in over 60 countries that collect, manage, and process large volumes of water data.", " ", "Aquatic Informatics is headquartered in Vancouver, Canada and has offices in the US and Australia. We value independent thinking, initiative, teamwork, a relentless pursuit of quality, a playful spirit, and a sense of humour. We like smart people – IQ and EQ – who care about the environment and want to do good in the world.", "If you want a meaningful role with a company that is making a real difference in one of the most important resources in the world: water, then join our energetic growing team. Help us revolutionize an industry!", " ", "About the Opportunity", "The Software Developer is a key member within the Agile team, contributing to Scrum team health and continuous improvement of our software development process, participating in design and development of any Aquatic Informatics product and contributing strong software development technical skills especially in .NET, C#, HTML, CSS and JS.", "Responsibilities:", "Participate in the development of Aquatic Informatics software products.", "Key contributing member within the software development team.", "Perform architectural and object-oriented design, code review and implementation.", "Participate in effort and complexity estimation for new/ proposed product features and tasks.", "Continuous research to keep up with new technologies and best practices.", "Assist in effectively diagnosing and troubleshooting problems with the product.", " ", "Qualifications", "Education:", "Post-secondary degree/diploma in Computer Science or equivalent combination of education & experience.", "Experience:", "Real experience (at least 3 years) with large design efforts, enterprise level deployment, and 3-tier architecture.", "Microsoft development expertise: .NET, C#, and related technologies.", "Experience with Angular, React, Vue or similar frameworks.", "Demonstrated expertise with source control (Git).", "Experience with Agile and Test Driven Development.", "Cloud computing environments and continuous delivery.", "Experience with Visual Studio and related development tools.", "Proven results with database design and development for Postgres and SQL Server an asset.", "Skills:", "Self-starter with excellent design and analysis skills.", "Ability to work effectively both independently and as a member of the Agile team.", "Outstanding English communication skills both written and verbal.", "Ability to establish work priorities, effectively multi-task and balance varying demands.", "Dedication to keeping up to date with current trends and best practices."], "url": "https://www.seek.com.au/job/52301828?type=standard#searchRequestToken=6e7f244f-dbd0-4835-9acd-d27e785b8804"},
{"search": "Data Analyst", "job_title": "Content Creator", "company": "Catholic Education Tasmania", "location_1": "Hobart", "location_2": "Marketing & Communications", "sector_1": "Marketing & Communications", "sector_2": "Marketing Communications", "work_type": "Full Time", "salary": null, "desc": ["The Tasmanian Catholic Education Office (TCEO) is seeking applications from suitably qualified and experienced candidates who are able to demonstrate a commitment to the aims and philosophy of Catholic Education for the following position to be based at our New Town office.", "\n", "Content Creator", "\n", "Ongoing, Full-time", "\n", "This full-time, ongoing position will report to the Marketing and Communications Officer and will be required to demonstrate:", "\n", "\n", "Ability to liaise with relevant stakeholders to research, develop and produce a range of written and visual content for internal and external audiences.", "\n", "Experience conducting keyword research and developing SEO-friendly web content.", "\n", "Ability to analyse, track and report on content performance using website and social media analytics.", "\n", "Discretion and high-level communication skills.", "\n", "Commitment to personal and team effectiveness.\u2028\u2028", "\n", "\n", "The successful candidate will hold a Certificate IV in a relevant field and/or demonstrate sound experience in the creation and delivery of engaging and inspiring content across a range of channels.", "\n", "Salary will be commensurate with qualifications and experience and in accordance with the Tasmanian Catholic Education Single Enterprise Agreement 2018. \u2028", "\n", "CET supports the rights of children and young people and is committed to providing a safe and supportive environment directed at ensuring their safety and wellbeing.  The successful candidate will require satisfactory registrations relevant to child safety.", "\n", "We demonstrate our commitment to reconciliation by encouraging Aboriginal and Torres Strait Islander peoples to apply.", "\n", "Application Package Content Creator", "\n", "Applications close: Monday 21 June 2021 at 3:00pm", "\n", "Apply Now"], "url": "https://www.seek.com.au/job/52509594?type=standout#searchRequestToken=6e7f244f-dbd0-4835-9acd-d27e785b8804"},
{"search": "Data Analyst", "job_title": "UI Designer", "company": "MyState Limited", "location_1": "Hobart", "location_2": "Design & Architecture", "sector_1": "Design & Architecture", "sector_2": "Web & Interaction Design", "work_type": "Contract/Temp", "salary": null, "desc": ["This is Us", "We’re MyState, the Human Way to Bank.", "In 2020 we took digital banking to a whole new level with the launch of our predictive analytics technology. We’re now embarking on the next phase of our digital transformation journey and are looking for an experienced, mid-level UI designer to join our team.", "This is the Role", "Working alongside our UX designer & developers you’ll be responsible for creating the look & feel of our new mobile app and internet banking platforms.", "This is an 18-month contract role. We’ve got a seat saved for you in Hobart, but if you’re the right person currently living on the ‘Big Island up north’ we’d still like to talk.", "You ", "must", " include a portfolio of your work with your CV. Applications without a portfolio will not be considered.", "·        Partner with our experienced team through the entire iterative design process, from discovery to launch (and then some) to produce beautiful and intuitive digital products", "·        Design experiences that are incredibly simple and feel amazing", "·        Work iteratively creating UI and visual design concepts to help define the product", "·        Collaborate with product leaders to research, identify and address key business/customer goals", "·        Work with our development teams to understand the implementation details and dependencies for visual designs", "·        Work with our QA teams to ensure designs are implemented correctly", "This is You ", "·        Brings 2-5 years’ experience designing UIs for mobile apps & web (show us your work!)", "·        Understands Android, iOS & responsive web design best practices", "·        Knowledgeable in fundamental design principles and the latest UI patterns and trends", "·        Is passionate and knowledgeable about apps, devices and the way humans use them", "·        Experienced working in agile teams", "·        An excellent communicator with a collaborative attitude", "·        Values accuracy and attention to detail", "This could also be you", "·        Prototyping skills", "·        Illustration / drawing skills", "·        Knowledge of UX research and usability testing methods", "·        Experience with branding / identity development", "·        Hobart based (or willing to move down, it is really amazing here)", "About us", "You might know us as Tasmania’s local bank MyState, however our group also includes TPT Wealth. Employing 350 people and offering products and services nationally, MyState Limited is growing in and outside of Tasmania!", "We’re one of the few banks in Australia to offer Apple, Google, Garmin, Fitbit, and Samsung Pay options to our customers and we’re one of the earliest adopters of PayID and the New Payment Platform. A digital bank driven by innovation, you’ll be joining us at an exciting time as we seek to continue to blaze a trail in modern day banking.", "To request a position description or for any further information, please contact ", "Recruitment@MyState.com.au", ". To apply, click “Apply Now” by Midnight 27 June, 2021", "Employment with MyState is subject to a Bankruptcy, Police and Credit check to verify your suitability to work within the finance sector. We are a 2021 Circle Back Initiative Employer – We commit to respond to every applicant."], "url": "https://www.seek.com.au/job/52535712?type=standard#searchRequestToken=6e7f244f-dbd0-4835-9acd-d27e785b8804"},
{"search": "Data Analyst", "job_title": "Senior Reporter", "company": "News Corp Australia", "location_1": "Hobart", "location_2": "Advertising, Arts & Media", "sector_1": "Advertising, Arts & Media", "sector_2": "Journalism & Writing", "work_type": "Full Time", "salary": null, "desc": ["The Role", "A fantastic opportunity is available for a journalist with energy and commitment to join the editorial team based in Hobart, Tasmania.  Reporting to the News Editor, you will be responsible for producing compelling regional journalism.", "As a reporter, you’ll either already have great local contacts or be quick to make them. You’ll have a nose for a great yarn and an understanding of what content will attract people subscribe to the Mercury or engage with our content more often. You are experienced in using data to back up your news sense.", "Most importantly you want to write content that will make a difference to readers of the Mercury and to Tasmanians in general.", "The Person", "The successful person will have at least some media experience.  You will have strong writing skills and a notebook full of story ideas.  You will be able to file at speed for digital and use analytics to respond to audience reaction to your stories. As a natural communicator and creative thinker, you will be enthusiastic and push the boundaries, always keeping the reader at the core of whatever you produce.", "The Company", "News Corp Australia is the nation's largest media company operating more than 150 household name brands across print, digital and multimedia including the Mercury, The Herald Sun,", " ", "The Australian and news.com.au. We are proud to be a central part of News Corp, a leading global network of powerful brands in news and information services, sports programming in Australia, digital real estate services, book publishing, digital education and pay-TV distribution in Australia including Fox Sports, Dow Jones, Harper Collins, Realestate.com.au and The Wall Street Journal.", "Join Us", "The lifestyle in Tasmania is the envy of Australia. Hobart is a vibrant yet laidback city with an amazing array of restaurants, bars and events, as well as being on the doorstep of some of the world’s most awe-inspiring natural experiences. The Mercury newsroom is a supportive and friendly place, full of people passionate about the work that they do.", "News Corp Australia is evolving in response to the expectations and challenges of the digital world in which we now live. We have an amazing opportunity to reinvent our industry and redefine the future of media in Australia. We are passionate about what we do and proud of our heritage of world-class journalism and entrepreneurial spirit. If you thrive on being challenged and enjoy working in a fast-paced stimulating environment, come and join us on this incredible journey.", "For more information on careers at News Corp Australia visit: www.newscorpaustralia.com/careers"], "url": "https://www.seek.com.au/job/52582981?type=standout#searchRequestToken=6e7f244f-dbd0-4835-9acd-d27e785b8804"},
{"search": "Data Analyst", "job_title": "Project & Compliance Officer", "company": "Tasracing", "location_1": "Hobart", "location_2": "Administration & Office Support", "sector_1": "Administration & Office Support", "sector_2": "Other", "work_type": "Full Time", "salary": "$70,000 - $79,999", "desc": ["Reporting to the Project & Facilities Manager, the Project & Compliance Officer is responsible for assisting the Project & Facilities Manager in the areas of project management, contract management, asset management and compliancy.  The Project & Compliance Officer will have a strong knowledge of Workplace Health & Safety legislation and the ability to implement policies and procedures. ", " ", "Key Responsibilities", " ", "Project and contract Management", "Assist in the full life cycle of project management and contract management including stakeholder management", "Co-ordination of contractors for projects and day-to day general maintenance issues.", "Assist in the preparation of Board papers as required", " ", " ", " ", "Compliance Management", "Provide assistance to the Assets & Facilities team relating to compliance measures and local regulations.", "Liaise with other legislative bodies or agencies as required", "Keeping abreast of all regulatory changes and communicating internally how they impact on existing processes and procedures", "Maintain compliancy records provided by contractors for building works and scheduled maintenance", "Prepare & coordinate lease agreements and maintenance of stable blocks across the state", "Maintain and update Tasracing’s asset register for all venues including entry and maintenance in accordance with Tasracing’s legislative obligations", "Agree and establish life cycle reporting and measurement systems", "Attend toolbox meetings as required", " ", " ", " ", "Administration Support and Reporting", "Undertake research and administration work as directed", "Attend project meetings for minute taking and assistance as required", "Report maintenance requirements and seek to rectify as required in consultation with the team", "Organise contractors as required", "Ensure contractors have completed inductions", "Record contractor documentation, insurances as required", " ", " ", " ", "Workplace Health and Safety", "Support the broader Project & Facilities team to achieve legislative compliance with WHS initiatives, programs, policies, and guidelines", "Assist in the development of Workplace Health & Safety policies, procedures, and documentation", "Maintain documentation for the essential safety measures logbook for quarterly auditing across all sites", "Ensure all employees and contractors in the north and south of the state complete Tasracing’s Safety Induction prior to commencing work in collaboration with the People & Culture Manager", "Ensure all workers comply with Tasracing’s WHS framework including JSA’s, hazard and incident reporting requirements pertaining to activities and venues in the north and south of the state", "Conduct safety audits regularly on all sites and facilitate hazard identification and accident prevention programs when directed", "Maintain contemporary understanding of WHS obligations and legislation and ensure Tasracing meets these obligations at all sites", "Provide data to the Project & Facilities Manager when requested on WHS incidents and initiatives", "Ensure Incident Reporting Forms are completed accurately following an incident or near miss", "Review, manage and prepare standard operating procedures", " ", "Minimum Qualifications and Experience ", " ", "Certificate IV in Workplace Health & Safety", "Experience in developing Workplace Health & Safety policies and documentation", "Demonstrated experience in project management", "Understanding of the racing industry and an appreciation for the complex political and public environment in which Tasracing operates", "Experience working with a departmental budget and assisting with financial aspects associated with the delivery of specialised programs", "Current “C” class drivers’ licence", " ", "Key Selection Criteria", " ", "Experience in Project Management and Asset Management paired with a proven ability to achieve compliance with legislation, standards, WHS obligations and policies", "Demonstrable experience completing projects and determining priorities", "Experience in working with a large and regionally diverse team located throughout the state", "Knowledge of the political, economic, legislative environment in which Tasracing operates", "Exceptional interpersonal and negotiation skills to build authentic, collaborative partnerships with stakeholders, industry participants and relevant governing bodies", "Demonstrated communication skills including oral and written skills", "Ability to travel across the state for asset and infrastructure reviews, team meetings, consultant meetings, industry consultation and relationship development purposes", "Experience championing WHS programs, initiatives, policies, and guidelines", " ", "To obtain further information or a copy of the position description please email Belinda Sargent at ", "b.sargent@tasracing.com.au", " or by telephone on ", "0439 582 915", ". ", " ", "To apply for the position of Project & Compliance Officer please submit a covering letter outlining your previous experience along with your resume by 9am Friday 18 June 2021 through the Seek website.", " ", " "], "url": "https://www.seek.com.au/job/52453801?type=standard#searchRequestToken=6e7f244f-dbd0-4835-9acd-d27e785b8804"},
{"search": "Data Analyst", "job_title": "Performance Marketing Manager", "company": "MyState Limited", "location_1": "Hobart", "location_2": "Marketing & Communications", "sector_1": "Marketing & Communications", "sector_2": "Digital & Search Marketing", "work_type": "Full Time", "salary": null, "desc": ["As the Performance Marketing Manager, you will be an integral part of the marketing team responsible for the always on paid digital media strategy across performance channels.", "This is a newly created role in an expanding marketing team, reflecting the high growth targets for acquisition. You will develop and implement the strategy across paid platforms including Google and Facebook and run campaigns across Programmatic Prospecting and Retargeting, SEM and Social.", "Working closely with Digital Acquisition Manager and external agency you will ensure all activities are aligned with broader marketing campaigns, delve deep into the data and manage investments to optimise ROI.", "This role is ideally best suited to an ex-agency hands-on performance marketer who wants to be exposed to strategy, whilst still being responsible for the technical aspects of the role.", " ", "About us", "You might know us as Tasmania’s local bank MyState, but our group also includes TPT Wealth. Employing over 350 people and offering products and services nationally, MyState Limited is growing in and outside of Tasmania.", "Driven by innovation, we’re one of the few banks in Australia to offer Apple, Google and Samsung Pay options to our customers and we’re one of the earliest adopters of PayID and the New Payment Platform. You’ll be joining us at an exciting time in our business as we seek to continue to blaze a trail in modern day banking.", "About you", "Our successful candidate will have a demonstrated ability to develop and manage performance marketing programs to deliver strong ROI, and experience collecting and analysing the appropriate advertising metrics for the purpose of optimisation.", "They will also have:", "·        3-5+ years Performance Marketing experience client or agency side", "·        Hands on experience managing campaigns in Google’s DV360, Campaign Manager 360, Search Ads 360, Native Platforms, Facebook Ads Manager, Youtube and more.", "·        Knowledge and experience in AdTech, buying platforms and bid management tools. Thorough understanding of bid strategies, audience targeting, creative limitations across the different platforms", "·        Proven SEM experience and success managing PPC campaigns ", "·        Strong analytical skills and experience using Google Analytics", "·        Excellent verbal and written communication, with the ability to engage multiple stakeholders across all levels of the business", "For any further information, please contact ", "Recruitment@MyState.com.au", ". To apply, click “Apply Now” by Midnight 20 June, 2021.", "Employment with MyState is subject to a Bankruptcy, Police and Credit check to verify your suitability to work within the finance sector. We are a 2021 Circle Back Initiative Employer – We commit to respond to every applicant."], "url": "https://www.seek.com.au/job/52563320?type=standard#searchRequestToken=6e7f244f-dbd0-4835-9acd-d27e785b8804"},
{"search": "Data Analyst", "job_title": "Senior Quality Assurance Manager", "company": "Private Advertiser", "location_1": "Hobart", "location_2": "Manufacturing, Transport & Logistics", "sector_1": "Manufacturing, Transport & Logistics", "sector_2": "Quality Assurance & Control", "work_type": "Full Time", "salary": null, "desc": ["About the Company", "At Tasmanian Bakeries we are Passionate about Pies, the People who make them and the People who eat them.", "  ", "Tasmanian Bakeries is a rapidly growing Australian privately owned FMCG business that produces and distributes market leading pastry goods to customers across Australia.  For 78 years, Tasmanian Bakeries has been located in Hobart.", "  ", "Purpose: ", "  ", "The Senior Quality Assurance Manager plays a crucial role in ensuring that Tasmanian Bakeries meet all food safety legislative requirements while ensuring that products are of the highest quality standard. ", "  ", "Working closely with stakeholders the Seinor Quality Assurance Manager is the champion of all things safety and quality and plays an active role in educating and training our team on all matters pertaining to QA. ", "  ", "Working closely with our customers the Seinor Quality Assurance Manager ensures that Tasmanian Bakeries meets or exceeds all their food safety and quality requirements.", "  ", "Work Health and Safety Responsibilities:", " ", " ", "Actively participate in and demonstrate safety awareness behaviour relating to workplace health and safety.", " ", "Adhere to all company health & safety policies and procedures.", " ", "Take responsibility for own safe working behaviour.", " ", "At all times ensure that all team members are operating in a safe environment.", " ", "Key Responsibilities & Duties:", " ", " ", "Work closely with the Production Managers & team members to ensure compliance to our Quality Systems & Standards at all times.", " ", "Manage routine internal and external communication with key stakeholders.", " ", "Maintain and update quality assurance records, and other relevant documented materials.", " ", "Educate and assist the team to understand Quality Assurance requirements.", " ", "Provide administrative support to quality processes including collation of supplier compliance actions.", " ", "Coordinate the quality assurance activities such as testing, quality reviews, factory audits, etc.", " ", "Coordinate meetings and work collaboratively with others to implement QA framework.", " ", "Analyse trends and quality related data sets, including extracting data from relevant QA systems.", " ", "Escalate issues as they arise – working as part of a greater team.", " ", "Maintains quality-related data (e.g., testing, reviews) for analysis and reporting in accordance with QA framework.", " ", "Skills and Experience", " ", " ", "5-8 years Food Manufacturing, Food Safety and Hygiene in Australia or the UK.", " ", "Experience in the Australian Bakery sector", " ", "Knowledge of GMP, HACCP, Food Safety and Quality Standards.", " ", "An excellent understanding of CFMSR, BRC, WW auditing standard", " ", "A good understanding of product specification system such as Coles Fusion and WOW Partner Hub.", " ", "Qualifications", " ", " ", "Australian Qualification in Science, Food Science and Technology or equivalent", " ", "Please note this roles is a full time permanent role, located in Hobart, Tasmania. "], "url": "https://www.seek.com.au/job/52537832?type=standout#searchRequestToken=6e7f244f-dbd0-4835-9acd-d27e785b8804"},
{"search": "Data Analyst", "job_title": "Business Development Manager", "company": "Private Advertiser", "location_1": "Hobart", "location_2": "Sales", "sector_1": "Sales", "sector_2": "New Business Development", "work_type": "Full Time", "salary": null, "desc": ["ABOUT THE COMPANY", "NECA is an Industrial Association representing the interests of the electrical and communications contracting industry across Australia, for over a century. As a not-for-profit thriving business and association, we pride ourselves in providing excellent service, guidance and advice to our members to help them build stronger businesses and to represent their interests to the government. Being the peak industry body within Australia, we also provide support, education, training, legal advice and supply of uniform through our secondary businesses to meet the needs of our members. ", "Primarily, our goal is to lift the standards of the Electrotechnology Industry and provide a voice and fight for the rights and interests of our members, while delivering critical information to ensure that our members remain in front of changes that may affect the Industry.", "ABOUT THE ROLE", "As our Business Development Manager, your primary mission is to increase growth of sales in membership and other associated products and services within Tasmania.", "RESPONSIBILITIES", "Developing growth strategies and plans", "Managing and retaining relationships with existing members", "Increasing membership base", "Having an in-depth knowledge of NECA’s products, services and value proposition", "Writing business proposals", "Negotiating with stakeholders", "Identifying and mapping business strengths and customer needs", "Researching business opportunities and viable income streams", "Following industry trends locally and nationally", "Reporting on successes and areas needing improvements", "WHAT WE'RE LOOKING FOR", "As a new role in Tasmania, this opportunity is perfect for someone seeking to use their well-honed sales skills as well as broad based marketing flair and make it their own.", "As the face of NECA, to not only bring in new business, this role also will maintain and network to build lasting and strong industry partnerships.", "We are after someone who isn’t driven by a full time office environment, and loves hitting the road to spread their wings and the message of NECA to a wider audience. Coupled with this, we need someone who understands marketing and is willing to take on our social media presence, and chip in with our online marketing and website.", "This role will be a pivotal player in the NECA team, contributing to our processes and successes in multiple areas - an incredible opportunity to truly make your mark.", "We're after someone who gets a kick out of making new contacts, hitting sales targets and seeing the wins flow through the door. Someone who thrives amid the buzz of an event and networking within the buzzing careers market and seeing young people’s careers start, and flourish.", "Whilst a lot of this job is “on the road” sales, you are also a team member who is keen to integrate the sales and marketing function into a seamless operational back end, leaving no detail untied.", "You're ambitious, you love sales, and have a drive for the advancement of your own career and those of your colleagues.", "You have enough sales and marketing experience with associated education and qualifications to ensure you can act autonomously in the role.   ", "You're a client-focused listener and communicator, taking complex ideas and articulating them clearly as directions and solutions comes naturally to you.", "This role would suit an ex tradie with some sales “know how” keen to put down the tools and move into sales and education, or equally an energetic sales person keen to immerse themselves in our electrical world. ", "This full-time role not only offers a generous salary package, but also a fully maintained car for work and private use, and a permanent working from home arrangement.", "ESSENTIAL CRITERIA", "Excellent oral and written communication skills, interpersonal skills and consultation skills", "Excellent computer, numerical and literacy skills", "Skills in the analysis and interpretation of data and statistical information", "Strong organisational and planning ability", "Experience in working in a customer focused business environment requiring accuracy, initiative and problem-solving skills", "Commitment to client focus, excellent client service skills, and proven ability to develop and influence client relationships", "Ability to coordinate tasks, set priorities, work under pressure and meet deadlines", "Ability to work as part of a team as well as independently with minimal supervision", "The ability to gauge the needs of members and to serve these needs with efficiency and accuracy", "Demonstrated ability to maintain confidentiality", "Experience in use of Microsoft Office systems and software including Word, PowerPoint and Outlook", "A current driver’s licence", "Knowledge of the electrical trade is ideal", "Knowledge in WHS will be highly favourable", "If you believe you are the right person for us, please apply. ", "If any additional information is required, please contact ", "yusur.al-hiali@necatraining.com.au", ", however please note that all applications will be processed via Seek ONLY. ", "All applicants must have the right to live and work in Australia.", "Any applications not responded to within 30 days have been unsuccessful.", " "], "url": "https://www.seek.com.au/job/52530911?type=standout#searchRequestToken=6e7f244f-dbd0-4835-9acd-d27e785b8804"},
{"search": "Data Analyst", "job_title": "Senior Water Resources Engineer", "company": "Entura", "location_1": "Hobart", "location_2": "Engineering", "sector_1": "Engineering", "sector_2": "Water & Waste Engineering", "work_type": "Full Time", "salary": null, "desc": ["At Entura, we’re proud to be empowering people and communities with safe, smart renewable energy. Across Australia and around the Indo-Pacific, we design world-class sustainable power and water solutions to build a better future. With some of the brightest minds in the industry, we have the expertise, creativity and passion to make lasting change. Which is exactly where you come in – you’ll manage and deliver", " ", "engineering projects associated with the analysis of hydraulic, hydrological, meteorological and environmental data and provide modelling assessments and engineering design of civil infrastructure with a water focus.", "\n", "What you will be doing:", "You will have the opportunity to deliver a broad range of hydraulic design projects that include rivers, spillways, dams, weirs, hydroelectric power stations, pipe networks, bridges, pumping stations, intakes, tunnels, syphons, canals, town stormwater systems, erosion protection works, and renewable energy infrastructure.  We have a unique asset-owner heritage with over 100 years of experience in contributing to the development, operation and maintenance of renewable energy and water infrastructure.  As a result, you will work with some of Australia’s leading minds in the renewables space.", "\n", "You will also work closely with your team to grow the business through efficient and effective project delivery, whilst maintaining a focus on quality, innovation, training and the use of new methodologies that add value to our clients.  Your team will look to you to coach, mentor and lead them with a view to their development as technical experts and people leaders.", "\n", "What we are looking for:", "\n", "\n", "Experience in a consulting or commercial environment, ideally from within the water management field", "\n", "A strong desire to make a positive impact to our customers", "\n", "Ideally 8+ years’ experience in hydraulic engineering and the design of water quantity and quality management solutions", "\n", "Experience and a strong interest in mentoring and training future technical specialists and people leaders", "\n", "Demonstrated experience organizing, planning, and executing the complete life-cycle of projects involving internal personnel, contractors, and vendors", "\n", "Project management or coordination experience in a commercial environment", "\n", "Tertiary qualifications in civil or environmental engineering", "\n", "Strong hydraulic and hydrologic modelling skills using a range of software including semi-distributed lumped hydrological models (RORB, HEC-HMS), 1D/2D/3D hydraulic models (TUFLOW, HEC-RAS), water hammer analysis, CFD analysis, GIS, Autodesk Civil3D or 12D.", "\n", "\n", "What you can expect:", "\n", "\n", "Flexible, family-friendly working conditions", "\n", "Opportunities for development and career progression, at the forefront of a rapidly evolving renewable energy transition", "\n", "Local, national and international travel", "\n", "\n", "About Entura’s family: the Hydro Tasmania group", "Hydro Tasmania is Australia’s leading clean energy business, largest producer of renewable energy, and largest water manager. We’re more than 100 years old, but we’re moving at pace to grow so that we can lead the way to a more sustainable future. From our beautiful home base in Tassie to the bright lights of Melbourne and beyond, we offer opportunities you won’t find at other energy companies. Whether you join the group at Hydro Tasmania, Entura or Momentum, you’ll enjoy the challenge of new opportunities, the satisfaction of meaningful work and the support to make a difference. Our greatest assets are our people, so let your journey join our journey as we make energy better together.", "\n", "We are passionate about diversity and inclusion and welcome applications from qualified candidates of all ages, cultural backgrounds, abilities and genders. There’s a place for you amongst us to belong, and we welcome you to speak to us about any special requirements you may have to give you the best opportunity for success.", "\n", "We’d love to hear from you!", "To apply for, please attach your resume and a cover letter detailing what you’ll bring to the position."], "url": "https://www.seek.com.au/job/52483550?type=standout#searchRequestToken=6e7f244f-dbd0-4835-9acd-d27e785b8804"},
{"search": "Data Analyst", "job_title": "Team Leader Family Services - Launceston/Devonport", "company": "Save the Children Australia", "location_1": "Launceston & North East", "location_2": "Community Services & Development", "sector_1": "Community Services & Development", "sector_2": "Child Welfare, Youth & Family Services", "work_type": "Contract/Temp", "salary": "Full salary packaging benefits available", "desc": ["No two days are the same in Save the Children Australia's Children and Families programs which run across Tasmania. We need you to lead our team in Launceston and Devonport to deliver evidence-based parenting programs to families and children with complex, high needs. We're seeking someone who has a passion for assisting our communities' most vulnerable, at risk children and families to reach their full potential.", " ", " ", "Save the Children is no ordinary not-for-profit.", " ", " We're ambitious, creative and outspoken. We stand up for children's rights. We want all children to be educated, healthy and live a life free from violence. We've been operating in Tasmania for nearly 70 years, working with families, communities and children themselves to give them the best possible start. More information on our work in Tasmania is available ", "here", ".", " ", " ", "Where you come in:", " ", " Based in Launceston or Devonport*, this is a part-time, fixed term position to end of June 2022 (with potential for extension). You'll lead team members to deliver the Intensive Family Engagement Service (IFES) and the Integrated Family Support Service (IFSS) across the broader northern Tasmanian region, and will be accountable for the operational running of all program activities, budget oversight and supporting your staff. Playing a key leadership role in our Tasmanian Programs team, you'll report to our Regional Manager.", " ", " * This role spans both Launceston and Devonport areas (approximately an hour drive apart). It would be expected that the Team Leader would make regular trips once or twice a fortnight to meet and debrief with staff in person.", " ", " ", "You will make an impact by:", "Building and maintaining effective networks with stakeholders to maximise positive outcomes for families and children", "Prioritising monitoring and evaluation of the program with a strong focus on therapeutic engagement and safety planning to promote safety for children", "Providing regular leadership to the program team through coaching and professional supervision", "Working with our Operations Manager to manage budgeting and data collection, and meeting internal and external reporting requirements", "Does this sound like you?", " ", " Working from a strengths-based perspective, you'll be someone who highly values the wellbeing of their staff. You'll have experience in leading a team and delivering professional supervision, in carrying out risk assessments and in managing the safety of children in vulnerable families. Importantly, you'll keep the values of Save the Children at the forefront of your work and will always seek excellence in the services we provide to families.", " ", "This role requires:", "Demonstrated experience managing a team and driving a high performing team culture", "Demonstrated experience working with families in case management roles, in diverse and disadvantaged communities", "Willingness to travel between Launceston and Devonport, as above", "Working knowledge of the Tasmanian Child Safety System", "A diploma level certification (minimum) in a relevant field", "Current driver's licence and Working with Vulnerable People Card (or eligibility to apply)", "Proven leadership skills, the ability to nurture a cohesive team", "Working at Save the Children is more than just a job.", " ", " It's the feeling of knowing that your work is contributing to making the world a better place for children and working with others who feel the same. In addition to a connection to social causes, you will have access to:", "Festive leave in addition to regular leave benefits", "Individual learning plans to assist in your career development", "Friendly and flexible work environment", "Child friendly work environment", "Award rate salary plus full salary packaging benefits", "Professional supervision training and monthly supervision sessions", "Sound interesting?", " ", " We'd love to hear from you. Submit your cover letter and resume by clicking on one of the buttons in the 'Apply' section. For any enquiries, contact Regional Manager, Joleigh Jumper on ", "0407 032 375", ".", " ", " Applications close ", "Thursday 24th June 2021.", " ", " Position Description - ", "Team Leader, Family Services", " ", " ", "At Save the Children, we seek a workforce that is as diverse as our society - in race, ethnicity, gender, age, sexuality, cultures and beliefs - and reflects the communities we work in. We believe diversity and inclusion are fundamental to our culture and core values and we demonstrate this commitment through all our employment practices. Our inclusive workplace culture contributes to making Save the Children a great place to work. We strongly encourage Aboriginal and Torres Strait Islander applicants to apply.", " ", " ", "Save the Children Australia is a child-safe organisation. All employees are required to undergo a National Police Check, a Working with Children Check where necessary, and sign our Child Safeguarding Policy and Code of Conduct.", " ", " ", "Save the Children Australia supports the Inter-Agency Misconduct Disclosure Scheme. If you are successful in your application, we will request consent to access HR held information pertaining to your last 5 years of employment. You can read about the Scheme and our commitment to Safeguarding", " ", "here", "."], "url": "https://www.seek.com.au/job/52512301?type=standout#searchRequestToken=6e7f244f-dbd0-4835-9acd-d27e785b8804"},
{"search": "Data Analyst", "job_title": "APS3 Front of House Business Support Officer", "company": "DFP Recruitment", "location_1": "Devonport & North West", "location_2": "Administration & Office Support", "sector_1": "Administration & Office Support", "sector_2": "Receptionists", "work_type": "Contract/Temp", "salary": "$36.27 per hour", "desc": ["We are seeking an enthusiastic and professional Front of House Officer to join the team within a Federal Government Agency based in Devonport. This role will be on a contract basis until June 2022 and will be an equivalent APS3 level.", " ", "The Role: ", " ", " As the Front of House Officer, you will assist customers in a face to face environment by answering enquiries, booking appointments, making assessments on eligibility for payments and undertaking processing and system entry activities related to a customer’s needs. In addition, you will provide general administrative support to the wider team.", " ", "You will handle a wide range of matters regarding eligibility, participation and ongoing access to payments and services for participants. ", " ", " ", "Responsibilities include:", "Providing face to face customer service to participants, families, and carers", "Dealing with challenging and at times, emotional discussions and issues", "Providing general administrative support and contributing to the operations of the work area", "Undertaking monthly accruals of accounts and reconciliation of cab charges and credit cards", "Data entry and analysis, including collation of reports", "Provide thorough information and effective support to internal and external stakeholders.", "Work under limited direction to provide administrative support to the regional team.", "Coordination of appointments with the use of Agency office facilities and ensure these facilities are neat and appropriately prepared for each participant.", "About you:", " ", " ", "As the Front of House Officer, you will present with a high level of personal resilience and the ability to deal with emotional and challenging customer circumstances and high workload demands. This role will involve ", "liaising with participants on a face to face basis and at times, delivering difficult news / handling challenging conversations.", "To be successful in this role you will ideally have proven experience within a customer service environment, ideally within a Government setting. ", "In addition, you will demonstrate the following skills and experience:", "Advanced MS Office Suite", "Office Support/Administration (minimum of 2 years)", "Strong Customer Service experience", "Strong communication skills, both verbal and written", "Excellent interpersonal skills", "Strong organisational skills", "A high attention to detail", "Having a strong interest or previous experience with the Disability Sector would be an advantage.", "As this role is within the Federal Government, applicants are required to hold Australian Citizenship or Permanent Residency at time of application.", "If you are interested in this role, please APPLY NOW or call DFP on ", "(03) 8632 9900", " for more information.", "DFP welcomes applications from Aboriginal and Torres Strait Islander people, people with diverse cultural and linguistic backgrounds and people with disability. In addition, DFP will provide reasonable adjustments for individuals with disability throughout the recruitment process. If you identify as a person with disability and require adjustments to the application, recruitment, selection and/or assessment process, please advise via ", "adjustments@dfp.com.au", " or ", "1300 337 000", " and indicate your preferred method of communication (email, phone, text) so we can keep in touch and meet your accessibility needs."], "url": "https://www.seek.com.au/job/52359415?type=standard#searchRequestToken=6e7f244f-dbd0-4835-9acd-d27e785b8804"},
{"search": "Data Analyst", "job_title": "Medical Liaison Officer", "company": "Radiology Tasmania", "location_1": "Hobart", "location_2": "Healthcare & Medical", "sector_1": "Healthcare & Medical", "sector_2": "Sales", "work_type": "Full Time", "salary": null, "desc": ["About us", "Radiology Tasmania is part of the Capitol Health Limited group. Capitol Health is a national network of community-based diagnostic imaging clinics including the brands: Capital Radiology, Radiology Tasmania, Imaging Olympic Park, Fowler Simmons Radiology, and Direct Radiology. We're a team of 750+ medical experts and experienced staff who put people first. We focus on providing affordable services, supported by the latest technology, accessible clinics and skilled, compassionate staff. Our patients experience better outcomes and our referrers trust us to deliver high-quality images and comprehensive reports", "We currently have an opportunity for an experienced Medical Liaison Officer to join our team in Tasmania in a full-time or Part-time capacity", " ", "Qualifications & experience", "Medical sales experience mandatory", "A strong work ethic", "Be a team player", "Strong verbal and written communication skills", "Solid computer skills (Office suite)", "Excellent organisational and time management skills", "Exceptional customer service skills", "Highly motivated to achieve both individual and company results", "Demonstrated resilience and adaptability to engage with change", "Have a full Australian driver's license and car", "Tasks & responsibilities", "As a medical liaison officer you will work closely with our operations and clinical teams at Radiology Tasmania and will be responsible for:", "Developing and Managing strong relationships with key stakeholders", "Managing your assigned region via a CRM", "Meeting KPI targets", "Regular meetings with management to monitor and adjust sales plans", "Data collection and analysis of referral patterns", "Regular reporting to management on sales activities and associated results", "Executing an already developed sales plan based on your region", "Benefits", "A competitive base salary and generous incentive package", "KPI bonus scheme", "Flexible working arrangements", "Car allowance", "Tools of trade", "On-going support and training", "Our company Values are: Patient-centred. One team. Excellence. Integrity. Community-focused.", "To apply for this position please email your resume and cover letter to ", "sholmes@radiologytasmania.com.au", " or for more information please call Sarah Holmes on ", "03 6223 4899"], "url": "https://www.seek.com.au/job/52381947?type=standout#searchRequestToken=6e7f244f-dbd0-4835-9acd-d27e785b8804"},
{"search": "Data Analyst", "job_title": "Natural Resources Scientist", "company": "Tasmanian Irrigation", "location_1": "Launceston & North East", "location_2": "Science & Technology", "sector_1": "Science & Technology", "sector_2": "Environmental, Earth & Geosciences", "work_type": "Full Time", "salary": null, "desc": ["Natural Resources Scientist", "Tasmanian Irrigation Pty Ltd (TI) is the state-owned", "company responsible for developing and operating irrigation", "schemes funded through public/private partnerships.", "With 18 operational irrigation schemes, 3 mini hydro plants and $185M", "of funding for the development of new schemes it is exciting times", "ahead for TI and the Tasmanian Agribusiness sector.", "TI is seeking an experienced Natural Resources Scientist based at", "our Launceston Office with the opportunity to regularly work across", "Tasmania in our irrigation schemes.", "The role’s key responsibilities include:", "• Implement and manage TI’s surface water and aquatic habitat", "monitoring program", "• Overseeing regulatory approval processes for construction and", "maintenance of irrigation schemes", "• Complete reporting to meet State and Federal compliance obligations", "• Design water quality and habitat monitoring programs for schemes", "• Contribute to the development and oversight of water quality", "monitoring programs for construction activities", "• Ensure reliable, validated and high-quality data for use in TI’s", "reporting processes", "• Provide environmental support services to internal staff as required", "• Complete fauna and flora field surveys and impact assessments, including", "background research, data management, analysis and reporting", "• Manage the aquatic health of rivers and TI’s storages; including algal", "blooms, aquatic weeds and pest fish", "• Complete flora and fauna permit applications", "• Utilise and manipulate Tasmanian Irrigation’s ESRI GIS system", "You will need to be tertiary (degree) qualified in Environmental", "Science, Ecology or a related discipline, and have a minimum of", "5 years of working experience overseeing approval processes and/or", "monitoring programs.", "The successful candidate will understand and implement Workplace", "Health and Safety responsibilities.", "A full position description can be found at TI’s website:", "www.tasmanianirrigation.com.au.", "All applications must address the Key Roles and Responsibilities, and", "the essential skills requirements including the Workplace Health and", "Safety criteria and outline the applicant’s knowledge and experience.", "Any enquiries and application should be sent to:", "recruitment@tasirrigation.com.au", " by COB 26 June 2021"], "url": "https://www.seek.com.au/job/52527862?type=standard#searchRequestToken=6e7f244f-dbd0-4835-9acd-d27e785b8804"},
{"search": "Data Analyst", "job_title": "Senior Metallurgist", "company": "Dundas Mining Pty Ltd", "location_1": "Devonport & North West", "location_2": "Mining, Resources & Energy", "sector_1": "Mining, Resources & Energy", "sector_2": "Mining - Processing", "work_type": "Full Time", "salary": null, "desc": ["Senior Metallurgist", " ", "Dundas Mining Pty Ltd operates Avebury Nickel Mine on the West Coast of Tasmania.", " ", "  ", "Avebury Nickel Mine has a vacancy in our Processing Department for a Senior Metallurgist.", "                                                         ", "  ", "  ", "About the role:", " ", " ", "Reporting to the Process Manager", " ", "Responsible for the Metallurgical accounting, daily, weekly, monthly, and yearly Met reporting", " ", "Supporting ongoing operation, development and continuous improvement of the process plant", " ", "Develop and Supervise plant test work plans and analyse data with statistical analysis methods", " ", "Communicating status of improvement projects to various levels of the business including the Senior Leadership Team", " ", "Liaising with key stakeholders such as the Operations, Metallurgical Technicians and Maintenance Team", " ", "Supervision and development of Plant Metallurgist, Graduate Metallurgists, and Met Techs", " ", "Manage the onsite laboratory", " ", "Skills and experience:", " ", " ", "Tertiary qualifications in Extractive Metallurgy, Chemical Engineering or Mineral Processing Engineering", " ", "5+ years’ experience in a similar role within a mineral processing environment; Nickel processing experience will be highly regarded.", " ", "Analytical skills, good attention to detail and problem-solving skills, and statistical analysis", " ", "Good knowledge of Laboratory safety and operational practices", " ", "A strong knowledge of MS Office products in particular Excel, Word, and Access", " ", "Manual Australian Drivers Licence.", " ", "Please note, only candidates with current fulltime working rights within Australia will be considered.", "  ", "This role is residential, or DIDO room only accommodation.", "  ", "If you have the relevant qualifications, skills and experience outlined above, we would like to hear from you.", "  ", "Send your cover letter and resume to:  ", "employment@aveburymetals.com.au", "  ", "Closing date: 13th June 2021"], "url": "https://www.seek.com.au/job/52384630?type=standout#searchRequestToken=6e7f244f-dbd0-4835-9acd-d27e785b8804"},
{"search": "Data Analyst", "job_title": "Study Director", "company": "Tassal Operations Pty Ltd", "location_1": "Hobart", "location_2": "Farming, Animals & Conservation", "sector_1": "Farming, Animals & Conservation", "sector_2": "Fishing & Aquaculture", "work_type": "Full Time", "salary": null, "desc": ["Are you ready to work for Australia’s leading seafood producer? Do you have a love for data, scientific reporting, and stats? If so, you may be the person we are looking for!", " ", "Our products are on dinner plates and in lunch boxes right across Australia. With over 30 years of experience, we are industry leaders, innovators, safe and diligent producers and first and foremost, we are responsible farmers who prioritise our people, their safety and the communities in which we operate.", " ", " ", " ", "We are farmers. Our communities form our heartland. Our people are our heartbeat.", " ", " ", " ", "The Opportunity ", " ", "As a Study Director you will be working closely with our Animal Health team at our Haywards site in Margate, reporting to the Senior Manager- Animal Health & Welfare. You will have a love for all things data and scientific reporting. Interacting with a wide range of people, from corporate, technical services, environment department, salmon farms and prawn farms, you will be responsible for supporting Tassal’s animal health and production strategy by assisting in research and delivery of biological results that meet Tassal’s strategic plan through ensuring the generation of robust trial information. This position will also provide support in achieving Tassal’s objectives in relation to carrying capacity, animal health across salmon and prawn farming divisions, preventative production medicine, and support of internal and external research and development initiatives. This position is full time, Monday-Friday. ", " ", "You ", " ", "To be considered for this role you will have;", " ", " ", "Tertiary qualifications in veterinary science or marine biology (or another related field);", " ", "Passion in and exposure to aquatic animal health;", " ", "Ability to capture and translate data into meaningful information;", " ", "Amazing attention to detail;", " ", "Love of data and the passion to translate data, opportunity and analysis into a language that motivates stakeholders to act;", " ", "Capacity to interpret and act upon data in various formats;", " ", "Exceptional communication and reporting skills (verbal and written);", " ", "The ability to work autonomously and as part of a team;", " ", "Scientific knowledge and research skills and;", " ", "Ambition to thrive in a team environment and enjoy celebrating our successes along the way!", " ", "About us", " ", "We’re passionate about farming and we’re proud of it! We are committed to protecting the environment we operate in and ensuring the farmed seafood we produce is of the highest quality so that you can continue to enjoy it today and into the future. As the world changes, we adapt, and through a combination of science, technology and passion, we’re revolutionising seafood farming in Australia. We strive for excellence across our four critical factors of success (4P's) - Our People, Our Planet, Our Product and Our Performance and are recognised as an Employer of Choice. To learn more about our business, people and products visit  www.tassal.com.au ", " ", " ", " ", "If this is a home-grown Australian success story that you want to be a part of - apply today!", " ", " ", " ", "Interested? Hit the apply now button or head to the vacancy on our website to apply directly http://tassalgroup.com.au/our-people/join-our-team/ ", " ", " ", " ", "For a confidential discussion regarding this role, please contact Rebekah Willmer, People and Culture Manager on ", "0427 174 757", ". Applications close Wednesday 23 June 2021 at 9.00am."], "url": "https://www.seek.com.au/job/52426835?type=standout#searchRequestToken=6e7f244f-dbd0-4835-9acd-d27e785b8804"},
{"search": "Data Analyst", "job_title": "Plant Metallurgist", "company": "Bluestone Mines Tasmania Joint Venture P ty Ltd", "location_1": "Devonport & North West", "location_2": "Mining, Resources & Energy", "sector_1": "Mining, Resources & Energy", "sector_2": "Mining - Processing", "work_type": "Full Time", "salary": null, "desc": ["Tasmania Tin Operations", "Renison Mine", " ", "About Bluestone", "Bluestone Mines Tasmania Joint Venture Pty Ltd, is Australia's largest Tin producer. Bluestone is a well-established, high yield tin mine now entering an exciting redevelopment period. The Renison mine is located on Tasmania's beautiful West Coast between the towns of Zeehan and Rosebery.", "About the mine", "The Renison Processing Plant consists of a diverse range of processing stages, including a new crushing, screening and ore sorting plant, rod and ball mill grinding, sulphide and oxide flotation, gravity concentration, state-of-the-art 24 stream sampling and on-stream analysis, historian data management system, and concentrate leaching. A feasibility study into tailings retreatment via mineral processing and pyrometallurgical treatment is also currently underway.", "About the role", "We are currently seeking a metallurgy professional to join the processing department technical team, to actively contribute to optimising metallurgical and production performance in one of Australia's most complex and diverse concentrators.", "The position will be reporting to the Metallurgical Superintendent and be part of a team who are focused on working together to deliver improvement. This is a great opportunity for an enthusiastic and results driven person be part of an exciting journey.", "This position is offered on 8 days on, 6 days off roster.", "Core responsibilities", " ", "Responsible for all metallurgical functions associated within the plant and monthly reporting,", " ", "Conducts and participates in audits, reviews and quality assurance activities associated with managing operational and metallurgical functions.", " ", "Design, supervision, and conducting of metallurgical test work and sampling programs,", " ", "Metallurgical test work planning and execution, analysis, and technical reporting,", " ", "Survey planning, execution, analysis, and technical reporting,", " ", "Liaison with engineering and service providers in accordance with set project requirements,", " ", "Project work in the Renison processing plant,", " ", "Ensure job specific safety skills & responsibilities are met,", "About you", "To be successful in this role you will require tertiary qualifications in Metallurgy or Chemical Engineering and a minimum of 3 years post graduate experience. Exposure to gravity and flotation processes would be advantageous.", "Strong communication and interpersonal skills are a must, allowing you to build relationships across departments and to communicate at all levels.", "This is an exciting opportunity to join a friendly and inclusive team where results are rewarded, and new ideas are encouraged and supported.", "Bluestone Mines Tasmania offers a range of lifestyle options, catering for both residential and drive in drive out options.  Attractive residential benefits are available or alternatively, fully catered modern Single Persons Quarters are available for those seeking a drive-in-drive-out option.", " ", "Close date: 02 July 2021", "To apply online, please click on the appropriate link below."], "url": "https://www.seek.com.au/job/52576964?type=standard#searchRequestToken=6e7f244f-dbd0-4835-9acd-d27e785b8804"},
{"search": "Data Analyst", "job_title": "NDIS Community Manager", "company": "Baptcare", "location_1": "Hobart", "location_2": "Community Services & Development", "sector_1": "Community Services & Development", "sector_2": "Aged & Disability Support", "work_type": "Full Time", "salary": null, "desc": ["NDIS Community Manager", "Hobart - TAS", "Full Time - Fixed Term until 31st March 2022", "- Opportunity to make a significant contribution", "- A supportive team environment", "- Salary packaging options", "About the Organisation:", "Baptcare is a customer focused, faith centred and purpose driven organisation working across Victoria and Tasmania, providing residential and community care for older people and support to children, families, and people with disability, financially disadvantaged people and people seeking asylum.", "About the role:", "This position plans, designs, develops, implements and evaluates a range of community and capacity building related engagements and activities. The focus of the Community Engagement Manager role is to work collaboratively with the Baptcare team to develop a plan of activity's engaging with participants and community, partnerships with relevant peak bodies and community organisations and provide guidance to the broader organisation on engagement related activities. Creating communities where people with disabilities can engage both directly and indirectly with a range of natural supports and resources over their lifetime. This position works across multiple programs and regions in an autonomous manner with frequent travel within communities, and have passion and commitment to community development, person lead approaches and the ability to work in an environment of change, flexibility, creativity and innovation", "Duties:", "* Build strong relationships with key internal and external stakeholders to facilitate participation in a diverse range of small and large scale events including information sessions, forums, conferences and webinars", "* Provide logistical management and advice to deliver engagement activities", "* Contribute to the implementation and operationalisation of a targeted engagement strategy including events calendars aligned to the broader engagement strategy and corporate plan", "* Work with the leadership team to promote best proactive engagement and community capacity building activities", "* Coordinate critical data analysis and feedback to measure effectiveness of activities and strategies", "Please refer to Position Description for further details.", "Qualifications and Experience:", "Essential :", " A relevant tertiary qualification in disability, capacity building and empowerment or community services (or demonstrated enrolment and progress to completion) and 2 years experience working with people with a disability.", "Desirable :", " Management and Leadership Diploma, at least 2 years experience working in management and leadership role, previous experience of community capacity building and community development", "How to Apply:", "Please visit ", "https://www.baptcare.org.au/vacancies", " to locate this role and the role statement on our vacancies page and click ", "'Apply Now'", " ", "Please provide a cover letter, current resume and address the Selection Criteria within the Position Description.", "Please forward queries to Robyn Jones on ", "rjones@baptcare.org.au", "Applications close 18 June 2021, 5pm", "Only short-listed applicants will be contacted.", "Applicants must have the right to work in Australia.", "Appointment to this position is subject to a satisfactory National Police Clearance and a current Influenza Vaccination.", "Baptcare subscribes to a mobile and flexible work environment.", "Baptcare is committed to building a respectful and inclusive workplace, appointing the best p", "erson ", "for the role and supporting diversity.", " "], "url": "https://www.seek.com.au/job/52436123?type=standard#searchRequestToken=6e7f244f-dbd0-4835-9acd-d27e785b8804"}
]